#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccoladeCollectionScreen

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "AccoladesRuntime_structs.hpp"


namespace SDK
{

// Class AccoladeCollectionScreen.FortAccoladeStageListEntry
// 0x0020 (0x0300 - 0x02E0)
class UFortAccoladeStageListEntry final : public UCommonUserWidget
{
public:
	uint8                                         Pad_2E0[0x18];                                     // 0x02E0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaChallengeRewards*                UserWidget_Rewards;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_PopulateAchievedCount(int32 AchievedCount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAccoladeStageListEntry">();
	}
	static class UFortAccoladeStageListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAccoladeStageListEntry>();
	}
};

// Class AccoladeCollectionScreen.FortAccoladeStagesListView
// 0x0110 (0x0390 - 0x0280)
class UFortAccoladeStagesListView final : public UListViewBase
{
public:
	uint8                                         Pad_280[0x108];                                    // 0x0280(0x0108)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EntrySpacing;                                      // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAccoladeStagesListView">();
	}
	static class UFortAccoladeStagesListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAccoladeStagesListView>();
	}
};

// Class AccoladeCollectionScreen.PinnedAccoladeWidget
// 0x0010 (0x0330 - 0x0320)
class UPinnedAccoladeWidget final : public UFortHUDElementWidget
{
public:
	class UFortLazyImage*                         LazyImage_PinColor;                                // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumAllowedDescCharacters;                          // 0x0328(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_PopulateAccoladeInfo(const class FText& Description, int32 Achieved, int32 Total);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PinnedAccoladeWidget">();
	}
	static class UPinnedAccoladeWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPinnedAccoladeWidget>();
	}
};

// Class AccoladeCollectionScreen.FortCollectionDataEntryAccolade
// 0x0010 (0x0040 - 0x0030)
class UFortCollectionDataEntryAccolade final : public UFortCollectionDataEntry
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionDataEntryAccolade">();
	}
	static class UFortCollectionDataEntryAccolade* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionDataEntryAccolade>();
	}
};

// Class AccoladeCollectionScreen.FortPlayerAccoladeCollectionListEntry
// 0x0010 (0x1580 - 0x1570)
class UFortPlayerAccoladeCollectionListEntry final : public UAthenaCollectionListEntry
{
public:
	class UImage*                                 Image_Background;                                  // 0x1570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ParamName_ItemIcon;                                // 0x1578(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ParamName_IsDiscovered;                            // 0x157C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_OnPinnedChanged(const bool bPinned);
	void BP_OnSelectionSuppressionChanged(const bool bShouldBeSuppressed);
	void BP_UpdateAccoladeTier(EFortAccoladeTierType Tier);
	void BP_UpdateCompletedCount(int32 CompletedCount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAccoladeCollectionListEntry">();
	}
	static class UFortPlayerAccoladeCollectionListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAccoladeCollectionListEntry>();
	}
};

// Class AccoladeCollectionScreen.FortPlayerAccoladeCollectionScreen
// 0x0088 (0x06C0 - 0x0638)
class UFortPlayerAccoladeCollectionScreen final : public UAthenaCollectionScreenBase
{
public:
	uint8                                         Pad_638[0x30];                                     // 0x0638(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         AccoladesEnabledViaHotfix;                         // 0x0668(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_CategoryTitle;                                // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ClearBangs;                                 // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6A0[0x18];                                     // 0x06A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUserProgressSuccessfullyRetrieved;                // 0x06B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAccoladeCollectionScreen">();
	}
	static class UFortPlayerAccoladeCollectionScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAccoladeCollectionScreen>();
	}
};

// Class AccoladeCollectionScreen.FortPlayerAccoladeCollectionScreenContainer
// 0x0018 (0x0548 - 0x0530)
class UFortPlayerAccoladeCollectionScreenContainer final : public UAthenaCollectionScreenContainer
{
public:
	class UAccoladeProductData*                   BRProductData;                                     // 0x0530(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_538[0x10];                                     // 0x0538(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_PopulateProgress(int32 Current, int32 Total);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAccoladeCollectionScreenContainer">();
	}
	static class UFortPlayerAccoladeCollectionScreenContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAccoladeCollectionScreenContainer>();
	}
};

// Class AccoladeCollectionScreen.FortPlayerAccoladeCollectionScreenInfoOverlay
// 0x0010 (0x04C0 - 0x04B0)
class UFortPlayerAccoladeCollectionScreenInfoOverlay final : public UAthenaCollectionScreenInfoOverlay
{
public:
	class UFortCTAButton*                         Button_TrackAccolade;                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAccoladeStagesListView*            ListView_AccoladesStages;                          // 0x04B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_PopulateAccoladeInfo(int32 CompletionCount);
	void BP_UpdateAccoladeTier(EFortAccoladeTierType Tier);
	void BP_UpdateTrackButtonText(const bool bTracked);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAccoladeCollectionScreenInfoOverlay">();
	}
	static class UFortPlayerAccoladeCollectionScreenInfoOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAccoladeCollectionScreenInfoOverlay>();
	}
};

}

