#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccoladesUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "AccoladesRuntime_structs.hpp"


namespace SDK::Params
{

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetCount
// 0x0004 (0x0004 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetIcon
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetIcon final
{
public:
	const class UFortAccoladeItemDefinition*      ItemDef;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetIconImage
// 0x0028 (0x0028 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetIconImage final
{
public:
	TSoftObjectPtr<class UTexture2D>              IconImage;                                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortAccoladeType                             AccoladeType;                                      // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortAccoladeTierType                         AccoladeTier;                                      // 0x0021(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetJustCompleted
// 0x0001 (0x0001 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetJustCompleted final
{
public:
	bool                                          bJustCompleted;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetSource
// 0x0010 (0x0010 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetSource final
{
public:
	class FText                                   SourceText;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AccoladesUI.AthenaAccoladeListEntryWidget.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct AthenaAccoladeListEntryWidget_SetTitle final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

}

