#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Account

#include "Basic.hpp"


namespace SDK
{

// Enum Account.EExternalAccountType
// NumValues: 0x000A
enum class EExternalAccountType : uint8
{
	None                                     = 0,
	Facebook                                 = 1,
	Google                                   = 2,
	Epic_PSN                                 = 3,
	Epic_XBL                                 = 4,
	Epic_Erebus                              = 5,
	Epic_Facebook                            = 6,
	Epic_Google                              = 7,
	Epic_Portal                              = 8,
	EExternalAccountType_MAX                 = 9,
};

// Enum Account.EConsoleAuthLinkState
// NumValues: 0x0009
enum class EConsoleAuthLinkState : uint8
{
	NotOnConsole                             = 0,
	ConsoleNotLoggedIn                       = 1,
	EpicNotLoggedIn                          = 2,
	ThisEpicAccountLinked                    = 3,
	OtherEpicAccountLinked                   = 4,
	NoEpicAccountLinked                      = 5,
	PrimaryIdNotLinked                       = 6,
	SecondaryIdNotLinked                     = 7,
	EConsoleAuthLinkState_MAX                = 8,
};

// Enum Account.ELoginResult
// NumValues: 0x0034
enum class ELoginResult : uint8
{
	NotStarted                               = 0,
	Pending                                  = 1,
	Success                                  = 2,
	Console_LoginFailed                      = 3,
	Console_AuthFailed                       = 4,
	Console_MissingAuthAssociation           = 5,
	Console_DuplicateAuthAssociation         = 6,
	Console_AddedAuthAssociation             = 7,
	Console_AuthAssociationFailure           = 8,
	Console_NotEntitled                      = 9,
	Console_EntitlementCheckFailed           = 10,
	Console_PrivilegeCheck                   = 11,
	Console_PatchOrUpdateRequired            = 12,
	AuthFailed                               = 13,
	AuthFailed_RefreshInvalid                = 14,
	AuthFailed_InvalidMFA                    = 15,
	AuthFailed_RequiresMFA                   = 16,
	AuthFailed_AgeVerificationIncomplete     = 17,
	AuthFailed_LoginLockout                  = 18,
	AuthFailed_InvalidCredentials            = 19,
	AuthFailed_CorrectiveActionRequired      = 20,
	AuthParentalLock                         = 21,
	PlatformNotAllowed                       = 22,
	NotEntitled                              = 23,
	Banned                                   = 24,
	EULACheckFailed                          = 25,
	EULADeclined                             = 26,
	WaitingRoomFailed                        = 27,
	ServiceUnavailable                       = 28,
	GenericError                             = 29,
	RegisterSecondaryPlayerInPrimaryPartyFailed = 30,
	RejoinCheckFailure                       = 31,
	ConnectionFailed                         = 32,
	NetworkConnectionUnavailable             = 33,
	AlreadyLoggingIn                         = 34,
	ExternalAuth_AddedAuthAssociation        = 35,
	ExternalAuth_ConnectionTimeout           = 36,
	ExternalAuth_AuthFailure                 = 37,
	ExternalAuth_AssociationFailure          = 38,
	ExternalAuth_MissingAuthAssociation      = 39,
	ExternalAuth_Canceled                    = 40,
	FailedToCreateParty                      = 41,
	ProfileQueryFailed                       = 42,
	QueryKeychainFailed                      = 43,
	ClientSettingsDownloadFailed             = 44,
	SupervisedSettingsDownloadFailed         = 45,
	PinGrantFailure                          = 46,
	PinGrantTimeout                          = 47,
	PinGrantCanceled                         = 48,
	LoginStepTimeout                         = 49,
	Console_LoginCanceled                    = 50,
	ELoginResult_MAX                         = 51,
};

// Enum Account.ECreateAccountResult
// NumValues: 0x0008
enum class ECreateAccountResult : uint8
{
	NotStarted                               = 0,
	Pending                                  = 1,
	Success                                  = 2,
	Console_LoginFailed                      = 3,
	Console_DuplicateAuthAssociation         = 4,
	DuplicateAccount                         = 5,
	GenericError                             = 6,
	ECreateAccountResult_MAX                 = 7,
};

// ScriptStruct Account.WebEnvUrl
// 0x0030 (0x0030 - 0x0000)
struct FWebEnvUrl final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RedirectUrl;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Environment;                                       // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Account.ExternalAccountServiceConfig
// 0x0008 (0x0008 - 0x0000)
struct FExternalAccountServiceConfig final
{
public:
	EExternalAccountType                          Type;                                              // 0x0000(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ExternalServiceName;                               // 0x0004(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Account.ExchangeAccessParams
// 0x0040 (0x0040 - 0x0000)
struct FExchangeAccessParams final
{
public:
	class FString                                 EntitlementId;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReceiptId;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VendorReceipt;                                     // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AppStore;                                          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Account.GiftMessage
// 0x0030 (0x0030 - 0x0000)
struct FGiftMessage final
{
public:
	class FString                                 GiftCode;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SenderName;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Account.ServiceLoginMethodConfig
// 0x0005 (0x0005 - 0x0000)
struct FServiceLoginMethodConfig final
{
public:
	bool                                          bAutologinEnabled;                                 // 0x0000(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrimaryPlatformTokenEnabled;                      // 0x0001(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSecondaryPlatformTokenEnabled;                    // 0x0002(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAccountPortalEnabled;                             // 0x0003(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPersistentTokenEnabled;                           // 0x0004(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Account.OnlineAccountTexts_FailedLoginConsole
// 0x00F0 (0x00F0 - 0x0000)
struct FOnlineAccountTexts_FailedLoginConsole final
{
public:
	class FText                                   AgeRestriction;                                    // 0x0000(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   Generic;                                           // 0x0010(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   MissingAuthAssociation;                            // 0x0020(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   NeedPremiumAccount;                                // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   OnlinePlayRestriction;                             // 0x0040(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PatchAvailable;                                    // 0x0050(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PatchAvailableInstruction_Default;                 // 0x0060(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PatchAvailableInstruction_Xbox;                    // 0x0070(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PleaseSignIn;                                      // 0x0080(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   SystemUpdateAvailable;                             // 0x0090(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UI;                                                // 0x00A0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToComplete;                                  // 0x00B0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToSignIn;                                    // 0x00C0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToStartPrivCheck;                            // 0x00D0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnexpectedError;                                   // 0x00E0(0x0010)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct Account.OnlineAccountTexts
// 0x0660 (0x0660 - 0x0000)
struct FOnlineAccountTexts final
{
public:
	class FText                                   AllGiftCodesUsed;                                  // 0x0000(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   AssociateConsoleAuth;                              // 0x0010(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   AutoLoginFailed;                                   // 0x0020(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   AutoLoginFailedMobile;                             // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   BannedFromGame;                                    // 0x0040(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CheckEntitledToPlay;                               // 0x0050(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CheckingRejoin;                                    // 0x0060(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CheckServiceAvailability;                          // 0x0070(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ConsolePrivileges;                                 // 0x0080(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CreateAccountCompleted;                            // 0x0090(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CreateAccountFailure;                              // 0x00A0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CreateHeadless;                                    // 0x00B0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   DoQosPingTests;                                    // 0x00C0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   DowntimeMinutesWarningText;                        // 0x00D0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   DowntimeSecondsWarningText;                        // 0x00E0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   DuplicateAuthAssociaton;                           // 0x00F0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   EulaCheck;                                         // 0x0100(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExchangeConsoleGiftsForAccess;                     // 0x0110(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedAccountCreate;                               // 0x0120(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedEulaCheck_EulaAcceptanceFailed;              // 0x0130(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedEulaCheck_MustAcceptEula;                    // 0x0140(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginCredentialsMsg;                         // 0x0150(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginAgeVerificationIncomplete;              // 0x0160(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginParentalLock;                           // 0x0170(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginNoRealId;                               // 0x0180(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginLockoutMsg;                             // 0x0190(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginRequiresMFA;                            // 0x01A0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginRequiresAuthAppMFA;                     // 0x01B0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedInvalidMFA;                                  // 0x01C0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginRequiresCorrectiveAction;               // 0x01D0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginMsg;                                    // 0x01E0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginMsg_InvalidRefreshToken;                // 0x01F0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedStartLogin;                                  // 0x0200(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FounderChatExitedText;                             // 0x0210(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FounderChatJoinedText;                             // 0x0220(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   GameDisplayName;                                   // 0x0230(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   GeneralLoginFailure;                               // 0x0240(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   GlobalChatExitedText;                              // 0x0250(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   GlobalChatJoinedText;                              // 0x0260(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   HeadlessAccountFailed;                             // 0x0270(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   InMatchShutdownTimeWarningText;                    // 0x0280(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   InvalidUser;                                       // 0x0290(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggedOutofMCP;                                    // 0x02A0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   DisconnectedFromMCP;                               // 0x02B0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggedOutReturnedToTitle;                          // 0x02C0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggedOutSwitchedProfile;                          // 0x02D0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggingIn;                                         // 0x02E0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggingInConsoleAuth;                              // 0x02F0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggingOut;                                        // 0x0300(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoginConsole;                                      // 0x0310(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoginFailure;                                      // 0x0320(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   Logout_Unlink;                                     // 0x0330(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LogoutCompleted;                                   // 0x0340(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LostConnection;                                    // 0x0350(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoginStepTimeout;                                  // 0x0360(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   MCPTimeout;                                        // 0x0370(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LightswitchCheckNetworkFailureMsg;                 // 0x0380(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   NetworkConnectionUnavailable;                      // 0x0390(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   NoPlayEntitlement;                                 // 0x03A0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   NoServerAccess;                                    // 0x03B0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PlayAccessRevoked;                                 // 0x03C0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PremiumAccountName_Default;                        // 0x03D0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PremiumAccountName_Sony;                           // 0x03E0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PremiumAccountName_Switch;                         // 0x03F0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PremiumAccountName_XboxOne;                        // 0x0400(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   RedeemOfflinePurchases;                            // 0x0410(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ServiceDowntime;                                   // 0x0420(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   SignInCompleting;                                  // 0x0430(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   SignIntoConsoleServices;                           // 0x0440(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   TokenExpired;                                      // 0x0450(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToConnect;                                   // 0x0460(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToJoinWaitingRoomLoginQueue;                 // 0x0470(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnexpectedConsoleAuthFailure;                      // 0x0480(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnlinkConsoleFailed;                               // 0x0490(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UserLoginFailed;                                   // 0x04A0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   WaitingRoom;                                       // 0x04B0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   WaitingRoomError;                                  // 0x04C0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   WaitingRoomFailure;                                // 0x04D0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   WaitingRoomWaiting;                                // 0x04E0(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FOnlineAccountTexts_FailedLoginConsole FailedLoginConsole;                                // 0x04F0(0x00F0)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggingInExternalAuth;                             // 0x05E0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CreateDeviceAuth;                                  // 0x05F0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExtAuthCanceled;                                   // 0x0600(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExtAuthFailure;                                    // 0x0610(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExtAuthAssociationFailure;                         // 0x0620(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExtAuthTimeout;                                    // 0x0630(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExtAuthMissingAuthAssociation;                     // 0x0640(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToQueryReceipts;                             // 0x0650(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

}

