#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccoladesRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AccoladesRuntime.FortCheatManager_Accolades.TriggerAccolade
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_Accolades_TriggerAccolade final
{
public:
	class FString                                 AccoladeName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AccoladesRuntime.FortControllerComponent_AccoladeCollection.ClientNotifyRestored
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_AccoladeCollection_ClientNotifyRestored final
{
public:
	EPersistenceFrameworkResult                   Result;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AccoladesRuntime.FortControllerComponent_AccoladeCollection.HandlePinnedQuestChanged
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_AccoladeCollection_HandlePinnedQuestChanged final
{
public:
	struct FAthenaPinnedQuestData                 PinnedQuestData;                                   // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function AccoladesRuntime.FortControllerComponent_AccoladeCollection.OnEndMatchForPlayer
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_AccoladeCollection_OnEndMatchForPlayer final
{
public:
	class UFortControllerComponent_EndMatchPersistence* EndMatchPersistence;                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AccoladesRuntime.FortControllerComponent_AccoladeCollection.OnRep_PinnedAccoladeName
// 0x0004 (0x0004 - 0x0000)
struct FortControllerComponent_AccoladeCollection_OnRep_PinnedAccoladeName final
{
public:
	class FName                                   OldPinnedAccoladeName;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AccoladesRuntime.FortControllerComponent_AccoladeCollection.ServerMarkAccoladesAsSeen
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_AccoladeCollection_ServerMarkAccoladesAsSeen final
{
public:
	TArray<class FName>                           AccoladeNames;                                     // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AccoladesRuntime.FortControllerComponent_AccoladeCollection.ServerPinAccolade
// 0x0004 (0x0004 - 0x0000)
struct FortControllerComponent_AccoladeCollection_ServerPinAccolade final
{
public:
	class FName                                   AccoladeName;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

