#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorBridgeComponent

#include "Basic.hpp"

#include "ActorBridgeComponent_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function ActorBridgeComponent.ActorBridgeComponent_actor_bridge_component.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct ActorBridgeComponent_actor_bridge_component__InitCDO final
{
public:
	class URestricted_sticky_event*               _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class ULevelSaveRecord*, true>      _ExprResult_2;                                     // 0x0010(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_3 : 1;                                 // 0x001A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_4;                                // 0x001B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URestricted_sticky_event*               _ExprResult_5;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class ULevelSaveRecord*, true>      _ExprResult_7;                                     // 0x0030(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__3;                             // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_8 : 1;                                 // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_9;                                // 0x003B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ActorBridgeComponent.ActorBridgeComponent_actor_bridge_component._L_2fUnrealEngine_2ecom_2fEntityFramework_2fActorBridgeComponent_2factor__bridge__component_N_RRequestRootActorAsDeviceInternal_L_NType_20where_20Type_R
// 0x0010 (0x0010 - 0x0000)
struct ActorBridgeComponent_actor_bridge_component__L_2fUnrealEngine_2ecom_2fEntityFramework_2fActorBridgeComponent_2factor__bridge__component_N_RRequestRootActorAsDeviceInternal_L_NType_20where_20Type_R final
{
public:
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_creative_device_base*, true> RetVal;                                    // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function ActorBridgeComponent.ActorBridgeComponent_actor_bridge_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient
// 0x0002 (0x0002 - 0x0000)
struct ActorBridgeComponent_actor_bridge_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient final
{
public:
	struct ActorBridgeComponent::Ftuple_L_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function ActorBridgeComponent.ActorBridgeComponent_actor_bridge_component.RequestRootActorAsDevice_L_NType_20where_20Type_R
// 0x0028 (0x0028 - 0x0000)
struct ActorBridgeComponent_actor_bridge_component_RequestRootActorAsDevice_L_NType_20where_20Type_R final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function ActorBridgeComponent.task_ActorBridgeComponent_actor_bridge_component$RequestRootActorAsDevice_L_NType_20where_20Type_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_ActorBridgeComponent_actor_bridge_component_RequestRootActorAsDevice_L_NType_20where_20Type_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

