#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorBridgeComponent

#include "Basic.hpp"

#include "ActorBridgeComponent_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Entity_0_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseNative_0_classes.hpp"


namespace SDK
{

// VerseClass ActorBridgeComponent.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class ActorBridgeComponent::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass ActorBridgeComponent.$SolarisSignatureFunctionOuter", true>();
	}
	static class ActorBridgeComponent::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ActorBridgeComponent::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass ActorBridgeComponent.ActorBridgeComponent_actor_bridge_component
// 0x00A8 (0x0208 - 0x0160)
class UActorBridgeComponent_actor_bridge_component final : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x13390F6F_RequestRootActorAsDevice_L_NType_20where_20Type_R; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBC667065__L_2fUnrealEngine_2ecom_2fEntityFramework_2fActorBridgeComponent_2factor__bridge__component_N_RRequestRootActorAsDeviceInternal_L_NType_20where_20Type_R; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_180[0x20];                                     // 0x0180(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class URestricted_sticky_event*               __verse_0x52EA49BD_ActorSpawnFinishedEventInternal; // 0x01A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x10];                                     // 0x01A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class ULevelSaveRecord*, true>      __verse_0x3AB9B23E_SaveRecord;                     // 0x01B8(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_1C0[0x48];                                     // 0x01C0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UDevices_creative_device_base*, true> _L_2fUnrealEngine_2ecom_2fEntityFramework_2fActorBridgeComponent_2factor__bridge__component_N_RRequestRootActorAsDeviceInternal_L_NType_20where_20Type_R(class UClass* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct ActorBridgeComponent::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* RequestRootActorAsDevice_L_NType_20where_20Type_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UClass* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorBridgeComponent_actor_bridge_component">();
	}
	static class UActorBridgeComponent_actor_bridge_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorBridgeComponent_actor_bridge_component>();
	}
};

// VerseClass ActorBridgeComponent.task_ActorBridgeComponent_actor_bridge_component$RequestRootActorAsDevice_L_NType_20where_20Type_R
// 0x00C8 (0x0220 - 0x0158)
class Utask_ActorBridgeComponent_actor_bridge_component_RequestRootActorAsDevice_L_NType_20where_20Type_R final : public UConcurrency_task
{
public:
	class UActorBridgeComponent_actor_bridge_component* _Self;                                       // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_creative_device_base*, true> _RetVal;                                   // 0x0168(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class URestricted_sticky_event*               __verse_0x00000000__2;                             // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x0180(0x0010)(HasGetValueTypeHash)
	struct ActorBridgeComponent::Ftuple_L_R       _ExprResult_2;                                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_3;                                    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_creative_device_base*          __verse_0xC5A20583_Device_4;                       // 0x01A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_creative_device_base*, true> _ExprResultStack_4;                        // 0x01A8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_5;                                         // 0x01B0(0x0010)(HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__6;                             // 0x01C0(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_6 : 1;                                 // 0x01C2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_7;                                // 0x01C3(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URestricted_sticky_event*               __verse_0x00000000__9;                             // 0x01C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_8;                                      // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_9;                                 // 0x01D8(0x0010)(HasGetValueTypeHash)
	struct ActorBridgeComponent::Ftuple_L_R       _ExprResult_10;                                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_11;                                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDevices_creative_device_base*          __verse_0xC5A20583_Device_11;                      // 0x01F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_creative_device_base*, true> _ExprResultStack_12;                       // 0x0200(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x0208(0x0010)(HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__13;                            // 0x0218(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_14 : 1;                                // 0x021A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_15;                               // 0x021B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_ActorBridgeComponent_actor_bridge_component$RequestRootActorAsDevice_L_NType_20where_20Type_R">();
	}
	static class Utask_ActorBridgeComponent_actor_bridge_component_RequestRootActorAsDevice_L_NType_20where_20Type_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_ActorBridgeComponent_actor_bridge_component_RequestRootActorAsDevice_L_NType_20where_20Type_R>();
	}
};

}

