#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorEntity

#include "Basic.hpp"

#include "NetCore_structs.hpp"


namespace SDK
{

// Enum ActorEntity.EConsideredForActorEntityInterop
// NumValues: 0x0004
enum class EConsideredForActorEntityInterop : uint32
{
	No                                       = 0,
	Partial                                  = 1,
	Yes                                      = 2,
	EConsideredForActorEntityInterop_MAX     = 3,
};

// ScriptStruct ActorEntity.ActorEntityMappingArrayItem
// 0x0014 (0x0020 - 0x000C)
struct FActorEntityMappingArrayItem final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseEntity*                            Entity;                                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct ActorEntity.ActorEntityMappingArray
// 0x0028 (0x0130 - 0x0108)
struct FActorEntityMappingArray final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActorEntityMappingArrayItem>   Entities;                                          // 0x0120(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct ActorEntity.SubEntityInteropRules
// 0x0018 (0x0018 - 0x0000)
struct FSubEntityInteropRules final
{
public:
	class FName                                   ComponentName;                                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConsideredForActorEntityInterop              Considered;                                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           AllowedEntityComponents;                           // 0x0008(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct ActorEntity.ActorEntityInteropRules
// 0x0058 (0x0058 - 0x0000)
struct FActorEntityInteropRules final
{
public:
	TSoftClassPtr<class UClass>                   ActorClass;                                        // 0x0000(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConsideredForActorEntityInterop              ActorEntityConsidered;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftClassPtr<class UClass>>           AllowedEntityComponents;                           // 0x0028(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	EConsideredForActorEntityInterop              SubEntitiesConsidered;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSubEntityInteropRules>         SubEntityRules;                                    // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnableEntityReplication;                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

