#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimPresetsRuntime

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "AnimPresetsRuntime_structs.hpp"
#include "GameFeatures_classes.hpp"


namespace SDK
{

// Class AnimPresetsRuntime.AnimPreset
// 0x0000 (0x0028 - 0x0028)
class UAnimPreset : public UObject
{
public:
	TSoftClassPtr<class UClass> GetPresetClass() const;
	void HandleAnimInstance(class UAnimInstance* Instance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimPreset">();
	}
	static class UAnimPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimPreset>();
	}
};

// Class AnimPresetsRuntime.AnimPresetComponent
// 0x0020 (0x00C0 - 0x00A0)
class UAnimPresetComponent final : public UActorComponent
{
public:
	TSoftClassPtr<class UClass>                   AnimPreset;                                        // 0x00A0(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimPresetComponent">();
	}
	static class UAnimPresetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimPresetComponent>();
	}
};

// Class AnimPresetsRuntime.AnimPreset_BasicLocomotion
// 0x0050 (0x0078 - 0x0028)
class UAnimPreset_BasicLocomotion final : public UAnimPreset
{
public:
	struct FAnimPreset_SingleAnimationData        Idle;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimPreset_SingleAnimationData        MoveForward;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimPreset_SingleAnimationData        MoveBackward;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimPreset_SingleAnimationData        MoveLeft;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimPreset_SingleAnimationData        MoveRight;                                         // 0x0068(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimPreset_BasicLocomotion">();
	}
	static class UAnimPreset_BasicLocomotion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimPreset_BasicLocomotion>();
	}
};

// Class AnimPresetsRuntime.GameFeatureAction_AnimPreset
// 0x0060 (0x0088 - 0x0028)
class UGameFeatureAction_AnimPreset final : public UGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   AnimBP_Preset_BasicLocomotion;                     // 0x0028(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   AnimBP_CopyPoseFromMesh;                           // 0x0048(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   AnimBP_RetargetPoseFromMesh;                       // 0x0068(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AnimPreset">();
	}
	static class UGameFeatureAction_AnimPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AnimPreset>();
	}
};

}

