#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AssembledMeshSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CosmeticsFrameworkItems_structs.hpp"


namespace SDK
{

// ScriptStruct AssembledMeshSystem.AssembledComponentReferences
// 0x0018 (0x0018 - 0x0000)
struct FAssembledComponentReferences final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomizableObjectInstanceUsage*       CustomizableObjectInstanceUsage;                   // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           AssembledMeshSchemaTag;                            // 0x0010(0x0004)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct AssembledMeshSystem.CosmeticProperty_AssembledMeshSchema
// 0x0024 (0x0028 - 0x0004)
struct FCosmeticProperty_AssembledMeshSchema final : public FCosmeticPropertyBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAssembledMeshSchema>    AssembledMeshSchema;                               // 0x0008(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AssembledMeshSystem.AssembledMeshSchemaData
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FAssembledMeshSchemaData
{
};
#pragma pack(pop)

// ScriptStruct AssembledMeshSystem.AssembledMeshSchemaData_Icons
// 0x0080 (0x0080 - 0x0000)
struct FAssembledMeshSchemaData_Icons final : public FAssembledMeshSchemaData
{
public:
	TSoftObjectPtr<class UTexture2D>              WidePreviewImage;                                  // 0x0000(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              SmallPreviewImage;                                 // 0x0020(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              LargePreviewImage;                                 // 0x0040(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              FullScreenImage;                                   // 0x0060(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AssembledMeshSystem.AssembledMeshAttachmentRules
// 0x0050 (0x0050 - 0x0000)
struct FAssembledMeshAttachmentRules final
{
public:
	class FName                                   AttachSocketName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AttachOffset;                                      // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               AttachRotation;                                    // 0x0020(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                AttachScale;                                       // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AssembledMeshSystem.BaseParamData
// 0x0010 (0x0010 - 0x0000)
struct FBaseParamData
{
public:
	class FString                                 ParamName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct AssembledMeshSystem.IntParamData
// 0x0010 (0x0020 - 0x0010)
struct FIntParamData final : public FBaseParamData
{
public:
	TArray<class FString>                         ParamOptions;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct AssembledMeshSystem.FloatParamData
// 0x0010 (0x0020 - 0x0010)
struct FFloatParamData final : public FBaseParamData
{
public:
	float                                         FloatValue;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinFloatValue;                                     // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFloatValue;                                     // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

