#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AssembledMeshSystem

#include "Basic.hpp"


namespace SDK::Params
{

// Function AssembledMeshSystem.AssembledMeshUserComponent.CustomizationCompleted
// 0x0004 (0x0004 - 0x0000)
struct AssembledMeshUserComponent_CustomizationCompleted final
{
public:
	int32                                         PartIndex;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AssembledMeshSystem.AssembledMeshUserComponent.GetAttachToComponent
// 0x0008 (0x0008 - 0x0000)
struct AssembledMeshUserComponent_GetAttachToComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AssembledMeshSystem.AssembledMeshUserComponent.SetMeshPart
// 0x0008 (0x0008 - 0x0000)
struct AssembledMeshUserComponent_SetMeshPart final
{
public:
	class UAssembledMeshSchema*                   InMeshPart;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AssembledMeshSystem.AssembledMeshUserComponent.SetMeshParts
// 0x0010 (0x0010 - 0x0000)
struct AssembledMeshUserComponent_SetMeshParts final
{
public:
	TArray<class UAssembledMeshSchema*>           InMeshParts;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function AssembledMeshSystem.AssembledMeshUserComponent.GetMeshPart
// 0x0008 (0x0008 - 0x0000)
struct AssembledMeshUserComponent_GetMeshPart final
{
public:
	class UAssembledMeshSchema*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

