#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AtomRuntime_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class AtomRuntime.AtomAssetImportData
// 0x0000 (0x0028 - 0x0028)
class UAtomAssetImportData final : public UAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAssetImportData">();
	}
	static class UAtomAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAssetImportData>();
	}
};

// Class AtomRuntime.AtomModelMergedMeshImportData
// 0x0000 (0x0028 - 0x0028)
class UAtomModelMergedMeshImportData final : public UAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelMergedMeshImportData">();
	}
	static class UAtomModelMergedMeshImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelMergedMeshImportData>();
	}
};

// Class AtomRuntime.AtomModelGeometryCollectionImportData
// 0x0000 (0x0028 - 0x0028)
class UAtomModelGeometryCollectionImportData final : public UAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelGeometryCollectionImportData">();
	}
	static class UAtomModelGeometryCollectionImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelGeometryCollectionImportData>();
	}
};

// Class AtomRuntime.AtomColorLUTAtlas
// 0x0018 (0x0040 - 0x0028)
class UAtomColorLUTAtlas final : public UObject
{
public:
	class UTexture2D*                             AtlasTexture;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UTexture2D*>                     Textures;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	int32 FindOrAddLUTIndex(class UTexture2D* InTexture);

	int32 GetAtlasSize() const;
	int32 GetLUTIndex(class UTexture2D* InTexture) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomColorLUTAtlas">();
	}
	static class UAtomColorLUTAtlas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomColorLUTAtlas>();
	}
};

// Class AtomRuntime.AtomDatabaseSubsystemBase
// 0x0000 (0x0030 - 0x0030)
class UAtomDatabaseSubsystemBase final : public UEngineSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomDatabaseSubsystemBase">();
	}
	static class UAtomDatabaseSubsystemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDatabaseSubsystemBase>();
	}
};

// Class AtomRuntime.AtomModelActor
// 0x0018 (0x02A8 - 0x0290)
class AAtomModelActor final : public AActor
{
public:
	class UAtomModel*                             AtomModel;                                         // 0x0290(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PrimitiveStyleName;                                // 0x0298(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelActor">();
	}
	static class AAtomModelActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomModelActor>();
	}
};

// Class AtomRuntime.AtomModelAssetUserData
// 0x0030 (0x0058 - 0x0028)
class UAtomModelAssetUserData final : public UAssetUserData
{
public:
	struct FSerializedConnectivityObjects         AtomModelConnections;                              // 0x0028(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags;                                              // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelAssetUserData">();
	}
	static class UAtomModelAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelAssetUserData>();
	}
};

// Class AtomRuntime.AtomCommonPartModelAssetUserData
// 0x0010 (0x0038 - 0x0028)
class UAtomCommonPartModelAssetUserData final : public UAssetUserData
{
public:
	struct FAtomCommonPartAssetDescription        AssetDescription;                                  // 0x0028(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomCommonPartModelAssetUserData">();
	}
	static class UAtomCommonPartModelAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCommonPartModelAssetUserData>();
	}
};

// Class AtomRuntime.AtomPartsCollectionBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomPartsCollectionBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddPartInstance(struct FAtomModelPartsCollection* PartCollection, const struct FAtomModelPartInstanceInfo& PartInstance);
	static class FString Conv_ModelPartGuidToString(const struct FAtomModelPartGuid& InModelPartGuid);
	static struct FAtomModelPartGuid Conv_StringToModelPartGuid(const class FString& InString);
	static struct FAtomModelPartColorInfo CreateColorInfoFromColorId(int32 ColorId);
	static struct FAtomModelPartsCollection FilterGroup(class UAtomModel* Model, const struct FAtomModelPartsCollection& PartsCollectionToFilter, const class FString& GroupName, const class FString& NewPartsCollectionName);
	static struct FAtomModelPartsCollection FilterNonTransparent(const struct FAtomModelPartsCollection& PartsCollectionToFilter, const class FString& NewPartsCollectionName);
	static struct FAtomModelPartsCollection FilterSelectionSet(const struct FAtomModelPartsCollection& PartsCollectionToFilter, const class FString& SelectionSetName, const class FString& NewPartsCollectionName);
	static struct FAtomModelPartsCollection FilterTransparent(const struct FAtomModelPartsCollection& PartsCollectionToFilter, const class FString& NewPartsCollectionName);
	static int32 GetModelPartGuidHash(const struct FAtomModelPartGuid& InModelPartGuid);
	static class FString GetName(const struct FAtomModelPartsCollection& PartsCollection);
	static const TArray<struct FAtomModelPartInstanceInfo> GetParts(const struct FAtomModelPartsCollection& PartsCollection);
	static TArray<struct FAtomCommonPartAndTransform> GetPrimitiveCommonParts(class UAtomPrimitive* Primitive, double Scale);
	static struct FAtomModelPartsCollection InitializeCommonParts(struct FAtomModelPartsCollection& PartsCollection, const class UAtomModel* Model, float Scale, int32 CommonPartOptimizationFlags);
	static void RemovePartInstance(struct FAtomModelPartsCollection* PartCollection, const struct FAtomModelPartGuid& PartInstanceId);
	static void ReplacePartInstance(struct FAtomModelPartsCollection* PartCollection, const struct FAtomModelPartInstanceInfo& SourcePartInstance, const struct FAtomModelPartGuid& TargetPartInstanceId);
	static void SetName(struct FAtomModelPartsCollection* PartsCollection, const class FString& Name_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPartsCollectionBlueprintLibrary">();
	}
	static class UAtomPartsCollectionBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPartsCollectionBlueprintLibrary>();
	}
};

// Class AtomRuntime.AtomPrimitiveBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomPrimitiveBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float GetDefaultPrimitiveScale();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveBlueprintLibrary">();
	}
	static class UAtomPrimitiveBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveBlueprintLibrary>();
	}
};

// Class AtomRuntime.AtomPrimitiveGeometry
// 0x02C0 (0x02E8 - 0x0028)
class UAtomPrimitiveGeometry final : public UObject
{
public:
	uint8                                         Pad_28[0x2C0];                                     // 0x0028(0x02C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAtomPrimitiveGeometry* CreateAtomGeometryFromCommonPart(const class FString& ExportStyleName, EAtomCommonPartType CommonPartType, int32 LODIndex, const class FString& CommonPartsMeshPath);
	static class UAtomPrimitiveGeometry* CreateEmptyAtomGeometry();
	static int32 GetNumberOfCommonPartLODs(const class FString& ExportStyleName, EAtomCommonPartType CommonPartType, const class FString& CommonPartsMeshPath);

	class UAtomPrimitiveGeometry* Append(const class UAtomPrimitiveGeometry* GeometryToAppend, const struct FTransform3f& Transform);
	class UAtomPrimitiveGeometry* AppendAndWeld(const class UAtomPrimitiveGeometry* GeometryToAppend, const struct FTransform3f& Transform);
	void AttachVerticesToBoneIndex(int32 BoneIndex);
	void AttachVerticesToNamedBone(const class FString& BoneName);
	class UAtomPrimitiveGeometry* BakeScale(float Scale);
	class UAtomPrimitiveGeometry* BakeTransform(const struct FTransform3f& Transform);
	class UAtomPrimitiveGeometry* BakeTransforms(const TArray<struct FTransform3f>& Transforms);
	class UAtomPrimitiveGeometry* CopyNormalMapsToUV0();
	class UAtomPrimitiveGeometry* SetMaterialName(const class FString& Name_0, int32 PolygonGroupIndex);
	class UAtomPrimitiveGeometry* SetTiledUVs(float TileSize);
	class UAtomPrimitiveGeometry* SetVertexColor(const struct FColor& Color);

	class UAtomPrimitiveGeometry* DuplicateGeometry() const;
	int32 GetBoneIndexForName(const class FString& BoneName) const;
	TArray<class FString> GetMaterialNames() const;
	TArray<class UAtomPrimitiveGeometry*> SplitByPolygonGroup() const;
	class UStaticMesh* ToSimplifiedStaticMesh(float Scale, class UObject* Outer_0, const class FString& Name_0, bool bFastBuild) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveGeometry">();
	}
	static class UAtomPrimitiveGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveGeometry>();
	}
};

// Class AtomRuntime.AtomPrimitiveGeometryContainer
// 0x00F8 (0x0120 - 0x0028)
class UAtomPrimitiveGeometryContainer final : public UObject
{
public:
	TSoftObjectPtr<class UStaticMesh>             SourceMesh;                                        // 0x0028(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExportStyleName;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         LOD;                                               // 0x0058(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, int32>                    GeometryCount;                                     // 0x0060(0x0050)(Edit, Transient, EditConst, NativeAccessSpecifierPrivate)
	class FString                                 AlphaMaskTextureName;                              // 0x00B0(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 NormalMapTextureName;                              // 0x00C0(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x50];                                      // 0x00D0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetCapsGeometry();
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetCollisionGeometry();
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetDetailsGeometry();
	class UAtomPrimitiveGeometry* GetGeometry(EPrimitiveGeometryComplexity PrimitiveGeometryComplexity);
	class UAtomPrimitiveGeometry* GetGeometrySection(int32 PrimitiveGeometrySectionFlag);
	class UAtomPrimitiveGeometry* GetGeometrySectionWithMaterialNames(int32 PrimitiveGeometrySectionFlags, const class FString& ShellMaterial, const class FString& UndersideMaterial);
	class UAtomPrimitiveGeometry* GetGeometryWithMaterialNames(EPrimitiveGeometryComplexity PrimitiveGeometryComplexity, const class FString& ShellMaterial, const class FString& UndersideMaterial);
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetOtherCapsGeometry();
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetPartsGeometry();
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetScaledCapsGeometry(float Scale);
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetScaledCollisionGeometry(float Scale);
	TArray<struct FAtomPrimitiveGeometryAndTransform> GetScaledDetailsGeometry(float Scale);
	class UAtomPrimitiveGeometry* GetScaledGeometry(EPrimitiveGeometryComplexity PrimitiveGeometryComplexity, float Scale);
	struct FAtomPrimitiveGeometryAndTransform GetScaledShellGeometry(float Scale);
	struct FAtomPrimitiveGeometryAndTransform GetShellGeometry();
	struct FAtomPrimitiveCollisionGeometry MakePrimitiveCollisionGeometry(float Scale);

	TArray<struct FTransform> GetDefaultBoneTransforms(float Scale) const;
	class FString GetExportStyleName() const;
	int32 GetLOD() const;
	bool HasCollisionGeometry() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveGeometryContainer">();
	}
	static class UAtomPrimitiveGeometryContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveGeometryContainer>();
	}
};

// Class AtomRuntime.AtomRuntimeBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomRuntimeBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TMap<int32, struct FAtomColorInfo> GetAllColorInfo();
	static int32 GetBitPackForColor(const struct FColor& Color);
	static int32 GetBitPackForColorId(int32 AtomColorId);
	static void GetCommonPartAssetDescriptionFromStaticMesh(class UStaticMesh* StaticMesh, struct FAtomCommonPartAssetDescription* OutDescription, EGetCommonPartDescriptionResult* OutIsValid);
	static EAtomCommonPartCategory GetCommonPartCategoryFromType(EAtomCommonPartType CommonPartType);
	static void GetCommonPartDescriptionFromType(EAtomCommonPartType CommonPartType, struct FAtomCommonPartDescription* OutDescription);
	static struct FAtomColorInfo GetInfoForColorId(int32 ColorId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomRuntimeBlueprintLibrary">();
	}
	static class UAtomRuntimeBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomRuntimeBlueprintLibrary>();
	}
};

// Class AtomRuntime.AtomRuntimeSettings
// 0x0030 (0x0060 - 0x0030)
class UAtomRuntimeSettings final : public UDeveloperSettings
{
public:
	float                                         PrimitiveGlobalScale;                              // 0x0030(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDataTable>              ColorDataTableOverride;                            // 0x0038(0x0020)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWorldConnectivity;                          // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookContent;                                      // 0x0059(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const class UDataTable* GetColorDataTable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomRuntimeSettings">();
	}
	static class UAtomRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomRuntimeSettings>();
	}
};

// Class AtomRuntime.WorldConnectivitySubsystem
// 0x0150 (0x0180 - 0x0030)
class UWorldConnectivitySubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x150];                                     // 0x0030(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisconnectAllObjectConnections(const struct FWorldConnectivityHandle& Object);
	void DisconnectObjects(const struct FWorldConnectivityHandle& ObjectA, const struct FWorldConnectivityHandle& ObjectB);
	struct FPlanarFieldInfo GetClosestFieldToPoint(const struct FWorldConnectivityHandle& Handle, const struct FVector& WorldLocation, EConnectionFieldGender Type, bool* bSuccess);
	TArray<struct FWorldConnectivityHandle> GetConnectedObjects(const struct FWorldConnectivityHandle& Object);
	TArray<struct FWorldConnectivityHandle> GetConnectedObjectsRecursively(const struct FWorldConnectivityHandle& Object);
	struct FVector GetOverlapPenetrationDepth(class AStaticMeshActor* Actor1, class AStaticMeshActor* Actor2, const struct FVector& Offset);
	struct FVector GetPlanarFieldCenter(const struct FPlanarFieldInfo& Field);
	TArray<struct FPlanarFieldInfo> GetPlanarFields(const struct FWorldConnectivityHandle& Handle, EConnectionFieldGender Type);
	bool RegisterAtomActor(const class AActor* Actor);
	bool RegisterConnectivityActor(const class AActor* Actor, const class UAtomModel* Model);
	void RegisterCustomConnectivityActor(const class AActor* Actor, const struct FSerializedConnectivityObjects& ConnectivityObject);
	void RegisterModelActor(const class AActor* Actor, const struct FSerializedConnectivityObjects& Connections);
	TArray<struct FConnectivityQueryResult> RunPlanarConnectivityQuery(const class AActor* AtomActorToPlace, const class AActor* AtomActorToConnect, const struct FVector& QueryStartLocation, const struct FVector& QueryEndLocation, ECollisionChannel QueryCollisionChannel, int32 QueryRadius, bool bSaveConnectionOnSuccess);
	bool TryConnectObjectAtLocation(const struct FWorldConnectivityHandle& ObjectToConnect, const struct FTransform& DesiredObjectTransform, const TArray<struct FWorldConnectivityHandle>& ConnectionCandidates, bool PerformConnection);
	void UnregisterConnectivityActor(const class AActor* Actor);

	class AActor* GetActor(const struct FWorldConnectivityHandle& Handle) const;
	const class UAtomModel* GetAtomModel(const class AActor* Actor) const;
	class UAtomModelAssetUserData* GetAtomModelAssetUserData(const class UObject* Object) const;
	struct FWorldConnectivityHandle GetConnectivityHandle(const class AActor* Actor) const;
	TArray<struct FWorldConnectivityHandle> GetConnectivityHandles(const class AActor* Actor) const;
	const struct FTransform GetTransform(const struct FWorldConnectivityHandle& Handle) const;
	double PlanarGridStepSize() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldConnectivitySubsystem">();
	}
	static class UWorldConnectivitySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldConnectivitySubsystem>();
	}
};

// Class AtomRuntime.WorldConnectivityBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UWorldConnectivityBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class AActor* GetActor(class UObject* WorldContext, const struct FWorldConnectivityHandle& Handle);
	static struct FVector GetFieldCenter(class UObject* WorldContext, const struct FPlanarFieldInfo& Field);
	static struct FTransform GetTransform(class UObject* WorldContext, const struct FWorldConnectivityHandle& Handle);
	static bool IsValid(const struct FWorldConnectivityHandle& Handle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldConnectivityBlueprintLibrary">();
	}
	static class UWorldConnectivityBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldConnectivityBlueprintLibrary>();
	}
};

// Class AtomRuntime.AtomColorComponent
// 0x0010 (0x00B0 - 0x00A0)
class UAtomColorComponent final : public UActorComponent
{
public:
	class UAtomColorLUTAtlas*                     ColorLUTAtlas;                                     // 0x00A0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             ColorLUTTexture;                                   // 0x00A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	int32 GetColorLUTIndex() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomColorComponent">();
	}
	static class UAtomColorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomColorComponent>();
	}
};

// Class AtomRuntime.AtomISMPoolRenderer
// 0x00D8 (0x0100 - 0x0028)
class alignas(0x10) UAtomISMPoolRenderer final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryCollectionISMPoolComponent*    CachedISMPoolComponent;                            // 0x0038(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGeometryCollectionISMPoolComponent*    LocalISMPoolComponent;                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0xB8];                                      // 0x0048(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomISMPoolRenderer">();
	}
	static class UAtomISMPoolRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomISMPoolRenderer>();
	}
};

// Class AtomRuntime.AtomModel
// 0x0220 (0x0248 - 0x0028)
class UAtomModel final : public UObject
{
public:
	struct FAtomModelAssetSettings                Settings;                                          // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelPrimitive>            Primitives;                                        // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomHingedElement>             Elements;                                          // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelSelectionSet>         SelectionSets;                                     // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomModelConfigurationGroup>   Groups;                                            // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<EAtomCommonPartType, TSoftObjectPtr<class UStaticMesh>> CommonPartOverrides;                // 0x0090(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         CommonPartOptimization;                            // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSerializedConnectivityObjects         SerializedConnectivityObjects;                     // 0x00E8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, NativeAccessSpecifierPublic)
	TMap<class FString, TSoftObjectPtr<class UTexture>> TextureNameToAsset;                          // 0x0108(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x50];                                     // 0x0158(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAtomSourceModel                       SourceModel;                                       // 0x01A8(0x00A0)(NativeAccessSpecifierPrivate)

public:
	class FString GetChildIdentifier(int32 InChildIdx);
	void GetPrimitivesForChildArray(int32 InChildIdx, TArray<struct FAtomModelPrimitiveInstance>* OutPrimitives);

	TArray<TSoftObjectPtr<class UStaticMesh>> GetGeneratedMergedMeshes() const;
	class FString GetModelName() const;
	class FString GetModelPath() const;
	struct FAtomModelPartsCollection GetPartsCollection() const;
	class UTexture* GetTextureForDecorationTextureName(const class FString& TextureName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModel">();
	}
	static class UAtomModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModel>();
	}
};

// Class AtomRuntime.AtomModelComponent
// 0x00A0 (0x02C0 - 0x0220)
class UAtomModelComponent final : public USceneComponent
{
public:
	class UAtomModel*                             AtomModel;                                         // 0x0220(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomModelInstanceType                        InstanceType;                                      // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RenderStyle;                                       // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FallbackRenderStyle;                               // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRenderStyle;                                   // 0x0250(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFallbackRenderStyle;                           // 0x0251(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCombinedMeshes;                                // 0x0252(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseColorPayload;                                  // 0x0253(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateRigidElements;                              // 0x0254(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableConnectivity;                               // 0x0255(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAtomDefaultMaterials;                          // 0x0256(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_257[0x1];                                      // 0x0257(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SelectionSetFilter;                                // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CommonPartOptimization;                            // 0x025C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                RigidElementComponents;                            // 0x0260(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, struct FModelPrimitiveEntry> ComponentToPrimitive;                             // 0x0270(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelComponent">();
	}
	static class UAtomModelComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelComponent>();
	}
};

// Class AtomRuntime.AtomPrimitiveComponent
// 0x0030 (0x0600 - 0x05D0)
class UAtomPrimitiveComponent final : public UStaticMeshComponent
{
public:
	class UAtomPrimitive*                         AtomPrimitive;                                     // 0x05D0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RenderStyle;                                       // 0x05D8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FallbackRenderStyle;                               // 0x05E8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCombinedMeshes;                                // 0x05F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRenderStyle;                                   // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFallbackRenderStyle;                           // 0x05FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5FB[0x5];                                      // 0x05FB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitiveComponent">();
	}
	static class UAtomPrimitiveComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitiveComponent>();
	}
};

// Class AtomRuntime.AtomModelProcessor
// 0x0030 (0x0058 - 0x0028)
class UAtomModelProcessor final : public UObject
{
public:
	bool                                          bEnableRebuildProgress;                            // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DialogDelay;                                       // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumProgressSteps;                                  // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProgressMessage;                                   // 0x0038(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void IncrementProgress(int32 NumSteps, const class FString& Message);
	class FString OnGetProcessModelTargetAssetPath(class UAtomModel* Model, const struct FAtomModelPartsCollection& AtomModelPartsCollection);
	class FString OnGetProcessPrimitiveTargetAssetPath(class UAtomModel* Model, class UAtomPrimitive* Primitive, const struct FAtomModelPartsCollection& AtomModelPartsCollection, const struct FAtomOnProcessPrimitiveSettings& Settings);
	class FString OnGetTargetAssetPath(class UAtomModel* Model, class UAtomPrimitive* Primitive, const struct FAtomModelPartsCollection& AtomModelPartsCollection);
	struct FAtomProcessorResult OnProcessModel(class UAtomModel* Model, const struct FAtomModelPartsCollection& AtomModelPartsCollection, const TArray<TSoftObjectPtr<class UObject>>& ExistingObjects);
	struct FAtomProcessorResult OnProcessPrimitive(class UAtomModel* DummyModel, class UAtomPrimitive* Primitive, const struct FAtomModelPartsCollection& AtomModelPartsCollection, const struct FAtomOnProcessPrimitiveSettings& Settings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModelProcessor">();
	}
	static class UAtomModelProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModelProcessor>();
	}
};

// Class AtomRuntime.AtomProcessorBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomProcessorBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FAtomProcessorResult AppendAtomProcessorResult(const struct FAtomProcessorResult& Result, const struct FAtomProcessorResult& ResultToAppend);
	static const class UAtomModelProcessor* GetModelProcessor(const struct FAtomModelProcessorInstance& ProcessorInstance);
	static const class UClass* GetProcessorClass(const struct FAtomModelProcessorInstance& ProcessorInstance);
	static bool IsValid(const struct FAtomModelProcessorInstance& ProcessorInstance);
	static void SetModelProcessor(struct FAtomModelProcessorInstance& ProcessorInstance, class UAtomModelProcessor* ModelProcessor, bool bUseCustomSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomProcessorBlueprintLibrary">();
	}
	static class UAtomProcessorBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomProcessorBlueprintLibrary>();
	}
};

// Class AtomRuntime.AtomPrimitive
// 0x01D8 (0x0200 - 0x0028)
class UAtomPrimitive final : public UObject
{
public:
	int32                                         PartId;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PartRevision;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DesignName;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFlex;                                           // 0x0044(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVariant;                                        // 0x0045(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DecorationSurfaceNames;                            // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         NumberOfColorSurfaces;                             // 0x0058(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomPlatform                                 AtomPlatform;                                      // 0x005C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AtomMainGroupId;                                   // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AtomSubMainGroupId;                                // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EAtomCommonPartType, struct FAtomPrimitiveCommonPart> PrimitiveCommonParts;                 // 0x0068(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAtomPrimitiveCommonPart> CommonParts;                                  // 0x00B8(0x0050)(NativeAccessSpecifierPublic)
	bool                                          bOverrideConnectionFields;                         // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoxSphereBounds                       Bounds;                                            // 0x0110(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       UnscaledBounds;                                    // 0x0148(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UAtomPrimitiveGeometryContainer*> GeometryContainers;                               // 0x0180(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FAtomPrimitiveDetailTextureData> DetailTextures;                                   // 0x0190(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FConnectionFieldContainer              ConnectionFields;                                  // 0x01A0(0x0030)(Edit, EditConst, NativeAccessSpecifierPrivate)
	struct FConnectionFieldContainer              ConnectionFieldsOverride;                          // 0x01D0(0x0030)(Edit, NativeAccessSpecifierPrivate)

public:
	static class FName GetMainGroupName(int32 MainGroupId);
	static class FName GetSubMainGroupName(int32 SubMainGroupId);

	struct FBoxSphereBounds GetBounds(float Scale) const;
	class UAtomPrimitiveGeometryContainer* GetGeometryContainerForBestExportStyle(const TArray<class FString>& GeometryStylePriorityList, int32 LODIndex) const;
	class UAtomPrimitiveGeometryContainer* GetGeometryContainerForExportStyle(const class FString& ExportStyleName, const class FString& FallbackExportStyleName, int32 LODIndex) const;
	bool IsFlexElement() const;
	class UTexture* LoadDetailTextureForExportStyle(const class FString& ExportStyle, EAtomPrimitiveDetailTextureType TextureType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPrimitive">();
	}
	static class UAtomPrimitive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomPrimitive>();
	}
};

}

