#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioWorldization

#include "Basic.hpp"

#include "AudioWorldization_structs.hpp"


namespace SDK::Params
{

// Function AudioWorldization.AudioWorldizationSubsystem.OverrideEffectSends
// 0x0018 (0x0018 - 0x0000)
struct AudioWorldizationSubsystem_OverrideEffectSends final
{
public:
	class FName                                   InIdentifier;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAudioWorldizationSend>         InSends;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AudioWorldization.AudioWorldizationSubsystem.RemoveEffectSendOverride
// 0x0004 (0x0004 - 0x0000)
struct AudioWorldizationSubsystem_RemoveEffectSendOverride final
{
public:
	class FName                                   InIdentifier;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AudioWorldization.AudioWorldizationSubsystem.RemoveWorldizationSettings
// 0x0004 (0x0004 - 0x0000)
struct AudioWorldizationSubsystem_RemoveWorldizationSettings final
{
public:
	class FName                                   InIdentifier;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AudioWorldization.AudioWorldizationSubsystem.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct AudioWorldizationSubsystem_SetEnabled final
{
public:
	bool                                          bNewEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AudioWorldization.AudioWorldizationSubsystem.SetWorldizationSettings
// 0x0078 (0x0078 - 0x0000)
struct AudioWorldizationSubsystem_SetWorldizationSettings final
{
public:
	struct FAudioWorldizationSettings             InSettings;                                        // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function AudioWorldization.AudioWorldizationSubsystem.GetEnclosureFactor
// 0x0004 (0x0004 - 0x0000)
struct AudioWorldizationSubsystem_GetEnclosureFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function AudioWorldization.AudioWorldizationSubsystem.GetWallDistanceRatio
// 0x0004 (0x0004 - 0x0000)
struct AudioWorldizationSubsystem_GetWallDistanceRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

