#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BallisticShieldGameplayRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "TacticalSprintRuntime_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "BallisticShieldGameplayRuntime_structs.hpp"
#include "TargetingSystem_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class BallisticShieldGameplayRuntime.BallisticShieldItemLayerAnimInstance
// 0x00E0 (0x07D0 - 0x06F0)
class UBallisticShieldItemLayerAnimInstance final : public UFortItemLayerAnimInstance
{
public:
	bool                                          bIsRush;                                           // 0x06F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEquipping;                                      // 0x06F1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReloading;                                      // 0x06F2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnterLanding;                                     // 0x06F3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExitLanding;                                      // 0x06F4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsShieldBlocking;                                 // 0x06F5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStaggerBuildup;                                 // 0x06F6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F7[0x1];                                      // 0x06F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Yaw;                                               // 0x06F8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChargeAOAlpha;                                     // 0x06FC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GenderAndSize;                                     // 0x0700(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReloadUBAlpha;                                     // 0x0704(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaskLeftArmAlpha;                                  // 0x0708(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaggerAmount;                                     // 0x070C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_710[0xC0];                                     // 0x0710(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BallisticShieldItemLayerAnimInstance">();
	}
	static class UBallisticShieldItemLayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBallisticShieldItemLayerAnimInstance>();
	}
};

// Class BallisticShieldGameplayRuntime.BallisticShieldWeaponInterface
// 0x0000 (0x0000 - 0x0000)
class IBallisticShieldWeaponInterface final
{
public:
	void GetBallisticShieldData(EBallisticShieldPlayerActionState* BallisticShieldPlayerState, float* StaggerBuildupPercent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BallisticShieldWeaponInterface">();
	}
	static class IBallisticShieldWeaponInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBallisticShieldWeaponInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class BallisticShieldGameplayRuntime.FortMovementMode_ELBShieldSprint
// 0x0038 (0x0418 - 0x03E0)
class UFortMovementMode_ELBShieldSprint final : public UFortMovementMode_ELTacSprint
{
public:
	struct FScalableFloat                         ChargeRotationRate;                                // 0x03E0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayAbility>           GrantedAbility;                                    // 0x0408(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_410[0x8];                                      // 0x0410(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ELBShieldSprint">();
	}
	static class UFortMovementMode_ELBShieldSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ELBShieldSprint>();
	}
};

// Class BallisticShieldGameplayRuntime.TargetingFilterTask_BShieldCharge
// 0x0088 (0x00B0 - 0x0028)
class UTargetingFilterTask_BShieldCharge final : public UTargetingFilterTask_BasicFilterTemplate
{
public:
	TArray<TSubclassOf<class UObject>>            WalkableActorClasses;                              // 0x0028(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FScalableFloat                         BashableActorAngle;                                // 0x0038(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MainTraceDistance;                                 // 0x0060(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         FloorHitZTolerance;                                // 0x0088(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingFilterTask_BShieldCharge">();
	}
	static class UTargetingFilterTask_BShieldCharge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingFilterTask_BShieldCharge>();
	}
};

}

