#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BeatSyncedAnimRuntime

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// Enum BeatSyncedAnimRuntime.ESyncAnimBeatTo
// NumValues: 0x0005
enum class ESyncAnimBeatTo : uint8
{
	None                                     = 0,
	Now                                      = 1,
	PrevBeat                                 = 2,
	Num                                      = 3,
	ESyncAnimBeatTo_MAX                      = 4,
};

// Enum BeatSyncedAnimRuntime.EBeatSyncAnimNodeLogging
// NumValues: 0x0004
enum class EBeatSyncAnimNodeLogging : uint8
{
	Enabled                                  = 0,
	Disabled                                 = 1,
	Default                                  = 2,
	EBeatSyncAnimNodeLogging_MAX             = 3,
};

// Enum BeatSyncedAnimRuntime.EGotBeatAndTimeFrom
// NumValues: 0x0005
enum class EGotBeatAndTimeFrom : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	PreviewBPM                               = 2,
	MusicClock                               = 3,
	EGotBeatAndTimeFrom_MAX                  = 4,
};

// ScriptStruct BeatSyncedAnimRuntime.BeatAndTime
// 0x000C (0x000C - 0x0000)
struct FBeatAndTime final
{
public:
	EGotBeatAndTimeFrom                           GotBeatTimeFrom;                                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Beat;                                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BeatSyncedAnimRuntime.AnimNode_PlayBeatSyncedAnim
// 0x0068 (0x00A8 - 0x0040)
struct FAnimNode_PlayBeatSyncedAnim final : public FAnimNode_SequenceEvaluator
{
public:
	class UAnimSequenceBase*                      InSequence;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMusicClockComponent*                   MusicClock;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBeatAndTime                           BeatAndTime;                                       // 0x0050(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PreviewBPM;                                        // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysAllowPreviewBPM;                            // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESyncAnimBeatTo                               SyncAnimBeatTo;                                    // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBeatSyncAnimNodeLogging                      Logging;                                           // 0x0062(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSideloadedLipSync;                                // 0x0063(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x44];                                      // 0x0064(0x0044)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BeatSyncedAnimRuntime.FMontageBeatSyncInfo
// 0x0008 (0x0008 - 0x0000)
struct FFMontageBeatSyncInfo final
{
public:
	float                                         PlayRate;                                          // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Offset;                                            // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

