#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BotController_NPC_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_PhoebeController_NonParticipant_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BotController_NPC_Base.BP_BotController_NPC_Base_C
// 0x0050 (0x1770 - 0x1720)
class ABP_BotController_NPC_Base_C final : public ABP_PhoebeController_NonParticipant_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortAthenaNpcPatrollingComponent*      FortAthenaNpcPatrolling;                           // 0x1728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Patrolling;                                     // 0x1730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_PatrollingSpeedHandle;                          // 0x1738(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SavedRotationRate;                                 // 0x1740(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               PatrollingRotationRate;                            // 0x1758(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AddPatrollingGE();
	void BndEvt__FortAthenaNpcPatrolling_K2Node_ComponentBoundEvent_0_PatrollingComponentOnStartPatrolling__DelegateSignature();
	void BndEvt__FortAthenaNpcPatrolling_K2Node_ComponentBoundEvent_1_PatrollingComponentOnStopPatrolling__DelegateSignature();
	void ExecuteUbergraph_BP_BotController_NPC_Base(int32 EntryPoint);
	void RemovePatrollingGE();
	void StartPatrolling();
	void StopPatrolling();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BotController_NPC_Base_C">();
	}
	static class ABP_BotController_NPC_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BotController_NPC_Base_C>();
	}
};

}

