#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerPawn_Athena_Phoebe

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PlayerPawn_Athena_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerPawn_Athena_Phoebe.BP_PlayerPawn_Athena_Phoebe_C
// 0x0020 (0x6A10 - 0x69F0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_PlayerPawn_Athena_Phoebe_C : public APlayerPawn_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PlayerPawn_Athena_Phoebe_C;      // 0x69F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   AIEvaluator_CharacterLaunchedKeyName;              // 0x69F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCosmeticVariants;                              // 0x69FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69FD[0x3];                                     // 0x69FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CosmeticVariantID;                                 // 0x6A00(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AssignCosmeticVariant();
	void ComputeCosmeticVariantID();
	void ExecuteUbergraph_BP_PlayerPawn_Athena_Phoebe(int32 EntryPoint);
	void OnCharacterCustomizationCompleted(class AFortPlayerPawn* Pawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerPawn_Athena_Phoebe_C">();
	}
	static class ABP_PlayerPawn_Athena_Phoebe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerPawn_Athena_Phoebe_C>();
	}
};
#pragma pack(pop)

}

