#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterDynamicsControlRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CharacterDynamicsControlRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "PhysicsControl_structs.hpp"


namespace SDK
{

// Class CharacterDynamicsControlRuntime.CharacterDynamicsControlBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UCharacterDynamicsControlBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddCharacterDynamicsControlLogicLayer(const class UFortAnimInstance* InAnimInstance, const class FName LayerName, const class UFortCharacterDynamicsStateLogic* LayerStateLogic);
	static class FName GetCharacterState(const class UFortAnimInstance* InAnimInstance);
	static class FName GetCharacterStateForLayer(const class UFortAnimInstance* InAnimInstance, const class FName StateLogicLayerName);
	static bool GetProperty(const class UFortAnimInstance* InAnimInstance, const class FName InPropertyName);
	static bool GetPropertyForLayer(const class UFortAnimInstance* InAnimInstance, const class FName InStateLogicLayerName, const class FName InPropertyName);
	static bool HasCharacterDynamicsControlLogicLayer(const class UFortAnimInstance* InAnimInstance, const class FName LayerName);
	static void RemoveCharacterDynamicsControlLogicLayer(const class UFortAnimInstance* InAnimInstance, const class FName LayerName);
	static void RequestFullBodyPBALayer(const class UFortAnimInstance* InAnimInstance, const class FName ReasonForRequest);
	static void SetProperty(const class UFortAnimInstance* InAnimInstance, const class FName InPropertyName, bool InValue);
	static struct FRigidBodyWithControlReference UpdateRigidBodyWithControlNodeParameters(const struct FAnimUpdateContext& UpdateContext, const struct FRigidBodyWithControlReference& RigidBodyWithControl);
	static struct FRigidBodyWithControlReference UpdateRigidBodyWithControlNodeParametersForLayer(const struct FAnimUpdateContext& UpdateContext, const struct FRigidBodyWithControlReference& RigidBodyWithControl, const class FName StateLogicLayerName, const class UFortCharacterDynamicsParameters* Parameters);

	struct FRigidBodyWithControlReference UpdateRigidBodyWithControlNodeParametersFromAsset(const struct FAnimUpdateContext& UpdateContext, const struct FRigidBodyWithControlReference& RigidBodyWithControl, const class UFortCharacterDynamicsParameters* Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterDynamicsControlBPLibrary">();
	}
	static class UCharacterDynamicsControlBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterDynamicsControlBPLibrary>();
	}
};

// Class CharacterDynamicsControlRuntime.CharacterDynamicsControlGameFeatureData
// 0x0010 (0x0550 - 0x0540)
class UCharacterDynamicsControlGameFeatureData final : public UFortGameFeatureData
{
public:
	class UFortCharacterDynamicsStateLogic*       DefaultStateLogic;                                 // 0x0540(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortCharacterDynamicsParameters*       DefaultParameters;                                 // 0x0548(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterDynamicsControlGameFeatureData">();
	}
	static class UCharacterDynamicsControlGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterDynamicsControlGameFeatureData>();
	}
};

// Class CharacterDynamicsControlRuntime.FortCharacterDynamicsParameters
// 0x0070 (0x00A0 - 0x0030)
class UFortCharacterDynamicsParameters final : public UPrimaryDataAsset
{
public:
	TArray<class FName>                           StateNames;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FClothParameters>               ClothParameters;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWindGustParameters>            WindGustParameters;                                // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlControlAndModifierParameters> RBWCControlAndModifierParameters;     // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFortRigidBodyWithControlStateTransitionParameters> RBWCTransitionParameters;      // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFortGravityOverrideParameters> GravityOverrideParameters;                         // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFortRigidBodyAnimNodeParameters> RigidBodyAnimNodeParameters;                     // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCharacterDynamicsParameters">();
	}
	static class UFortCharacterDynamicsParameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCharacterDynamicsParameters>();
	}
};

// Class CharacterDynamicsControlRuntime.FortCharacterDynamicsStateLogic
// 0x0048 (0x0078 - 0x0030)
class UFortCharacterDynamicsStateLogic final : public UPrimaryDataAsset
{
public:
	TArray<class FName>                           BlueprintCharacterPropertyNames;                   // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ActivityStateNames;                                // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBinaryDecisionTree                    ActivityStateBinaryDecisionTree;                   // 0x0050(0x0010)(Edit, NativeAccessSpecifierPublic)
	float                                         MinMovementSpeed;                                  // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinRidingMovementSpeed;                            // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinUpwardVelocityThreshold;                        // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFallingThreshold;                               // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HighRevolutionsPerSecondThreshold;                 // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCharacterDynamicsStateLogic">();
	}
	static class UFortCharacterDynamicsStateLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCharacterDynamicsStateLogic>();
	}
};

// Class CharacterDynamicsControlRuntime.FortCharacterDynamicsComponent
// 0x00B0 (0x0150 - 0x00A0)
class UFortCharacterDynamicsComponent final : public UActorComponent
{
public:
	class UFortCharacterDynamicsStateLogic*       DefaultStateLogic;                                 // 0x00A0(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortCharacterDynamicsParameters*       DefaultParameters;                                 // 0x00A8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0xA0];                                      // 0x00B0(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddLayer(const class FName LayerName, const class UFortCharacterDynamicsStateLogic* LayerStateLogic);
	class FName CurrentStateName();
	class FName CurrentStateNameForLayer(const class FName LayerName);
	bool GetProperty(const class FName PropertyName);
	bool GetPropertyForLayer(const class FName LayerName, const class FName PropertyName);
	class FName PreviousStateName();
	class FName PreviousStateNameForLayer(const class FName LayerName);
	void RemoveLayer(const class FName LayerName);
	void SetProperty(const class FName PropertyName, const bool PropertyValue);

	float GetTimeInCurrentStateSeconds() const;
	float GetTimeInCurrentStateSecondsForLayer(const class FName LayerName) const;
	bool HasLayer(const class FName LayerName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCharacterDynamicsComponent">();
	}
	static class UFortCharacterDynamicsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCharacterDynamicsComponent>();
	}
};

}

