#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClamberingCodeRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "ClamberingCodeRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ClamberingCodeRuntime.FortMovementMode_ClamberingRuntimeData.GetSyncPosition
// 0x0018 (0x0018 - 0x0000)
struct FortMovementMode_ClamberingRuntimeData_GetSyncPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.FortMovementMode_ExtClambering.BP_GetAnimationMontageInformation
// 0x0060 (0x0060 - 0x0000)
struct FortMovementMode_ExtClambering_BP_GetAnimationMontageInformation final
{
public:
	struct FClamberMontageInput                   Context;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimMontage*                           AnimMontage;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartSectionName;                                  // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MontageMiddleSectionName;                          // 0x005C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.InstancedLedgeActor.BP_OnAddInstance
// 0x0070 (0x0070 - 0x0000)
struct InstancedLedgeActor_BP_OnAddInstance final
{
public:
	struct FTransform                             LedgeTransform;                                    // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceIndex;                                     // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ClamberingCodeRuntime.InstancedLedgeActor.BP_OnRemoveInstance
// 0x0070 (0x0070 - 0x0000)
struct InstancedLedgeActor_BP_OnRemoveInstance final
{
public:
	struct FTransform                             LedgeTransform;                                    // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceIndex;                                     // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ClamberingCodeRuntime.LedgeLaunchWorldSubsystem.OnWallDied
// 0x0158 (0x0158 - 0x0000)
struct LedgeLaunchWorldSubsystem_OnWallDied final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AFortPawn*                              InstigatedBy;                                      // 0x0130(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0138(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0140(0x0018)(Parm, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.BP_HandleClamberingStateChanged
// 0x0002 (0x0002 - 0x0000)
struct ClamberingComponent_BP_HandleClamberingStateChanged final
{
public:
	EClamberingState                              OldClamberingState;                                // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EClamberingState                              NewClamberingState;                                // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.BP_HandleSynchedActionStarted
// 0x0030 (0x0030 - 0x0000)
struct ClamberingComponent_BP_HandleSynchedActionStarted final
{
public:
	struct FSynchedActionInfo                     SynchedActionInfo;                                 // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.DrawDebugHUD
// 0x0010 (0x0010 - 0x0000)
struct ClamberingComponent_DrawDebugHUD final
{
public:
	class AHUD*                                   HUD;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvas*                                Canvas;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleOwnerASCInitialized
// 0x0010 (0x0010 - 0x0000)
struct ClamberingComponent_HandleOwnerASCInitialized final
{
public:
	class UFortAbilitySystemComponent*            AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                        AffectedPawn;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleOwnerDied
// 0x0008 (0x0008 - 0x0000)
struct ClamberingComponent_HandleOwnerDied final
{
public:
	class AFortPawn*                              DeadPawn;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleOwnerJumpInput
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_HandleOwnerJumpInput final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleOwnerMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct ClamberingComponent_HandleOwnerMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PreviousMovementMode;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleOwnerTeleported
// 0x0008 (0x0008 - 0x0000)
struct ClamberingComponent_HandleOwnerTeleported final
{
public:
	class AFortPawn*                              TeleportedOwner;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleTargetActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct ClamberingComponent_HandleTargetActorDestroyed final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.HandleTargetingDataValid
// 0x00E0 (0x00E0 - 0x0000)
struct ClamberingComponent_HandleTargetingDataValid final
{
public:
	struct FClamberingTargetingData               TargetingData;                                     // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.NetMulticast_ClamberingLedgeFailed
// 0x0002 (0x0002 - 0x0000)
struct ClamberingComponent_NetMulticast_ClamberingLedgeFailed final
{
public:
	EClamberingFailedReason                       FailedReason;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EClamberingState                              FailedState;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.OnPlayerStatePawnSet
// 0x0018 (0x0018 - 0x0000)
struct ClamberingComponent_OnPlayerStatePawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.RegisterMutatorUpdatedDelegate
// 0x0008 (0x0008 - 0x0000)
struct ClamberingComponent_RegisterMutatorUpdatedDelegate final
{
public:
	class APawn*                                  AffectedPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.ServerStartClambering
// 0x0080 (0x0080 - 0x0000)
struct ClamberingComponent_ServerStartClambering final
{
public:
	struct FReplicatedClamberingTargetingData     InReplicatedTargetingData;                         // 0x0000(0x0078)(ConstParm, Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	double                                        ClientLastTeleportTime;                            // 0x0078(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.SetTutorialModeEnabled
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_SetTutorialModeEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.BP_CanStartClambering
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_BP_CanStartClambering final
{
public:
	bool                                          bCanStartClambering;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.BP_CanStartTargeting
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_BP_CanStartTargeting final
{
public:
	bool                                          bCanStartTargeting;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.BP_IsValidTargetActor
// 0x0010 (0x0010 - 0x0000)
struct ClamberingComponent_BP_IsValidTargetActor final
{
public:
	const class AActor*                           TargetActor;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidTargetActor;                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ClamberingCodeRuntime.ClamberingComponent.IsAutoClamberingEnabled
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_IsAutoClamberingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.IsClamberingEnabled
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_IsClamberingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.IsTutorialModeEnabled
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_IsTutorialModeEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingComponent.ShouldShowClamberIndicator
// 0x0001 (0x0001 - 0x0000)
struct ClamberingComponent_ShouldShowClamberIndicator final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ClamberingCodeRuntime.ClamberingLibrary.PerformClamberingTargeting
// 0x00F0 (0x00F0 - 0x0000)
struct ClamberingLibrary_PerformClamberingTargeting final
{
public:
	const class ACharacter*                       Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClamberingTargetingData               OutTargetingData;                                  // 0x0008(0x00E0)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

