#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonConversationRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "CommonConversationRuntime_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class CommonConversationRuntime.ConversationNode
// 0x0030 (0x0058 - 0x0028)
class UConversationNode : public UObject
{
public:
	class UObject*                                EvalWorldContextObj;                               // 0x0028(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NodeName;                                          // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Compiled_NodeGUID;                                 // 0x0040(0x0010)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UConversationNode*                      ParentNode;                                        // 0x0050(0x0008)(BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FLinearColor GetDebugParticipantColor(const struct FGameplayTag& ParticipantID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationNode">();
	}
	static class UConversationNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationNode>();
	}
};

// Class CommonConversationRuntime.ConversationSubNode
// 0x0000 (0x0058 - 0x0058)
class UConversationSubNode : public UConversationNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationSubNode">();
	}
	static class UConversationSubNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSubNode>();
	}
};

// Class CommonConversationRuntime.ConversationChoiceNode
// 0x0038 (0x0090 - 0x0058)
class UConversationChoiceNode : public UConversationSubNode
{
public:
	class FText                                   DefaultChoiceDisplayText;                          // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ChoiceTags;                                        // 0x0068(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FillChoice(const struct FConversationContext& Context, struct FClientConversationOptionEntry* ChoiceEntry) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationChoiceNode">();
	}
	static class UConversationChoiceNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationChoiceNode>();
	}
};

// Class CommonConversationRuntime.ConversationContextHelpers
// 0x0000 (0x0028 - 0x0028)
class UConversationContextHelpers final : public UBlueprintFunctionLibrary
{
public:
	static struct FConversationTaskResult AbortConversation(const struct FConversationContext& Context);
	static struct FConversationTaskResult AdvanceConversation(const struct FConversationContext& Context);
	static struct FConversationTaskResult AdvanceConversationWithChoice(const struct FConversationContext& Context, const struct FAdvanceConversationRequest& Choice);
	static bool CanConversationContinue(const struct FConversationTaskResult& ConversationTasResult);
	static class UConversationParticipantComponent* FindConversationComponent(class AActor* Actor);
	static class UConversationInstance* GetConversationInstance(const struct FConversationContext& Context);
	static class UConversationParticipantComponent* GetConversationParticipant(const struct FConversationContext& Context, const struct FGameplayTag& ParticipantTag);
	static class AActor* GetConversationParticipantActor(const struct FConversationContext& Context, const struct FGameplayTag& ParticipantTag);
	static struct FConversationNodeHandle GetCurrentConversationNodeHandle(const struct FConversationContext& Context);
	static void MakeConversationParticipant(const struct FConversationContext& Context, class AActor* ParticipantActor, const struct FGameplayTag& ParticipantTag);
	static struct FConversationTaskResult PauseConversationAndSendClientChoices(const struct FConversationContext& Context, const struct FClientConversationMessage& Message);
	static struct FConversationTaskResult ReturnToConversationStart(const struct FConversationContext& Context);
	static struct FConversationTaskResult ReturnToCurrentClientChoice(const struct FConversationContext& Context);
	static struct FConversationTaskResult ReturnToLastClientChoice(const struct FConversationContext& Context);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationContextHelpers">();
	}
	static class UConversationContextHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationContextHelpers>();
	}
};

// Class CommonConversationRuntime.ConversationDatabase
// 0x00B8 (0x00E8 - 0x0030)
class UConversationDatabase final : public UPrimaryDataAsset
{
public:
	int32                                         CompilerVersion;                                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, class UConversationNode*>  ReachableNodeMap;                                  // 0x0038(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FConversationEntryList>         EntryTags;                                         // 0x0088(0x0010)(ZeroConstructor, AssetRegistrySearchable, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  ExitTags;                                          // 0x0098(0x0020)(AssetRegistrySearchable, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          InternalNodeIds;                                   // 0x00B8(0x0010)(ZeroConstructor, AssetRegistrySearchable, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          LinkedToNodeIds;                                   // 0x00C8(0x0010)(ZeroConstructor, AssetRegistrySearchable, NativeAccessSpecifierPrivate)
	TArray<struct FCommonDialogueBankParticipant> Speakers;                                          // 0x00D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationDatabase">();
	}
	static class UConversationDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationDatabase>();
	}
};

// Class CommonConversationRuntime.ConversationNodeWithLinks
// 0x0010 (0x0068 - 0x0058)
class UConversationNodeWithLinks : public UConversationNode
{
public:
	TArray<struct FGuid>                          OutputConnections;                                 // 0x0058(0x0010)(BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationNodeWithLinks">();
	}
	static class UConversationNodeWithLinks* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationNodeWithLinks>();
	}
};

// Class CommonConversationRuntime.ConversationEntryPointNode
// 0x0008 (0x0070 - 0x0068)
class UConversationEntryPointNode : public UConversationNodeWithLinks
{
public:
	struct FGameplayTag                           EntryTag;                                          // 0x0068(0x0004)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationEntryPointNode">();
	}
	static class UConversationEntryPointNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationEntryPointNode>();
	}
};

// Class CommonConversationRuntime.ConversationInstance
// 0x0178 (0x01A0 - 0x0028)
class UConversationInstance : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConversationParticipants              Participants;                                      // 0x0050(0x0010)(NativeAccessSpecifierPrivate)
	class UConversationDatabase*                  ActiveConversationGraph;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x138];                                     // 0x0068(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationInstance">();
	}
	static class UConversationInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationInstance>();
	}
};

// Class CommonConversationRuntime.ConversationLibrary
// 0x0000 (0x0028 - 0x0028)
class UConversationLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UConversationInstance* StartConversation(const struct FGameplayTag& ConversationEntryTag, class AActor* Instigator, const struct FGameplayTag& InstigatorTag, class AActor* Target, const struct FGameplayTag& TargetTag, const TSubclassOf<class UConversationInstance> ConversationInstanceClass);
	static class UConversationInstance* StartConversationFromGraph(const struct FGameplayTag& ConversationEntryTag, class AActor* Instigator, const struct FGameplayTag& InstigatorTag, class AActor* Target, const struct FGameplayTag& TargetTag, const class UConversationDatabase* Graph);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationLibrary">();
	}
	static class UConversationLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationLibrary>();
	}
};

// Class CommonConversationRuntime.ConversationTaskNode
// 0x0018 (0x0080 - 0x0068)
class UConversationTaskNode : public UConversationNodeWithLinks
{
public:
	TArray<class UConversationSubNode*>           SubNodes;                                          // 0x0068(0x0010)(BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bIgnoreRequirementsWhileAdvancingConversations;    // 0x0078(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExecuteClientEffects(const struct FConversationContext& Context) const;
	struct FConversationTaskResult ExecuteTaskNode(const struct FConversationContext& Context) const;
	void GatherStaticExtraData(const struct FConversationContext& Context, TArray<struct FConversationNodeParameterPair>* InOutExtraData) const;
	bool GetNodeBodyColor(struct FLinearColor* BodyColor) const;
	EConversationRequirementResult IsRequirementSatisfied(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationTaskNode">();
	}
	static class UConversationTaskNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationTaskNode>();
	}
};

// Class CommonConversationRuntime.ConversationLinkNode
// 0x0008 (0x0088 - 0x0080)
class UConversationLinkNode final : public UConversationTaskNode
{
public:
	struct FGameplayTag                           RemoteEntryTag;                                    // 0x0080(0x0004)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationLinkNode">();
	}
	static class UConversationLinkNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationLinkNode>();
	}
};

// Class CommonConversationRuntime.ConversationParticipantComponent
// 0x00F0 (0x0190 - 0x00A0)
class UConversationParticipantComponent : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x60];                                      // 0x00A0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ConversationsActive;                               // 0x0100(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UConversationInstance*                  Auth_CurrentConversation;                          // 0x0108(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UConversationInstance*>          Auth_Conversations;                                // 0x0110(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FClientConversationMessagePayload      LastMessage;                                       // 0x0120(0x0068)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientExecuteTaskAndSideEffects(const struct FConversationNodeHandle& Handle, const class UConversationDatabase* Graph);
	void ClientExitConversation(const struct FConversationParticipants& InParticipants);
	void ClientStartConversation(const struct FConversationParticipants& InParticipants);
	void ClientUpdateConversation(const struct FClientConversationMessagePayload& Message);
	void ClientUpdateConversations(int32 InConversationsActive);
	void ClientUpdateConversationTaskChoiceData(const struct FConversationNodeHandle& Handle, const struct FClientConversationOptionEntry& OptionEntry);
	void ClientUpdateParticipants(const struct FConversationParticipants& InParticipants);
	class FText GetParticipantDisplayName();
	void OnRep_ConversationsActive(int32 OldConversationsActive);
	void RequestServerAdvanceConversation(const struct FAdvanceConversationRequest& InChoicePicked);
	void ServerAdvanceConversation(const struct FAdvanceConversationRequest& InChoicePicked);

	class AActor* GetParticipantActor(const struct FGameplayTag& ParticipantTag) const;
	bool IsInActiveConversation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationParticipantComponent">();
	}
	static class UConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationParticipantComponent>();
	}
};

// Class CommonConversationRuntime.ConversationRegistry
// 0x01C8 (0x01F8 - 0x0030)
class UConversationRegistry final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetSerializeScriptStructCache_ConvVersion ConversationChoiceDataStructCache;             // 0x0038(0x0060)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x160];                                     // 0x0098(0x0160)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationRegistry">();
	}
	static class UConversationRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationRegistry>();
	}
};

// Class CommonConversationRuntime.ConversationRequirementNode
// 0x0000 (0x0058 - 0x0058)
class UConversationRequirementNode : public UConversationSubNode
{
public:
	EConversationRequirementResult IsRequirementSatisfied(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationRequirementNode">();
	}
	static class UConversationRequirementNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationRequirementNode>();
	}
};

// Class CommonConversationRuntime.ConversationSettings
// 0x0020 (0x0050 - 0x0030)
class UConversationSettings final : public UDeveloperSettings
{
public:
	TSoftClassPtr<class UClass>                   ConversationInstanceClass;                         // 0x0030(0x0020)(Edit, Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationSettings">();
	}
	static class UConversationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSettings>();
	}
};

// Class CommonConversationRuntime.ConversationSideEffectNode
// 0x0000 (0x0058 - 0x0058)
class UConversationSideEffectNode : public UConversationSubNode
{
public:
	void ClientCauseSideEffect(const struct FConversationContext& Context) const;
	void ServerCauseSideEffect(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConversationSideEffectNode">();
	}
	static class UConversationSideEffectNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSideEffectNode>();
	}
};

}

