#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompanionAI_0

#include "Basic.hpp"

#include "VerseNative_structs.hpp"
#include "CompanionAI_0_structs.hpp"
#include "VerseFortnite_0_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "VerseColors_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetAgent_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetAgent_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct CompanionAI_0::Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     RetVal;                                            // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetNPCLeashRadius_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0020 (0x0020 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetNPCLeashRadius_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lfloat_Mfloat_R  RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetTeamMembers_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0020 (0x0020 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eGetTeamMembers_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument;         // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USimulation_agent*>              RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eIsBeingDBNOCarried_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R
// 0x0018 (0x0018 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_Roperator_U_2eIsBeingDBNOCarried_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R final
{
public:
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0010(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R
// 0x02E8 (0x02E8 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Ncommand__type_R final
{
public:
	ECompanionAI_PingCommand_command_type         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_0;                               // 0x0018(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_1;                                // 0x0028(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_3;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_4;                               // 0x0060(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_5;                                // 0x0070(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_7;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_8;                               // 0x00A8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_9;                                // 0x00B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_10;                                    // 0x00D0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_11;                                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_12;                              // 0x00F0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_13;                               // 0x0100(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_15;                                    // 0x0128(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_16;                              // 0x0138(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_17;                               // 0x0148(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_18;                                    // 0x0160(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_19;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_20;                              // 0x0180(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_21;                               // 0x0190(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_22;                                    // 0x01A8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_23;                                    // 0x01B8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_24;                              // 0x01C8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_25;                               // 0x01D8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_26;                                    // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_27;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_28;                              // 0x0210(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_29;                               // 0x0220(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_30;                                    // 0x0238(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_31;                                    // 0x0248(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_32;                              // 0x0258(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_33;                               // 0x0268(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_34;                                    // 0x0280(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_35;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_36;                              // 0x02A0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_37;                               // 0x02B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_38;                                    // 0x02C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_39;                                    // 0x02D8(0x0010)(HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI._L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R
// 0x0378 (0x0378 - 0x0000)
struct CompanionAI__L_2fFortnite_2ecom_2fAI_2fCompanionAI_N_RToString_L_Nentity__type_R final
{
public:
	ECompanionAI_PingCommand_entity_type          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseStringProperty_                         RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_0;                               // 0x0018(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_1;                                // 0x0028(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_2;                                     // 0x0040(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_3;                                     // 0x0050(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_4;                               // 0x0060(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_5;                                // 0x0070(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_6;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_7;                                     // 0x0098(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_8;                               // 0x00A8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_9;                                // 0x00B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_10;                                    // 0x00D0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_11;                                    // 0x00E0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_12;                              // 0x00F0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_13;                               // 0x0100(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_14;                                    // 0x0118(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_15;                                    // 0x0128(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_16;                              // 0x0138(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_17;                               // 0x0148(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_18;                                    // 0x0160(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_19;                                    // 0x0170(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_20;                              // 0x0180(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_21;                               // 0x0190(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_22;                                    // 0x01A8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_23;                                    // 0x01B8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_24;                              // 0x01C8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_25;                               // 0x01D8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_26;                                    // 0x01F0(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_27;                                    // 0x0200(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_28;                              // 0x0210(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_29;                               // 0x0220(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_30;                                    // 0x0238(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_31;                                    // 0x0248(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_32;                              // 0x0258(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_33;                               // 0x0268(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_34;                                    // 0x0280(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_35;                                    // 0x0290(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_36;                              // 0x02A0(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_37;                               // 0x02B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_38;                                    // 0x02C8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_39;                                    // 0x02D8(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_40;                              // 0x02E8(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_41;                               // 0x02F8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_42;                                    // 0x0310(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_43;                                    // 0x0320(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        InvokeResultDummy_44;                              // 0x0330(0x0010)(HasGetValueTypeHash)
	TOptional<FVerseDynamicProperty_>             _ExprResultStack_45;                               // 0x0340(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_46;                                    // 0x0358(0x0010)(HasGetValueTypeHash)
	FVerseDynamicProperty_                        _ExprResult_47;                                    // 0x0368(0x0010)(HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI.CompanionAI_ping_info$Factory
// 0x0038 (0x0038 - 0x0000)
struct CompanionAI_CompanionAI_ping_info_Factory final
{
public:
	struct FCompanionAI_ping_info                 RetVal;                                            // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function CompanionAI.CompanionAI.CompanionAI_ping_info$OverrideFactory
// 0x0088 (0x0088 - 0x0000)
struct CompanionAI_CompanionAI_ping_info_OverrideFactory final
{
public:
	struct FCompanionAI_ping_info                 RetVal;                                            // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0038(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function CompanionAI.CompanionAI_companion_ai.$InitCDO
// 0x0050 (0x0050 - 0x0000)
struct CompanionAI_companion_ai__InitCDO final
{
public:
	class UDiagnostics_log*                       _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0xFAE6EE9E_Channel_2;                      // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*                _ExprResult_3;                                     // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_4;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDiagnostics_log*                       _ExprResult_5;                                     // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_6;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 __verse_0xFAE6EE9E_Channel_7;                      // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDiagnostics_debug_draw*                _ExprResult_8;                                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_companion_ai.OnBegin
// 0x0028 (0x0028 - 0x0000)
struct CompanionAI_companion_ai_OnBegin final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function CompanionAI.task_CompanionAI_companion_ai_runtime$SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_CompanionAI_companion_ai_runtime_SetLeashPosition_L_Nvector3_M_Nfloat_M_Nagent_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_ping_component.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct CompanionAI_ping_component__InitCDO final
{
public:
	class UVerseEngine_multicast_delegate*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*        _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_multicast_delegate*        _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RAreNPCCommandsEnabled
// 0x0002 (0x0002 - 0x0000)
struct CompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RAreNPCCommandsEnabled final
{
public:
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RCanAcceptPingCommand
// 0x0002 (0x0002 - 0x0000)
struct CompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RCanAcceptPingCommand final
{
public:
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RConvertedEvent
// 0x0010 (0x0010 - 0x0000)
struct CompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RConvertedEvent final
{
public:
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RConvertPingToAttack_L_Nagent_R
// 0x0008 (0x0008 - 0x0000)
struct CompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RConvertPingToAttack_L_Nagent_R final
{
public:
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RDeclineNPCCommand_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct CompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RDeclineNPCCommand_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_REnableCommandWheel_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct CompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_REnableCommandWheel_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RGetCurrentNPCCommand
// 0x0048 (0x0048 - 0x0000)
struct CompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RGetCurrentNPCCommand final
{
public:
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FCompanionAI_ping_info>      RetVal;                                            // 0x0008(0x0040)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RIsAttackCommandEnabled
// 0x0002 (0x0002 - 0x0000)
struct CompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RIsAttackCommandEnabled final
{
public:
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function CompanionAI.CompanionAI_ping_component._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RUnconvertedEvent
// 0x0010 (0x0010 - 0x0000)
struct CompanionAI_ping_component__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fping__component_N_RUnconvertedEvent final
{
public:
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_ping_component.OnNPCCommand
// 0x0028 (0x0028 - 0x0000)
struct CompanionAI_ping_component_OnNPCCommand final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function CompanionAI.task_CompanionAI_companion_ai_runtime$WaitForTargetInVehicleService_L_Nfort__character_R.Update
// 0x0008 (0x0008 - 0x0000)
struct task_CompanionAI_companion_ai_runtime_WaitForTargetInVehicleService_L_Nfort__character_R_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function CompanionAI.CompanionAI_companion_ai_runtime._L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RCheckForDBNOTeamMembersInRange_L_Nping__info_R
// 0x0A30 (0x0A30 - 0x0000)
struct CompanionAI_companion_ai_runtime__L_2fFortnite_2ecom_2fAI_2fCompanionAI_2fcompanion__ai__runtime_N_RCheckForDBNOTeamMembersInRange_L_Nping__info_R final
{
public:
	struct FCompanionAI_ping_info                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0038)(Parm, NoDestructor)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0038(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_0;                                     // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xCFC3F3F6_success_1 : 1;                  // 0x003B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_agent*                      __verse_0xFD64D7AA_Emitter_2;                      // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_1;                                // 0x0048(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __verse_0x6B4100B8_EmitterCharacter_2;             // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_2;                                // 0x0058(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0060(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_4;                       // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_5;                                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_6;                                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_agent*                      __verse_0xC487D1E7_EmitterAgent_2;                 // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__3;                             // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_7;                                // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x00A0(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_9;                                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResultStack_10;                               // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_11;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_12;                                        // 0x00D0(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_13;                                 // 0x00E0(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_transform                 _ExprResult_14;                                    // 0x0110(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__6;                             // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_15;                                        // 0x0178(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_16;                                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_17;                                    // 0x0190(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__7;                             // 0x01F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x01F8(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_19;                                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__8;                             // 0x0210(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_20;                               // 0x0218(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_21;                                        // 0x0220(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_22;                      // 0x0230(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_23;                                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_24;                                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_25;                               // 0x0242(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_26;                                        // 0x0248(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_27;                                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_28;                               // 0x0259(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_29;                                        // 0x0260(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_30;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_31;                               // 0x0280(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_32;                                        // 0x0288(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_33;                      // 0x0298(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_34;                                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_35;                                    // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_36;                                    // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_37;                                    // 0x02AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_agent*>              __verse_0xBFBCE682_TeamMembers_9;                  // 0x02B0(0x0010)(ContainsInstancedReference)
	FVerseFunctionProperty_                       _Callee_38;                                        // 0x02C0(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_39;                      // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_40;                                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_41;                                    // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _ForIndex_42;                                      // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_43;                                     // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xAE35E375_TeamMember_12;                  // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_44;                               // 0x0300(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResultStack_45;                               // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_46;                               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_47;                                        // 0x0320(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_48;                                 // 0x0330(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_transform                 _ExprResult_49;                                    // 0x0360(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__16;                            // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_50;                               // 0x03C8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_51;                                        // 0x03D0(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_52;                      // 0x03E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_53;                                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_54;                                    // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_55;                                        // 0x03F8(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_56;                                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_57;                                    // 0x0410(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__17;                            // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_58;                                        // 0x0478(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_59;                                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__18;                            // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_60;                               // 0x0498(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_61;                                        // 0x04A0(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_62;                      // 0x04B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_63;                                    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_64;                                    // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_65;                               // 0x04C2(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_66;                                        // 0x04C8(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_67;                                    // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_68;                               // 0x04D9(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DB[0x5];                                      // 0x04DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_69;                                        // 0x04E0(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_70;            // 0x04F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_71;                               // 0x0500(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_72;                                        // 0x0508(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_73;                      // 0x0518(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_74;                                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_75;                                    // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_76;                                    // 0x052A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_77;                                    // 0x052B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_78;                               // 0x052C(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<uint8>                              _ExprResultStack_79;                               // 0x052E(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _ExprResult_80;                                    // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xCFC3F3F6_success_22 : 1;                 // 0x0531(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_532[0x6];                                      // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_agent*                      __verse_0xFD64D7AA_Emitter_23;                     // 0x0538(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_81;                               // 0x0540(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UObject*                                __verse_0x6B4100B8_EmitterCharacter_23;            // 0x0548(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_82;                               // 0x0550(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_83;                                        // 0x0558(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_84;                      // 0x0568(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_85;                                    // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_86;                                    // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A[0x6];                                      // 0x057A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_agent*                      __verse_0xC487D1E7_EmitterAgent_23;                // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x00000000__24;                            // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class USimulation_agent*, true>     _ExprResultStack_87;                               // 0x0590(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_88;                                        // 0x0598(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_89;                                    // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResultStack_90;                               // 0x05B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        _ExprResultStack_91;                               // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_92;                                        // 0x05C8(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lvector3_Mvector3_R _ExprResult_93;                                 // 0x05D8(0x0030)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_608[0x8];                                      // 0x0608(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_94;                                    // 0x0610(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__27;                            // 0x0670(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_95;                                        // 0x0678(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_96;                                    // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 _ExprResult_97;                                    // 0x0690(0x0060)(NoDestructor)
	class UObject*                                __verse_0x00000000__28;                            // 0x06F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_98;                                        // 0x06F8(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_99;                                    // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x00000000__29;                            // 0x0710(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_100;                              // 0x0718(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_101;                                       // 0x0720(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_102;                     // 0x0730(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_103;                                   // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_104;                                   // 0x0741(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_105;                              // 0x0742(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_106;                                       // 0x0748(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_L_R              _ExprResult_107;                                   // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         _ExprResultStack_108;                              // 0x0759(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75B[0x5];                                      // 0x075B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_109;                                       // 0x0760(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R _ExprResult_110;           // 0x0770(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               _ExprResultStack_111;                              // 0x0780(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_112;                                       // 0x0788(0x0010)(HasGetValueTypeHash)
	struct CompanionAI_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R _ExprResult_113;                     // 0x0798(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
