#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Component.CameraEntityProxyActor
// 0x0000 (0x09B0 - 0x09B0)
class ACameraEntityProxyActor final : public ACameraActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraEntityProxyActor">();
	}
	static class ACameraEntityProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraEntityProxyActor>();
	}
};

// Class Component.LightProxyActor
// 0x0008 (0x0298 - 0x0290)
class ALightProxyActor final : public AActor
{
public:
	class ULightComponent*                        LightComponent;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LightProxyActor">();
	}
	static class ALightProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALightProxyActor>();
	}
};

// Class Component.ParticleSystemProxyActor
// 0x0008 (0x0298 - 0x0290)
class AParticleSystemProxyActor final : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ParticleSystemProxyActor">();
	}
	static class AParticleSystemProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParticleSystemProxyActor>();
	}
};

// Class Component.PhysicsEntityComponent_Implementation
// 0x01A8 (0x01D0 - 0x0028)
class UPhysicsEntityComponent_Implementation final : public UObject
{
public:
	struct FBodyInstance                          BodyInstance;                                      // 0x0028(0x0198)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C0[0x10];                                     // 0x01C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhysicsEntityComponent_Implementation">();
	}
	static class UPhysicsEntityComponent_Implementation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsEntityComponent_Implementation>();
	}
};

// Class Component.SoundProxyActor
// 0x0010 (0x02A0 - 0x0290)
class ASoundProxyActor final : public AActor
{
public:
	float                                         StartTime;                                         // 0x0290(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRep_StartTime();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoundProxyActor">();
	}
	static class ASoundProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASoundProxyActor>();
	}
};

// Class Component.StaticMeshEntityComponent_Implementation
// 0x01D8 (0x0200 - 0x0028)
class UStaticMeshEntityComponent_Implementation final : public UObject
{
public:
	uint8                                         Pad_28[0x1D8];                                     // 0x0028(0x01D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StaticMeshEntityComponent_Implementation">();
	}
	static class UStaticMeshEntityComponent_Implementation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStaticMeshEntityComponent_Implementation>();
	}
};

// Class Component.TextDisplayProxyActor
// 0x0010 (0x02A0 - 0x0290)
class ATextDisplayProxyActor final : public AActor
{
public:
	class UTextRenderComponent*                   TextRenderComponent;                               // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     TextMaterial;                                      // 0x0298(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextDisplayProxyActor">();
	}
	static class ATextDisplayProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATextDisplayProxyActor>();
	}
};

}

