#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Component_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Entity_0_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseColors_structs.hpp"
#include "VerseUI_0_structs.hpp"
#include "Component_0_structs.hpp"


namespace SDK
{

// VerseClass Component.basic_camera_component
// 0x0068 (0x01C8 - 0x0160)
class Ubasic_camera_component : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x37156266__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RSetFieldOfView_L_Nfloat_R; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2D0F2068__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RGetFieldOfView; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA6E43E3C__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_ROnRep__FieldOfView; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3B18B451__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RUpdateFieldOfView; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	double                                        __verse_0xE317D65E_FieldOfView;                    // 0x01A0(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x20];                                     // 0x01A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RGetFieldOfView(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_ROnRep__FieldOfView(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RSetFieldOfView_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fbasic__camera__component_N_RUpdateFieldOfView(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"basic_camera_component">();
	}
	static class Ubasic_camera_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubasic_camera_component>();
	}
};

// VerseClass Component.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class Component_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass Component.$SolarisSignatureFunctionOuter", true>();
	}
	static class Component_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<Component_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass Component._Root
// 0x0000 (0x0028 - 0x0028)
class Component_0::U_Root final : public UObject
{
public:
	static struct Fhit_result hit_result_Factory();
	static struct Fhit_result hit_result_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass Component._Root", true>();
	}
	static class Component_0::U_Root* GetDefaultObj()
	{
		return GetDefaultObjImpl<Component_0::U_Root>();
	}
};

// VerseClass Component.attachment_component
// 0x0140 (0x02A0 - 0x0160)
class Uattachment_component final : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x9E30623D__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RAttachTo_L_Nentity_R; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x542DAB46__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x90658461__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RDetachFrom; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD586ABAA__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAE28DB7D__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF92A4A5B__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RGetAttachedTransform; // 0x01B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         __verse_0x1AEA3A6F_AutoAttachToOwner : 1;          // 0x01C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1C1[0xF];                                      // 0x01C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FSpatialMath_transform>      __verse_0xDF51C8D3_RelativeTransform;              // 0x01D0(0x0070)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference)
	TOptional<class Entity_0::UEntity*, true>     __verse_0x1F66826C_ParentEntity;                   // 0x0240(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_248[0x58];                                     // 0x0248(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RAttachTo_L_Nentity_M_Ntransform_R(const struct Ftuple_Lentity_Mtransform_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RAttachTo_L_Nentity_R(class Entity_0::UEntity* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RDetachFrom(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<struct FSpatialMath_transform> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RGetAttachedTransform(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RSetRelativeTransform_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fattachment__component_N_RSetRelativeTransformFromGlobal_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"attachment_component">();
	}
	static class Uattachment_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uattachment_component>();
	}
};

// VerseClass Component.light_entity_component
// 0x0020 (0x0180 - 0x0160)
class Ulight_entity_component : public UComponent
{
public:
	uint8                                         Pad_160[0x20];                                     // 0x0160(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"light_entity_component">();
	}
	static class Ulight_entity_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ulight_entity_component>();
	}
};

// VerseClass Component.damageable_component
// 0x0030 (0x0190 - 0x0160)
class Udamageable_component : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xC637C8C7__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdamageable__component_N_RDamage_L_Nfloat_R; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_170[0x18];                                     // 0x0170(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x2DEDA279_DamagedEvent;                   // 0x0188(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdamageable__component_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"damageable_component">();
	}
	static class Udamageable_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Udamageable_component>();
	}
};

// VerseClass Component.light_component
// 0x01C0 (0x0320 - 0x0160)
class Ulight_component : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xCB9F1ADE__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastShadows; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2CF96C4C__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastShadows_L_Nlogic_R; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x89433D20__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__CastShadows; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBDD26A50__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastVolumetricShadow; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x77D76AD5__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastVolumetricShadow_L_Nlogic_R; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0114C71F__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__CastVolumetricShadow; // 0x01B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6314B7CD__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastDeepShadows; // 0x01C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3319F8E0__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastDeepShadows_L_Nlogic_R; // 0x01D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xACFD53A9__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__CastDeepShadows; // 0x01E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC5F08AD5__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectReflection; // 0x01F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x36D597D9__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectReflection_L_Nlogic_R; // 0x0200(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x13765A2D__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__AffectReflection; // 0x0210(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFE3BEC60__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectGlobalIllumination; // 0x0220(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x112A8E09__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectGlobalIllumination_L_Nlogic_R; // 0x0230(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xEABCBDAF__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__AffectGlobalIllumination; // 0x0240(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x396924B5__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetIntensity; // 0x0250(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAFC20BCB__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetIntensity_L_Nfloat_R; // 0x0260(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9CB8DA33__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__Intensity; // 0x0270(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC732BC5C__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor; // 0x0280(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6BCDAF01__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Ncolor_R; // 0x0290(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x05D9CBC6__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__Color; // 0x02A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         __verse_0x370AFB5F_CastShadows : 1;                // 0x02B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_2B0_1 : 7;                                  // 0x02B0(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x8E6057EF_CastVolumetricShadow : 1;       // 0x02B1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_2B1_1 : 7;                                  // 0x02B1(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x1635313F_CastDeepShadows : 1;            // 0x02B2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_2B2_1 : 7;                                  // 0x02B2(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x41208E8E_AffectReflection : 1;           // 0x02B3(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_2B3_1 : 7;                                  // 0x02B3(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xF603D50E_AffectGlobalIllumination : 1;   // 0x02B4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0x06B3E864_Intensity;                      // 0x02B8(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x65678AC7_Color;                          // 0x02C0(0x0018)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         __verse_0x00FBC2A9__CastShadows : 1;               // 0x02D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_2D8_1 : 7;                                  // 0x02D8(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xA19307B9__CastVolumetricShadow : 1;      // 0x02D9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_2D9_1 : 7;                                  // 0x02D9(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xC5440B7D__CastDeepShadows : 1;           // 0x02DA(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_2DA_1 : 7;                                  // 0x02DA(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x94CA2752__AffectReflection : 1;          // 0x02DB(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_2DB_1 : 7;                                  // 0x02DB(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xEE7CC240__AffectGlobalIllumination : 1;  // 0x02DC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0x4E4E65F6__Intensity;                     // 0x02E0(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x89B83CD1__Color;                         // 0x02E8(0x0018)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_300[0x20];                                     // 0x0300(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectGlobalIllumination(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetAffectReflection(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastDeepShadows(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastShadows(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetCastVolumetricShadow(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetColor(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RGetIntensity(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__AffectGlobalIllumination(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__AffectReflection(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__CastDeepShadows(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__CastShadows(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__CastVolumetricShadow(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__Color(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_ROnRep__Intensity(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectGlobalIllumination_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetAffectReflection_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastDeepShadows_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastShadows_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetCastVolumetricShadow_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetColor_L_Ncolor_R(const struct FColors_color& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flight__component_N_RSetIntensity_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"light_component">();
	}
	static class Ulight_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ulight_component>();
	}
};

// VerseClass Component.directional_light_component
// 0x0048 (0x0368 - 0x0320)
class Udirectional_light_component final : public Ulight_component
{
public:
	FVerseFunctionProperty_                       __verse_0xE647CB8A__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_RGetShadowOpacity; // 0x0320(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0CCAFF7E__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R; // 0x0330(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x089F4924__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_ROnRep__ShadowOpacity; // 0x0340(0x0010)(InstancedReference, HasGetValueTypeHash)
	double                                        __verse_0x7D2E69E8_ShadowOpacity;                  // 0x0350(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xECB66941__ShadowOpacity;                 // 0x0358(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_360[0x8];                                      // 0x0360(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_RGetShadowOpacity(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_ROnRep__ShadowOpacity(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fdirectional__light__component_N_RSetShadowOpacity_L_Ntype_7b__X_Nfloat_20where_200_2e000000_20_3c_3d_20__X_M_20__X_20_3c_3d_201_2e000000_7d_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"directional_light_component">();
	}
	static class Udirectional_light_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Udirectional_light_component>();
	}
};

// VerseClass Component.local_hud_component
// 0x0048 (0x01A8 - 0x0160)
class Ulocal_hud_component final : public UComponent
{
public:
	class UUI_canvas*                             __verse_0x89A21F20_Canvas;                         // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FUI_player_ui_slot                     __verse_0xF1214EFE_UISlot;                         // 0x0168(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	TArray<class USimulation_player*>             __verse_0x76952CF9_ShowingPlayerUI;                // 0x0178(0x0010)(InstancedReference, ContainsInstancedReference)
	FVerseFunctionProperty_                       __verse_0xB2CBDAEF__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RHide_L_Nplayer_R; // 0x0188(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBE353360__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RShow_L_Nplayer_R; // 0x0198(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RHide_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2flocal__hud__component_N_RShow_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"local_hud_component">();
	}
	static class Ulocal_hud_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ulocal_hud_component>();
	}
};

// VerseClass Component.mesh_component
// 0x0018 (0x0178 - 0x0160)
class Umesh_component : public UComponent
{
public:
	uint8                                         Pad_160[0x18];                                     // 0x0160(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"mesh_component">();
	}
	static class Umesh_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Umesh_component>();
	}
};

// VerseClass Component.particle_system_component
// 0x01E8 (0x0348 - 0x0160)
class Uparticle_system_component final : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xB983CAED__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RActivate; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x13053EB4__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RDeactivate; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6BBBCAD4__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__ActivationCounter; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBF5B0C64__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__ParticleSystem; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x66A32DD0__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamStart; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFBC5735C__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamStartTangent; // 0x01B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x77197737__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamEnd; // 0x01C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CE63A63__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamEndTangent; // 0x01D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x48A2AE35__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamWidth; // 0x01E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7091E10F__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamStart_L_Nvector3_R; // 0x01F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC0C79C40__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamStartTangent_L_Nvector3_R; // 0x0200(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x66D05EFE__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamEnd_L_Nvector3_R; // 0x0210(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA88E4D33__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamEndTangent_L_Nvector3_R; // 0x0220(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1046EACF__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamWidth_L_Nfloat_R; // 0x0230(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9F9250BD__L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable; // 0x0240(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x20BC70FC__L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable; // 0x0250(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7E7AEB13__L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled; // 0x0260(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_particle_system*                __verse_0x1CB585BF_ParticleSystem;                 // 0x0270(0x0008)(Edit, ExportObject, Net, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_278[0x20];                                     // 0x0278(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x6679EC8B_AutoActivate : 1;               // 0x0298(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0x0DA8A322_ActivationCounter;              // 0x02A0(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x8892301A_bWantsImplementation : 1;       // 0x02A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_vector3                   __verse_0x68030817_BeamStart;                      // 0x02B0(0x0018)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x86F3B4EC_BeamStartTangent;               // 0x02C8(0x0018)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0x9C23C07D_BeamEnd;                        // 0x02E0(0x0018)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   __verse_0xBF08B3B8_BeamEndTangent;                 // 0x02F8(0x0018)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x46028BF2_BeamWidth;                      // 0x0310(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_318[0x30];                                     // 0x0318(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RActivate(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RDeactivate(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__ActivationCounter(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamEnd(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamEndTangent(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamStart(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamStartTangent(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__BeamWidth(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_ROnRep__ParticleSystem(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamEnd_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamEndTangent_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamStart_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamStartTangent_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fparticle__system__component_N_RSetBeamWidth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"particle_system_component">();
	}
	static class Uparticle_system_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uparticle_system_component>();
	}
};

// VerseClass Component.physics_component
// 0x00A8 (0x0208 - 0x0160)
class Uphysics_component final : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x25E35BA6__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fphysics__component_N_ROnRep__Enabled; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9F9250BD__L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x20BC70FC__L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7E7AEB13__L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_1A0[0x28];                                     // 0x01A0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         __verse_0x8892301A_bWantsImplementation : 1;       // 0x01C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_1C8_1 : 7;                                  // 0x01C8(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x5CDFC2A5_Enabled : 1;                    // 0x01C9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Net, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1CA[0x2E];                                     // 0x01CA(0x002E)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __verse_0x4BFA8E15_HitEvent;                       // 0x01F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<Ecollision_channel_response>        __verse_0x480529D2_VisibilityChannelResponseOverride; // 0x0200(0x0002)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fphysics__component_N_ROnRep__Enabled(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"physics_component">();
	}
	static class Uphysics_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uphysics_component>();
	}
};

// VerseClass Component.point_light_component_base
// 0x00C8 (0x03E8 - 0x0320)
class Upoint_light_component_base : public Ulight_component
{
public:
	FVerseFunctionProperty_                       __verse_0xD753F137__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetAttenuationRadius; // 0x0320(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x770455C1__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetAttenuationRadius_L_Nfloat_R; // 0x0330(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x168C1ED5__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep__AttenuationRadius; // 0x0340(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCD7113A9__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetSourceRadius; // 0x0350(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6447E2B4__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetSourceRadius_L_Nfloat_R; // 0x0360(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x86905F11__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep__SourceRadius; // 0x0370(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x753295AC__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetSourceLength; // 0x0380(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2B130E61__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetSourceLength_L_Nfloat_R; // 0x0390(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3ED3D914__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep__SourceLength; // 0x03A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	double                                        __verse_0xBAB0877B_AttenuationRadius;              // 0x03B0(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x12542E15_SourceRadius;                   // 0x03B8(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xAA17A810_SourceLength;                   // 0x03C0(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x3835D83E__AttenuationRadius;             // 0x03C8(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7E578E96__SourceRadius;                  // 0x03D0(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xC6140893__SourceLength;                  // 0x03D8(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E0[0x8];                                      // 0x03E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetAttenuationRadius(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetSourceLength(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RGetSourceRadius(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep__AttenuationRadius(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep__SourceLength(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_ROnRep__SourceRadius(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetAttenuationRadius_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetSourceLength_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fpoint__light__component__base_N_RSetSourceRadius_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"point_light_component_base">();
	}
	static class Upoint_light_component_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<Upoint_light_component_base>();
	}
};

// VerseClass Component.point_light_component
// 0x0000 (0x03E8 - 0x03E8)
class Upoint_light_component final : public Upoint_light_component_base
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"point_light_component">();
	}
	static class Upoint_light_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Upoint_light_component>();
	}
};

// VerseClass Component.spot_light_entity_component
// 0x0210 (0x0390 - 0x0180)
class Uspot_light_entity_component final : public Ulight_entity_component
{
public:
	FVerseFunctionProperty_                       __verse_0xF59495C5__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RSetIntensity_L_Nfloat_R; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x94D51798__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RSetColor_L_Ncolor_R; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD198C249__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RSetSourceRadius_L_Nfloat_R; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9ECC2E9C__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RSetSourceLength_L_Nfloat_R; // 0x01B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3C0648BF__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RSetInnerConeAngle_L_Nfloat_R; // 0x01C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x70FEB64A__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RSetOuterConeAngle_L_Nfloat_R; // 0x01D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6FE8106D__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RSetAttenuationRadius_L_Nfloat_R; // 0x01E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE5217DDC__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetIntensity; // 0x01F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x64803A17__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetColor; // 0x0200(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB7EC607F__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetSourceRadius; // 0x0210(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0FAFE67A__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetSourceLength; // 0x0220(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x83CED44E__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetInnerConeAngle; // 0x0230(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x42E9614B__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetOuterConeAngle; // 0x0240(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF7121F65__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetAttenuationRadius; // 0x0250(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x551D1505__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_ROnRep__Intensity; // 0x0260(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD99192AF__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_ROnRep__Color; // 0x0270(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6EDF6A53__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_ROnRep__SourceRadius; // 0x0280(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD69CEC56__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_ROnRep__SourceLength; // 0x0290(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x18FDA76B__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_ROnRep__InnerConeAngle; // 0x02A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD9DA126E__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_ROnRep__OuterConeAngle; // 0x02B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8FE0C21C__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_ROnRep__AttenuationRadius; // 0x02C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x048A788A__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RUpdateIntensity; // 0x02D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3C8840E7__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RUpdateColor; // 0x02E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x846D6D99__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RUpdateSourceRadius; // 0x02F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3C2EEB9C__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RUpdateSourceLength; // 0x0300(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFA5AFD70__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RUpdateInnerConeAngle; // 0x0310(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3B7D4875__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RUpdateOuterConeAngle; // 0x0320(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E1889E0__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RUpdateAttenuationRadius; // 0x0330(0x0010)(InstancedReference, HasGetValueTypeHash)
	double                                        __verse_0x06B3E864_Intensity;                      // 0x0340(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColors_color                          __verse_0x65678AC7_Color;                          // 0x0348(0x0018)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	double                                        __verse_0x12542E15_SourceRadius;                   // 0x0360(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xAA17A810_SourceLength;                   // 0x0368(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x5C223359_InnerConeAngle;                 // 0x0370(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x9D05865C_OuterConeAngle;                 // 0x0378(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xBAB0877B_AttenuationRadius;              // 0x0380(0x0008)(Edit, Net, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetAttenuationRadius(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FColors_color _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetColor(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetInnerConeAngle(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetIntensity(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetOuterConeAngle(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fspot__light__entity__component_N_RGetSourceLength(const struct Component_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
