#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContextualActionCodeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ContextualActionCodeRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class ContextualActionCodeRuntime.FortMovementMode_ExtLogicBaseSwinging
// 0x0038 (0x0148 - 0x0110)
class UFortMovementMode_ExtLogicBaseSwinging : public UFortMovementMode_BaseExtLogic
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortPlayerAnimInstance_SwingingObject> SwingingAnimationLayer;                // 0x0118(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GravitationalAcceleration;                         // 0x0120(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinimumInitialSpeed;                               // 0x0124(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AccelerationMultiplier;                            // 0x0128(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DefaultAcceleration;                               // 0x012C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NonBrakingFriction;                                // 0x0130(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrakingFriction;                                   // 0x0134(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrakingDeceleration;                               // 0x0138(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxSpeed;                                          // 0x013C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           SwingingTag;                                       // 0x0140(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOwnerDBNO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicBaseSwinging">();
	}
	static class UFortMovementMode_ExtLogicBaseSwinging* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicBaseSwinging>();
	}
};

// Class ContextualActionCodeRuntime.FortMovementMode_SwingingObjectRuntimeData
// 0x00C8 (0x0100 - 0x0038)
class UFortMovementMode_SwingingObjectRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_38[0xC8];                                      // 0x0038(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_SwingingObjectRuntimeData">();
	}
	static class UFortMovementMode_SwingingObjectRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_SwingingObjectRuntimeData>();
	}
};

// Class ContextualActionCodeRuntime.FortMovementMode_ExtLogicSwingingObject
// 0x0038 (0x0180 - 0x0148)
class UFortMovementMode_ExtLogicSwingingObject final : public UFortMovementMode_ExtLogicBaseSwinging
{
public:
	struct FVector                                AttachOffset;                                      // 0x0148(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                HandIKOffset;                                      // 0x0160(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAlignCharacterToObject;                           // 0x0178(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicSwingingObject">();
	}
	static class UFortMovementMode_ExtLogicSwingingObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicSwingingObject>();
	}
};

// Class ContextualActionCodeRuntime.FortMovementMode_SwingingRopeRuntimeData
// 0x0028 (0x0060 - 0x0038)
class UFortMovementMode_SwingingRopeRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_SwingingRopeRuntimeData">();
	}
	static class UFortMovementMode_SwingingRopeRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_SwingingRopeRuntimeData>();
	}
};

// Class ContextualActionCodeRuntime.FortMovementMode_ExtLogicSwingingRope
// 0x0038 (0x0180 - 0x0148)
class UFortMovementMode_ExtLogicSwingingRope final : public UFortMovementMode_ExtLogicBaseSwinging
{
public:
	class UFortInputMappingContext*               InputMappingContext;                               // 0x0148(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputAction*                           SwingingAscendAction;                              // 0x0150(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInputAction*                           SwingingAscendActionRelease;                       // 0x0158(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumAscendRange;                                // 0x0160(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendMaxSpeed;                                    // 0x0164(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DescendMaxSpeed;                                   // 0x0168(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendingSettleInterpSpeed;                        // 0x016C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendingSettleAngleThreshold;                     // 0x0170(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_174[0xC];                                      // 0x0174(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicSwingingRope">();
	}
	static class UFortMovementMode_ExtLogicSwingingRope* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicSwingingRope>();
	}
};

// Class ContextualActionCodeRuntime.FortPlayerAnimInstance_Hijacker
// 0x0000 (0x0470 - 0x0470)
class UFortPlayerAnimInstance_Hijacker final : public UFortBaseLayerAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_Hijacker">();
	}
	static class UFortPlayerAnimInstance_Hijacker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_Hijacker>();
	}
};

// Class ContextualActionCodeRuntime.FortPlayerAnimInstance_SwingingObject
// 0x0040 (0x04B0 - 0x0470)
class UFortPlayerAnimInstance_SwingingObject final : public UFortBaseLayerAnimInstance
{
public:
	struct FVector2D                              RelativeVelocity2D;                                // 0x0468(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                HandAttachLocation;                                // 0x0478(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LeftHandIKAlpha;                                   // 0x0490(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_494[0x1C];                                     // 0x0494(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerAnimInstance_SwingingObject">();
	}
	static class UFortPlayerAnimInstance_SwingingObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerAnimInstance_SwingingObject>();
	}
};

// Class ContextualActionCodeRuntime.FortSwingingObject
// 0x0050 (0x09D0 - 0x0980)
class AFortSwingingObject : public ABuildingGameplayActor
{
public:
	float                                         MaxSwingAngle;                                     // 0x0980(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseCharacterSwingMovementMode;                    // 0x0984(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanAscend;                                        // 0x0985(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_986[0x2];                                      // 0x0986(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FixedSwingDirection;                               // 0x0988(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseFixedSwingDirection;                           // 0x09A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A1[0x3];                                      // 0x09A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForwardInteractOffset;                             // 0x09A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RightInteractOffset;                               // 0x09A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseClientTransformSmoothing;                      // 0x09AC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9AD[0x3];                                      // 0x09AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothingWindow;                                   // 0x09B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9B4[0x4];                                      // 0x09B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        AttachPoint;                                       // 0x09B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C0[0x10];                                     // 0x09C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEndSwing_BP(class AFortPlayerPawn* AttachedActor);
	void OnStartSwing_BP(class AFortPlayerPawn* AttachedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSwingingObject">();
	}
	static class AFortSwingingObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortSwingingObject>();
	}
};

// Class ContextualActionCodeRuntime.FortSwingingRope
// 0x0038 (0x0A08 - 0x09D0)
class AFortSwingingRope final : public AFortSwingingObject
{
public:
	class UCableComponent*                        CableComponent;                                    // 0x09D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UnattachedCableGravityScale;                       // 0x09D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UnattachedSolverIterations;                        // 0x09DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CableLengthMultiplier;                             // 0x09E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9E4[0x24];                                     // 0x09E4(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSwingingRope">();
	}
	static class AFortSwingingRope* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortSwingingRope>();
	}
};

// Class ContextualActionCodeRuntime.HijackerComponent
// 0x00E8 (0x0190 - 0x00A8)
class UHijackerComponent final : public UFortPawnComponent
{
public:
	struct FVector                                HijackOffset;                                      // 0x00A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   StartHijackInteractText;                           // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   StartHijackInteractSubText;                        // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   CompleteHijackInteractText;                        // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   CompleteHijackInteractSubText;                     // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortPlayerAnimInstance_Hijacker> HijackerAnimInstanceClass;                   // 0x0100(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RequiredInteractionDuration;                       // 0x0108(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HijackCooldown;                                    // 0x010C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                BaseThrownVelocity;                                // 0x0110(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AccelerationThresholdForEjectingHijacker;          // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinimumSpeedForEjectingHijacker;                   // 0x012C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHijackingStatus                              HijackingStatus;                                   // 0x0130(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_131[0x5F];                                     // 0x0131(0x005F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnCleanup();
	void BP_OnCompleteHijack();
	void BP_OnHijackCancelled();
	void BP_OnHijackInterrupted();
	void BP_OnStartHijack();
	void CancelHijack_NetMulticast();
	void CancelHijack_Server();
	void EjectHijacker(class AActor* DamageCauser, const float Damage, const struct FVector& EventLocation);
	void HandleOwnerJumpInput(bool bPressed);
	void OnCompleteHijack();
	void OnStartHijack(class AActor* VehicleTarget);
	bool TryHijack(class AActor* VehicleTarget, const struct FInteractionType& InteractionType);

	void BP_CanCompleteHijack(bool* OutCanCompleteHijack) const;
	void BP_CanStartHijack(bool* OutCanStartHijack) const;
	void BP_GetThrownVelocity(class AActor* DamageCauser, const float Damage, const struct FVector& EventLocation, struct FVector* OutVelocity) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HijackerComponent">();
	}
	static class UHijackerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHijackerComponent>();
	}
};

// Class ContextualActionCodeRuntime.Hijack_InteractionOverrideComponent
// 0x0000 (0x00B0 - 0x00B0)
class UHijack_InteractionOverrideComponent final : public UFortVehicleInteractionOverrideComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Hijack_InteractionOverrideComponent">();
	}
	static class UHijack_InteractionOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHijack_InteractionOverrideComponent>();
	}
};

// Class ContextualActionCodeRuntime.RappellingComponent
// 0x07F0 (0x0898 - 0x00A8)
class URappellingComponent final : public UFortPawnComponent
{
public:
	class UInputAction*                           RappelInputAction;                                 // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           RappelEndInputAction;                              // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputMappingContext*                   RappelInputMappingContext;                         // 0x00B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ForwardTraceOffset;                                // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DownwardTraceLength;                               // 0x00C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ConnectionTraceOffset;                             // 0x00C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxDistanceToRappellingEdge;                       // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InitiateSwingAngleThreshold;                       // 0x00D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InitiateSwingSpeedThreshold;                       // 0x00D4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinDistanceFromRappelPointToSwing;                 // 0x00D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingTraceLength;                        // 0x00DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingRecoveryForce;                      // 0x00E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingLaunchSpeed;                        // 0x00E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingVerticalAttachOffset;               // 0x00E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingVerticalDistanceThresholdToSlow;    // 0x00EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingVerticalMaxSpeedWhileSlowing;       // 0x00F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingVerticalMinDistanceToAttach;        // 0x00F4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RappellingSwingVerticalMaxDistanceToAttach;        // 0x00F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           RappellingSwingParametersTag;                      // 0x00FC(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSwingingControlParams                 RappellingSwingParameters;                         // 0x0100(0x0738)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	ERappellingState                              ReplicatedRappellingState;                         // 0x0838(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RappellingEdge;                                    // 0x0840(0x0018)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                RappellingNormal;                                  // 0x0858(0x0018)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URappellingSwingMovementControls*       MovementControls;                                  // 0x0870(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_878[0x20];                                     // 0x0878(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndRappelling();
	void EndRappelling_Server();
	void EndRappellingSwing_Server();
	void OnCapsuleHit(const class UPrimitiveComponent* HitComponent, const class AActor* OtherActor, const class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnEndRappelling();
	void OnInvalidTargeting();
	void OnOwnerMovementModeChanged(class ACharacter* Character, EMovementMode PreviousMovementMode, uint8 PreviousCustomMode);
	void OnRep_RappellingState();
	void OnStartRappelling();
	void OnValidTargeting();
	void RappellingCorrectFallingRotation_Client();
	void StartRappelling();
	void StartRappelling_Server(const struct FVector& NewGravityDirection, const struct FVector& ClientRappellingEdge, const struct FVector& ClientRappellingNormal);
	void StartRappellingSwing_Server();
	void TestToggleGravity();
	void TestToggleGravity_Server();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RappellingComponent">();
	}
	static class URappellingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URappellingComponent>();
	}
};

// Class ContextualActionCodeRuntime.RappellingSwingMovementControls
// 0x0000 (0x0030 - 0x0030)
class URappellingSwingMovementControls final : public UFortMovementControls
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RappellingSwingMovementControls">();
	}
	static class URappellingSwingMovementControls* GetDefaultObj()
	{
		return GetDefaultObjImpl<URappellingSwingMovementControls>();
	}
};

// Class ContextualActionCodeRuntime.SwingingObjectCameraMode
// 0x0030 (0x1D00 - 0x1CD0)
class USwingingObjectCameraMode final : public UFortCameraMode_ThirdPerson
{
public:
	struct FVector                                MaxSwingAdditionalViewTargetOffset;                // 0x1CD0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxSwingFOV;                                       // 0x1CE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1CEC[0x14];                                    // 0x1CEC(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SwingingObjectCameraMode">();
	}
	static class USwingingObjectCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USwingingObjectCameraMode>();
	}
};

// Class ContextualActionCodeRuntime.SwingingObjectComponent
// 0x0078 (0x0120 - 0x00A8)
class USwingingObjectComponent final : public UFortPawnComponent
{
public:
	float                                         JumpHorizontalSpeedBoost;                          // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         JumpVerticalSpeedBoost;                            // 0x00AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumAscendRange;                                // 0x00B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendMaxSpeed;                                    // 0x00B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DescendMaxSpeed;                                   // 0x00B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendingSettleInterpSpeed;                        // 0x00BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AscendingSettleAngleThreshold;                     // 0x00C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumTimeBetweenRepeatSwings;                    // 0x00C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaximumAngleForAutoAttach;                         // 0x00C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinimumSpeedForAutoAttach;                         // 0x00CC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortMovementMode_BaseExtLogic> SwingingRopeMovementModeExtension;             // 0x00D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortMovementMode_BaseExtLogic> SwingingObjectMovementModeExtension;           // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESwingingState                                SwingingState;                                     // 0x00E0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AFortSwingingObject>     ReplicatedSwingingObject;                          // 0x00E4(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EC[0x34];                                      // 0x00EC(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AttachToObject_Server(class AFortSwingingObject* Object);
	void BP_OnEndSwing();
	void BP_OnStartSwing();
	void DetachFromObject_Server(bool bJumpExit);
	void HandleOwnerJumpInput(bool bPressed);
	void OnRep_SwingingObject();

	void BP_CanStartSwing(class AFortSwingingObject* SwingTarget, bool* bCanStartSwing) const;
	struct FRotator GetAimRotation() const;
	void GetSwingDeltaAngle(struct FRotator* OutSwingRotation, struct FRotator* OutDeltaRotation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SwingingObjectComponent">();
	}
	static class USwingingObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USwingingObjectComponent>();
	}
};

}

