#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContextualActionCodeRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ContextualActionCodeRuntime.FortSwingingObject.OnEndSwing_BP
// 0x0008 (0x0008 - 0x0000)
struct FortSwingingObject_OnEndSwing_BP final
{
public:
	class AFortPlayerPawn*                        AttachedActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.FortSwingingObject.OnStartSwing_BP
// 0x0008 (0x0008 - 0x0000)
struct FortSwingingObject_OnStartSwing_BP final
{
public:
	class AFortPlayerPawn*                        AttachedActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.HijackerComponent.EjectHijacker
// 0x0028 (0x0028 - 0x0000)
struct HijackerComponent_EjectHijacker final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EventLocation;                                     // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.HijackerComponent.HandleOwnerJumpInput
// 0x0001 (0x0001 - 0x0000)
struct HijackerComponent_HandleOwnerJumpInput final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.HijackerComponent.OnStartHijack
// 0x0008 (0x0008 - 0x0000)
struct HijackerComponent_OnStartHijack final
{
public:
	class AActor*                                 VehicleTarget;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.HijackerComponent.TryHijack
// 0x0058 (0x0058 - 0x0000)
struct HijackerComponent_TryHijack final
{
public:
	class AActor*                                 VehicleTarget;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractionType                       InteractionType;                                   // 0x0008(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ContextualActionCodeRuntime.HijackerComponent.BP_CanCompleteHijack
// 0x0001 (0x0001 - 0x0000)
struct HijackerComponent_BP_CanCompleteHijack final
{
public:
	bool                                          OutCanCompleteHijack;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.HijackerComponent.BP_CanStartHijack
// 0x0001 (0x0001 - 0x0000)
struct HijackerComponent_BP_CanStartHijack final
{
public:
	bool                                          OutCanStartHijack;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.HijackerComponent.BP_GetThrownVelocity
// 0x0040 (0x0040 - 0x0000)
struct HijackerComponent_BP_GetThrownVelocity final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EventLocation;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutVelocity;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.RappellingComponent.OnCapsuleHit
// 0x0120 (0x0120 - 0x0000)
struct RappellingComponent_OnCapsuleHit final
{
public:
	const class UPrimitiveComponent*              HitComponent;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           OtherActor;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UPrimitiveComponent*              OtherComp;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.RappellingComponent.OnOwnerMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct RappellingComponent_OnOwnerMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PreviousMovementMode;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ContextualActionCodeRuntime.RappellingComponent.StartRappelling_Server
// 0x0048 (0x0048 - 0x0000)
struct RappellingComponent_StartRappelling_Server final
{
public:
	struct FVector                                NewGravityDirection;                               // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClientRappellingEdge;                              // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClientRappellingNormal;                            // 0x0030(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.SwingingObjectComponent.AttachToObject_Server
// 0x0008 (0x0008 - 0x0000)
struct SwingingObjectComponent_AttachToObject_Server final
{
public:
	class AFortSwingingObject*                    Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.SwingingObjectComponent.DetachFromObject_Server
// 0x0001 (0x0001 - 0x0000)
struct SwingingObjectComponent_DetachFromObject_Server final
{
public:
	bool                                          bJumpExit;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.SwingingObjectComponent.HandleOwnerJumpInput
// 0x0001 (0x0001 - 0x0000)
struct SwingingObjectComponent_HandleOwnerJumpInput final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.SwingingObjectComponent.BP_CanStartSwing
// 0x0010 (0x0010 - 0x0000)
struct SwingingObjectComponent_BP_CanStartSwing final
{
public:
	class AFortSwingingObject*                    SwingTarget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanStartSwing;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ContextualActionCodeRuntime.SwingingObjectComponent.GetAimRotation
// 0x0018 (0x0018 - 0x0000)
struct SwingingObjectComponent_GetAimRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function ContextualActionCodeRuntime.SwingingObjectComponent.GetSwingDeltaAngle
// 0x0030 (0x0030 - 0x0000)
struct SwingingObjectComponent_GetSwingDeltaAngle final
{
public:
	struct FRotator                               OutSwingRotation;                                  // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               OutDeltaRotation;                                  // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

}

