#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticsFrameworkItems

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct CosmeticsFrameworkItems.CosmeticPropertyBase
// 0x0004 (0x0004 - 0x0000)
struct FCosmeticPropertyBase
{
public:
	struct FGameplayTag                           PropertyTag;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsFrameworkItems.CosmeticProperty_Vector
// 0x001C (0x0020 - 0x0004)
struct FCosmeticProperty_Vector final : public FCosmeticPropertyBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Value;                                             // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsFrameworkItems.CosmeticProperty_TableRow
// 0x0014 (0x0018 - 0x0004)
struct FCosmeticProperty_TableRow final : public FCosmeticPropertyBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    TableRow;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct CosmeticsFrameworkItems.CosmeticProperty_GameplayTag
// 0x0004 (0x0008 - 0x0004)
struct FCosmeticProperty_GameplayTag final : public FCosmeticPropertyBase
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

