#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_AudioMixerRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CRD_AudioMixerRuntime.CreativeAudioMixerDevice.OnPlayerAdded
// 0x0038 (0x0038 - 0x0000)
struct CreativeAudioMixerDevice_OnPlayerAdded final
{
public:
	struct FUniqueNetIdRepl                       NetId;                                             // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalPlayer;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CRD_AudioMixerRuntime.CreativeAudioMixerDevice.OnPlayerRegistered
// 0x0008 (0x0008 - 0x0000)
struct CreativeAudioMixerDevice_OnPlayerRegistered final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CRD_AudioMixerRuntime.CreativeAudioMixerDevice.OnPlayerUnregistered
// 0x0008 (0x0008 - 0x0000)
struct CreativeAudioMixerDevice_OnPlayerUnregistered final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CRD_AudioMixerRuntime.CreativeAudioMixerDevice.OnProxyDataChanged
// 0x0008 (0x0008 - 0x0000)
struct CreativeAudioMixerDevice_OnProxyDataChanged final
{
public:
	class ACreativePlayerReplicationProxy*        ProxyData;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

