#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_CinematicSequence

#include "Basic.hpp"

#include "CRD_CinematicSequence_structs.hpp"
#include "MovieScene_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class CRD_CinematicSequence.CinematicSequenceDeviceBase
// 0x00C0 (0x0C90 - 0x0BD0)
class ACinematicSequenceDeviceBase final : public ABuildingProp
{
public:
	uint8                                         Pad_BD0[0x50];                                     // 0x0BD0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         Sequence;                                          // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0C28(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerController*                  InstigatingController;                             // 0x0C30(0x0008)(BlueprintVisible, Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         InstigatingTeam;                                   // 0x0C38(0x0001)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C39[0x3];                                      // 0x0C39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bLoopPlayback : 1;                                 // 0x0C3C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAutoPlay : 1;                                     // 0x0C3C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_C3D[0x3];                                      // 0x0C3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ECinematicSequenceEnabledOnPhase              EnabledOnPhase;                                    // 0x0C40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECinematicSequenceVisibility                  Visibility;                                        // 0x0C41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLevelSequenceActorAlwaysRelevant;                 // 0x0C42(0x0001)(Edit, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C43[0x1];                                      // 0x0C43(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0C44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMovieSceneCompletionModeOverride             FinishCompletionStateOverride;                     // 0x0C48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C49[0x47];                                     // 0x0C49(0x0047)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GoToEndAndStop();
	void HandleSequencePlayerCreated(class ULevelSequencePlayer* Player);
	void OnSequenceFinished();
	void Pause();
	void Play();
	void PlayReverse();
	void SetPlaybackFrame(int32 Frame);
	void SetPlaybackTime(float Time);
	void SetPlayRate(float PlayRate_0);
	void SetSequence(class ULevelSequence* Sequence_0);
	void Stop();

	int32 GetPlaybackFrame() const;
	float GetPlaybackTime() const;
	float GetPlayRate() const;
	class UMovieSceneSequencePlayer* GetSequencePlayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CinematicSequenceDeviceBase">();
	}
	static class ACinematicSequenceDeviceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACinematicSequenceDeviceBase>();
	}
};

}

