#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_AudioMixerRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class CRD_AudioMixerRuntime.CreativeAudioMixerDevice
// 0x0090 (0x0C70 - 0x0BE0)
class ACreativeAudioMixerDevice final : public AFortCreativeDeviceProp
{
public:
	uint8                                         Pad_BE0[0x8];                                      // 0x0BE0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundControlBusMix*                    Mix;                                               // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundControlBus*                       Bus;                                               // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FaderValue;                                        // 0x0BF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECreativeRegisteredPlayerGroups               CanBeHeardBy;                                      // 0x0BFC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivateInEditMode;                               // 0x0BFD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivateOnGameStart;                              // 0x0BFE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BFF[0x1];                                      // 0x0BFF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreativeProxyManagerComponent*         CreativeProxyManagerComponent;                     // 0x0C00(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortMinigameProgressComponent*         FortMinigameProgressComponent;                     // 0x0C08(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCreativeRegisteredPlayersManagerComponent* CreativeRegisteredPlayersManagerComponent;     // 0x0C10(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortActorOptionsComponent*             FortActorOptionsComponent;                         // 0x0C18(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCachedIsActive;                                   // 0x0C20(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C21[0x7];                                      // 0x0C21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CachedInstigator;                                  // 0x0C28(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ACreativeAudioMixerReplicationProxy*    ClientCachedProxy;                                 // 0x0C30(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundControlBusMix*                    CachedBusMix;                                      // 0x0C38(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CachedBusMixName;                                  // 0x0C40(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C44[0x4];                                      // 0x0C44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUniqueNetIdRepl>               RegisteredPlayerIds;                               // 0x0C48(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FUniqueNetIdRepl>               NonRegisteredPlayerIds;                            // 0x0C58(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	bool                                          bHasUpdatedStateInEditMode;                        // 0x0C68(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasUpdatedStateInGameplay;                        // 0x0C69(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C6A[0x6];                                      // 0x0C6A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateMix();
	void DeactivateMix();
	void OnAllPlayersUnregistered();
	void OnMinigameEnded();
	void OnMinigameStarted();
	void OnPlayerAdded(const struct FUniqueNetIdRepl& NetId, bool bIsLocalPlayer);
	void OnPlayerRegistered(const class AFortPlayerState* PlayerState);
	void OnPlayerUnregistered(const class AFortPlayerState* PlayerState);
	void OnPreAnyPropertyChanged();
	void OnProxyDataChanged(class ACreativePlayerReplicationProxy* ProxyData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeAudioMixerDevice">();
	}
	static class ACreativeAudioMixerDevice* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeAudioMixerDevice>();
	}
};

// Class CRD_AudioMixerRuntime.CreativeAudioMixerReplicationProxy
// 0x0008 (0x02A0 - 0x0298)
class ACreativeAudioMixerReplicationProxy final : public ACreativePlayerReplicationProxy
{
public:
	bool                                          bIsActive;                                         // 0x0298(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeAudioMixerReplicationProxy">();
	}
	static class ACreativeAudioMixerReplicationProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACreativeAudioMixerReplicationProxy>();
	}
};

}

