#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRD_VideoSchedule

#include "Basic.hpp"

#include "CRD_VideoSchedule_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class CRD_VideoSchedule.VideoScheduleDeviceBase
// 0x0108 (0x0CD8 - 0x0BD0)
class AVideoScheduleDeviceBase final : public ABuildingProp
{
public:
	uint8                                         Pad_BD0[0x48];                                     // 0x0BD0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	EVideoScheduleDeviceRepeat                    RepeatSchedule;                                    // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C19[0x7];                                      // 0x0C19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVideoScheduleDeviceEntryAbsolute> AbsoluteSchedule;                               // 0x0C20(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVideoScheduleDeviceEntryDaily> DailySchedule;                                     // 0x0C30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVideoScheduleDeviceEntryHourly> HourlySchedule;                                   // 0x0C40(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	bool                                          bFillSchedule;                                     // 0x0C50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C51[0x3];                                      // 0x0C51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FillScheduleGap;                                   // 0x0C54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FillScheduleAlign;                                 // 0x0C58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C5C[0x4];                                      // 0x0C5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SimpleSchedule;                                    // 0x0C60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C70[0x68];                                     // 0x0C70(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnControlVideoPlayer(const class FString& VUID, const struct FDateTime& StartTime, const TArray<class AController*>& Players, const class ULevelSequence* Sequence);
	void StartSchedule(class AController* InPlayer);
	void StopSchedule(class AController* InPlayer);
	void TestControlVideoPlayer(const class FString& VUID, const struct FDateTime& StartTime, const TArray<class AController*>& Players);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VideoScheduleDeviceBase">();
	}
	static class AVideoScheduleDeviceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVideoScheduleDeviceBase>();
	}
};

}

