#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CRDPostProcess

#include "Basic.hpp"

#include "NetCore_structs.hpp"


namespace SDK
{

// Enum CRDPostProcess.EPostProcessDeviceState
// NumValues: 0x0007
enum class EPostProcessDeviceState : uint8
{
	Reset                                    = 0,
	Enable                                   = 1,
	Disable                                  = 2,
	BlendIn                                  = 3,
	BlendOut                                 = 4,
	LateApplication                          = 5,
	EPostProcessDeviceState_MAX              = 6,
};

// ScriptStruct CRDPostProcess.PostProcessDeviceMessage
// 0x0018 (0x0018 - 0x0000)
struct FPostProcessDeviceMessage final
{
public:
	class AFortCreativeDeviceProp*                PostProcessDevice;                                 // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                       PlayerStateMessage;                                // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPostProcessDeviceState                       EndState;                                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CRDPostProcess.PostProcessDeviceMessageRepl
// 0x001C (0x0028 - 0x000C)
struct FPostProcessDeviceMessageRepl final : public FFastArraySerializerItem
{
public:
	int32                                         MessageIndex;                                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortCreativeDeviceProp*                PostProcessDevice;                                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                       PlayerStateMessage;                                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPostProcessDeviceState                       EndState;                                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct CRDPostProcess.PostProcessDeviceMessageRingBuffer
// 0x0028 (0x0130 - 0x0108)
struct FPostProcessDeviceMessageRingBuffer final : public FFastArraySerializer
{
public:
	TArray<struct FPostProcessDeviceMessageRepl>  Items;                                             // 0x0108(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x18];                                     // 0x0118(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

