#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeVideoPlayerRuntime

#include "Basic.hpp"

#include "CreativeVideoPlayerRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CreativeVideoPlayerRuntime.CreativeVideoPlayerFullscreenGameplayAbility
// 0x0080 (0x0BC0 - 0x0B40)
class UCreativeVideoPlayerFullscreenGameplayAbility final : public UFortGameplayAbility
{
public:
	TSubclassOf<class UGameplayEffect>            NoCollisionGameplayEffectClass;                    // 0x0B40(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            NoDamageGameplayEffectClass;                       // 0x0B48(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayEffect>>    AnimationStateGameplayEffectClasses;               // 0x0B50(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                FullscreenWidgetClass;                             // 0x0B60(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECreativeVideoPlayerFullscreenEffects         FullscreenEffects;                                 // 0x0B68(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPromptToConfirmFullscreen;                        // 0x0B69(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDismissable;                                    // 0x0B6A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B6B[0x5];                                      // 0x0B6B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInputComponent*                    OverrideMovementInputComponent;                    // 0x0B70(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortInputComponent*                    SelectFullscreenModeInputComponent;                // 0x0B78(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FActiveGameplayEffectHandle>    ActiveGameplayEffects;                             // 0x0B80(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	ECreativeVideoPlayerFullscreenEffects         RequestedFullscreenEffects;                        // 0x0B90(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B91[0x7];                                      // 0x0B91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            VideoPlayerWidget;                                 // 0x0B98(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaTexture*                          ExtMediaTextureCached;                             // 0x0BA0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundSourceBus*                        ExtSourceBusCached;                                // 0x0BA8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaSoundComponent*                   ExtMediaSoundComponentCached;                      // 0x0BB0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bExtComponentsSet;                                 // 0x0BB8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bActivatedFullscreen;                              // 0x0BB9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BBA[0x6];                                      // 0x0BBA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientLeaveFullscreenVideo();
	void ClientTransitionToFullscreenVideo();
	void EnterFullscreenState();
	void EnterFullscreenStateWithOptions(const struct FCreativeVideoPlayerFullscreenOptions& Options);
	void ExitFullscreenState();
	void HandleEnterFullscreenActionPressed();
	void HandleEnterFullscreenActionReleased();
	void OnFullscreenUIEnds();
	void ServerEnterFullscreenMode();
	void ServerLeaveFullscreenMode();
	void SetExternalComponents(class UMediaTexture* ExtMediaTexture, class USoundSourceBus* ExtSourceBus, class UMediaSoundComponent* ExtMediaSoundComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeVideoPlayerFullscreenGameplayAbility">();
	}
	static class UCreativeVideoPlayerFullscreenGameplayAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeVideoPlayerFullscreenGameplayAbility>();
	}
};

// Class CreativeVideoPlayerRuntime.CreativeVideoPlayerFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UCreativeVideoPlayerFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ShutdownFullscreenVideoMode(class AController* Controller);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeVideoPlayerFunctionLibrary">();
	}
	static class UCreativeVideoPlayerFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeVideoPlayerFunctionLibrary>();
	}
};

// Class CreativeVideoPlayerRuntime.CreativeVideoPlayerWorldSubsystem
// 0x0010 (0x0040 - 0x0030)
class UCreativeVideoPlayerWorldSubsystem final : public UWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(class APlayerController* TargetPlayer, bool bIsClosing)> OnNotifyFullscreenChange; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeVideoPlayerWorldSubsystem">();
	}
	static class UCreativeVideoPlayerWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeVideoPlayerWorldSubsystem>();
	}
};

}

