#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeLowMemoryFallbackRuntime

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct CreativeLowMemoryFallbackRuntime.CreativeLowMemoryFallbackUserFacingText
// 0x0030 (0x0030 - 0x0000)
struct FCreativeLowMemoryFallbackUserFacingText final
{
public:
	class FText                                   ExitToMainMenuReasonText;                          // 0x0000(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   WarningToastTitle;                                 // 0x0010(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   WarningToastDescription;                           // 0x0020(0x0010)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct CreativeLowMemoryFallbackRuntime.CreativeLowMemoryFallbackFreeMemoryThresholds
// 0x000C (0x000C - 0x0000)
struct FCreativeLowMemoryFallbackFreeMemoryThresholds final
{
public:
	float                                         FallbackMB;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarningMB;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecoveryMB;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

