#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeVideoPlayerUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class CreativeVideoPlayerUI.CreativeVideoPlayerFullScreenWidget
// 0x0078 (0x0470 - 0x03F8)
class UCreativeVideoPlayerFullScreenWidget final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x18];                                     // 0x03F8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSourceBus*                        SourceBus;                                         // 0x0410(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundClass*                            SoundClass;                                        // 0x0418(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    HoldToSkipAction;                                  // 0x0420(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_Skip;                                       // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_VideoTexture;                                // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SkipButtonTimeout;                                 // 0x0440(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_444[0x14];                                     // 0x0444(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SoundComponent;                                    // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_460[0x10];                                     // 0x0460(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSkipButtonActionComplete();
	void OnSkipButtonActionProgress(float HeldPercent);
	void SetExternalComponents(class UMediaTexture* VideoTextureExt, class USoundSourceBus* ExtSourceBus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CreativeVideoPlayerFullScreenWidget">();
	}
	static class UCreativeVideoPlayerFullScreenWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeVideoPlayerFullScreenWidget>();
	}
};

}

