#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableObject

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CustomizableObject_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class CustomizableObject.CustomizableObjectExtension
// 0x0000 (0x0028 - 0x0028)
class UCustomizableObjectExtension final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectExtension">();
	}
	static class UCustomizableObjectExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectExtension>();
	}
};

// Class CustomizableObject.CustomizableObjectInstanceUserData
// 0x0030 (0x0058 - 0x0028)
class UCustomizableObjectInstanceUserData final : public UAssetUserData
{
public:
	struct FGameplayTagContainer                  AnimationGameplayTag;                              // 0x0028(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectAnimationSlot> AnimationSlots;                                  // 0x0048(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void SetAnimationGameplayTags(const struct FGameplayTagContainer& InstanceTags);

	const struct FGameplayTagContainer GetAnimationGameplayTags() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectInstanceUserData">();
	}
	static class UCustomizableObjectInstanceUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectInstanceUserData>();
	}
};

// Class CustomizableObject.CustomizableInstancePrivate
// 0x03A0 (0x03C8 - 0x0028)
class UCustomizableInstancePrivate final : public UObject
{
public:
	TArray<class USkeletalMesh*>                  SkeletalMeshes;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FGeneratedMaterial>             GeneratedMaterials;                                // 0x0038(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FGeneratedTexture>              GeneratedTextures;                                 // 0x0048(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, TWeakObjectPtr<class UTexture2D>> TextureReuseCache;                         // 0x0068(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x28];                                      // 0x00B8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCustomizableInstanceComponentData> ComponentsData;                                // 0x00E0(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             ReferencedMaterials;                               // 0x00F0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x60];                                     // 0x0100(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicsAsset*>                  ClothingPhysicsAssets;                             // 0x0160(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UAnimInstance>>      GatheredAnimBPs;                                   // 0x0170(0x0010)(Edit, EditFixedSize, ZeroConstructor, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AnimBPGameplayTags;                                // 0x0180(0x0020)(Edit, EditFixedSize, Transient, EditConst, NativeAccessSpecifierPublic)
	TMap<TSubclassOf<class UAnimInstance>, struct FAnimBpGeneratedPhysicsAssets> AnimBpPhysicsAssets; // 0x01A0(0x0050)(Edit, EditFixedSize, Transient, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F0[0x10];                                     // 0x01F0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture*>                       LoadedPassThroughTexturesPendingSetMaterial;       // 0x0200(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_210[0x8];                                      // 0x0210(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizableObjectInstanceDescriptor  CommittedDescriptor;                               // 0x0218(0x0128)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_340[0x88];                                     // 0x0340(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableInstancePrivate">();
	}
	static class UCustomizableInstancePrivate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableInstancePrivate>();
	}
};

// Class CustomizableObject.CustomizableObjectInstanceUsage
// 0x0040 (0x0068 - 0x0028)
class UCustomizableObjectInstanceUsage final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkippedLastRenderTime;                             // 0x0030(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x14];                                      // 0x0034(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizableSkeletalComponent*         CustomizableSkeletalComponent;                     // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class USkeletalMeshComponent>  UsedSkeletalMeshComponent;                         // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomizableObjectInstance*            UsedCustomizableObjectInstance;                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         UsedComponentIndex;                                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateSkeletalMeshAsync(bool bNeverSkipUpdate);
	void UpdateSkeletalMeshAsyncResult(TDelegate<void(const struct FUpdateContext& Result)> Callback, bool bIgnoreCloseDist, bool bForceHighPriority);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectInstanceUsage">();
	}
	static class UCustomizableObjectInstanceUsage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectInstanceUsage>();
	}
};

// Class CustomizableObject.CustomizableObjectPrivate
// 0x03F8 (0x0420 - 0x0028)
class UCustomizableObjectPrivate final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModelResources                        ModelResources;                                    // 0x0038(0x02C0)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F8[0xC8];                                     // 0x02F8(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMutableModelParameterProperties> ParameterProperties;                             // 0x03C0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D0[0x50];                                     // 0x03D0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectPrivate">();
	}
	static class UCustomizableObjectPrivate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectPrivate>();
	}
};

// Class CustomizableObject.CustomizableObjectResourceDataContainer
// 0x0018 (0x0040 - 0x0028)
class UCustomizableObjectResourceDataContainer final : public UObject
{
public:
	struct FCustomizableObjectResourceData        Data;                                              // 0x0028(0x0018)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectResourceDataContainer">();
	}
	static class UCustomizableObjectResourceDataContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectResourceDataContainer>();
	}
};

// Class CustomizableObject.CustomizableObjectSettings
// 0x0008 (0x0030 - 0x0028)
class UCustomizableObjectSettings final : public UObject
{
public:
	bool                                          bEnableStreamingManager;                           // 0x0028(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectSettings">();
	}
	static class UCustomizableObjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectSettings>();
	}
};

// Class CustomizableObject.CustomizableObjectSkeletalMesh
// 0x0050 (0x0578 - 0x0528)
class UCustomizableObjectSkeletalMesh final : public USkeletalMesh
{
public:
	uint8                                         Pad_528[0x50];                                     // 0x0528(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectSkeletalMesh">();
	}
	static class UCustomizableObjectSkeletalMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectSkeletalMesh>();
	}
};

// Class CustomizableObject.CustomizableObjectSystemPrivate
// 0x05A8 (0x05D0 - 0x0028)
class alignas(0x10) UCustomizableObjectSystemPrivate final : public UObject
{
public:
	uint8                                         Pad_28[0x1E0];                                     // 0x0028(0x01E0)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizableObjectInstance*            CurrentInstanceBeingUpdated;                       // 0x0208(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_210[0x2A0];                                    // 0x0210(0x02A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPendingReleaseSkeletalMeshInfo> PendingReleaseSkeletalMesh;                       // 0x04B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UCustomizableInstanceLODManagementBase* DefaultInstanceLODManagement;                      // 0x04C0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomizableInstanceLODManagementBase* CurrentInstanceLODManagement;                      // 0x04C8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     ProtectedCachedTextures;                           // 0x04D0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E0[0xF0];                                     // 0x04E0(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectSystemPrivate">();
	}
	static class UCustomizableObjectSystemPrivate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectSystemPrivate>();
	}
};

// Class CustomizableObject.CustomizableSkeletalComponent
// 0x0030 (0x0250 - 0x0220)
class UCustomizableSkeletalComponent final : public USceneComponent
{
public:
	class UCustomizableObjectInstance*            CustomizableObjectInstance;                        // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentIndex;                                    // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x14];                                     // 0x022C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizableObjectInstanceUsage*       CustomizableObjectInstanceUsage;                   // 0x0240(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateSkeletalMeshAsync(bool bNeverSkipUpdate);
	void UpdateSkeletalMeshAsyncResult(TDelegate<void(const struct FUpdateContext& Result)> Callback, bool bIgnoreCloseDist, bool bForceHighPriority);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableSkeletalComponent">();
	}
	static class UCustomizableSkeletalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableSkeletalComponent>();
	}
};

// Class CustomizableObject.CustomizableSystemImageProvider
// 0x0000 (0x0028 - 0x0028)
class UCustomizableSystemImageProvider : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableSystemImageProvider">();
	}
	static class UCustomizableSystemImageProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableSystemImageProvider>();
	}
};

// Class CustomizableObject.EditorImageProvider
// 0x0000 (0x0028 - 0x0028)
class UEditorImageProvider final : public UCustomizableSystemImageProvider
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorImageProvider">();
	}
	static class UEditorImageProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorImageProvider>();
	}
};

// Class CustomizableObject.CustomizableInstanceLODManagementBase
// 0x0000 (0x0028 - 0x0028)
class UCustomizableInstanceLODManagementBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableInstanceLODManagementBase">();
	}
	static class UCustomizableInstanceLODManagementBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableInstanceLODManagementBase>();
	}
};

// Class CustomizableObject.CustomizableInstanceLODManagement
// 0x0058 (0x0080 - 0x0028)
class UCustomizableInstanceLODManagement final : public UCustomizableInstanceLODManagementBase
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableInstanceLODManagement">();
	}
	static class UCustomizableInstanceLODManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableInstanceLODManagement>();
	}
};

// Class CustomizableObject.CustomizableObjectBulk
// 0x0010 (0x0038 - 0x0028)
class UCustomizableObjectBulk final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectBulk">();
	}
	static class UCustomizableObjectBulk* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectBulk>();
	}
};

// Class CustomizableObject.CustomizableObject
// 0x0138 (0x0160 - 0x0028)
class UCustomizableObject final : public UObject
{
public:
	struct FMutableLODSettings                    LODSettings;                                       // 0x0028(0x0070)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectResourceData> AlwaysLoadedExtensionData;                        // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectStreamedResourceData> StreamedExtensionData;                    // 0x00A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectStreamedResourceData> StreamedResourceData;                     // 0x00B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bEnableUseRefSkeletalMeshAsPlaceholder;            // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreserveUserLODsOnFirstGeneration;                // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMeshCache;                                  // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMeshStreaming;                              // 0x00CB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           LowPriorityTextures;                               // 0x00D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FString>                         CustomizableObjectClassTags;                       // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FString>                         PopulationClassTags;                               // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class FString, struct FParameterTags>    CustomizableObjectParametersTags;                  // 0x0100(0x0050)(NativeAccessSpecifierPrivate)
	class UCustomizableObjectBulk*                BulkData;                                          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomizableObjectPrivate*             Private;                                           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UCustomizableObjectInstance* CreateInstance();

	int32 FindParameter(const class FString& Name_0) const;
	bool GetBoolParameterDefaultValue(const class FString& InParameterName) const;
	struct FLinearColor GetColorParameterDefaultValue(const class FString& InParameterName) const;
	int32 GetComponentCount() const;
	float GetFloatParameterDefaultValue(const class FString& InParameterName) const;
	class FString GetIntParameterAvailableOption(int32 ParamIndex, int32 K) const;
	int32 GetIntParameterDefaultValue(const class FString& InParameterName) const;
	ECustomizableObjectGroupType GetIntParameterGroupType(const class FString& ParamName) const;
	int32 GetIntParameterNumOptions(int32 ParamIndex) const;
	struct FMutableParamUIMetadata GetIntParameterOptionUIMetadata(const class FString& ParamName, const class FString& OptionName) const;
	int32 GetParameterCount() const;
	int32 GetParameterDescriptionCount(const class FString& ParamName) const;
	class FString GetParameterName(int32 ParamIndex) const;
	EMutableParameterType GetParameterType(int32 ParamIndex) const;
	EMutableParameterType GetParameterTypeByName(const class FString& Name_0) const;
	struct FMutableParamUIMetadata GetParameterUIMetadata(const class FString& ParamName) const;
	void GetProjectorParameterDefaultValue(const class FString& InParameterName, struct FVector3f* OutPos, struct FVector3f* OutDirection, struct FVector3f* OutUp, struct FVector3f* OutScale, float* OutAngle, ECustomizableObjectProjectorType* OutType) const;
	int32 GetStateCount() const;
	class FString GetStateName(int32 StateIndex) const;
	int32 GetStateParameterCount(const class FString& StateName) const;
	class FString GetStateParameterName(const class FString& StateName, int32 ParameterIndex) const;
	struct FMutableStateUIMetadata GetStateUIMetadata(const class FString& StateName) const;
	bool IsCompiled() const;
	bool IsParameterMultidimensional(const class FString& InParameterName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObject">();
	}
	static class UCustomizableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObject>();
	}
};

// Class CustomizableObject.DGGUI
// 0x0000 (0x02B8 - 0x02B8)
class UDGGUI final : public UUserWidget
{
public:
	class UCustomizableObjectInstanceUsage* GetCustomizableObjectInstanceUsage();
	void SetCustomizableObjectInstanceUsage(class UCustomizableObjectInstanceUsage* CustomizableObjectInstanceUsage);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DGGUI">();
	}
	static class UDGGUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDGGUI>();
	}
};

// Class CustomizableObject.CustomizableObjectInstance
// 0x0218 (0x0240 - 0x0028)
class UCustomizableObjectInstance final : public UObject
{
public:
	TMulticastInlineDelegate<void(class UCustomizableObjectInstance* Instance)> UpdatedDelegate;     // 0x0028(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizableObjectInstanceDescriptor  Descriptor;                                        // 0x0050(0x0128)(NativeAccessSpecifierPrivate)
	class UCustomizableInstancePrivate*           PrivateData;                                       // 0x0178(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCustomizableObject*                    CustomizableObject;                                // 0x0180(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectBoolParameterValue> BoolParameters;                             // 0x0188(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectIntParameterValue> IntParameters;                               // 0x0198(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectFloatParameterValue> FloatParameters;                           // 0x01A8(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectTextureParameterValue> TextureParameters;                       // 0x01B8(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectVectorParameterValue> VectorParameters;                         // 0x01C8(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FCustomizableObjectProjectorParameterValue> ProjectorParameters;                   // 0x01D8(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMultilayerProjector> MultilayerProjectors;                             // 0x01E8(0x0050)(Deprecated, NativeAccessSpecifierPrivate)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 AddValueToFloatRange(const class FString& ParamName);
	int32 AddValueToIntRange(const class FString& ParamName);
	int32 AddValueToProjectorRange(const class FString& ParamName);
	class UCustomizableObjectInstance* Clone();
	class UCustomizableObjectInstance* CloneStatic(class UObject* Outer_0);
	bool CreateMultiLayerProjector(const class FName& ProjectorParamName);
	void MultilayerProjectorCreateLayer(const class FName& ProjectorParamName, int32 Index_0);
	void MultilayerProjectorCreateVirtualLayer(const class FName& ProjectorParamName, const class FName& ID);
	struct FMultilayerProjectorVirtualLayer MultilayerProjectorFindOrCreateVirtualLayer(const class FName& ProjectorParamName, const class FName& ID);
	void MultilayerProjectorRemoveLayerAt(const class FName& ProjectorParamName, int32 Index_0);
	void MultilayerProjectorRemoveVirtualLayer(const class FName& ProjectorParamName, const class FName& ID);
	void MultilayerProjectorUpdateLayer(const class FName& ProjectorParamName, int32 Index_0, const struct FMultilayerProjectorLayer& Layer);
	void MultilayerProjectorUpdateVirtualLayer(const class FName& ProjectorParamName, const class FName& ID, const struct FMultilayerProjectorVirtualLayer& Layer);
	void RemoveMultilayerProjector(const class FName& ProjectorParamName);
	int32 RemoveValueFromFloatRange(const class FString& ParamName);
	int32 RemoveValueFromIntRange(const class FString& ParamName);
	int32 RemoveValueFromProjectorRange(const class FString& ParamName);
	void SetBoolParameterSelectedOption(const class FString& BoolParamName, bool BoolValue);
	void SetBuildParameterRelevancy(bool Value);
	void SetColorParameterSelectedOption(const class FString& ColorParamName, const struct FLinearColor& ColorValue);
	void SetCurrentState(const class FString& StateName);
	void SetDefaultValues();
	void SetFloatParameterSelectedOption(const class FString& FloatParamName, float FloatValue, int32 RangeIndex);
	void SetIntParameterSelectedOption(const class FString& ParamName, const class FString& SelectedOptionName, int32 RangeIndex);
	void SetObject(class UCustomizableObject* InObject);
	void SetProjectorAngle(const class FString& ProjectorParamName, float Angle, int32 RangeIndex);
	void SetProjectorDirection(const class FString& ProjectorParamName, const struct FVector& Direction, int32 RangeIndex);
	void SetProjectorPosition(const class FString& ProjectorParamName, const struct FVector& Pos, int32 RangeIndex);
	void SetProjectorScale(const class FString& ProjectorParamName, const struct FVector& Scale, int32 RangeIndex);
	void SetProjectorUp(const class FString& ProjectorParamName, const struct FVector& Up, int32 RangeIndex);
	void SetProjectorValue(const class FString& ProjectorParamName, const struct FVector& OutPos, const struct FVector& OutDirection, const struct FVector& OutUp, const struct FVector& OutScale, float OutAngle, int32 RangeIndex);
	void SetRandomValues();
	void SetRandomValuesFromStream(const struct FRandomStream& InStream);
	void SetReplacePhysicsAssets(bool bReplaceEnabled);
	void SetTextureParameterSelectedOption(const class FString& TextureParamName, const class FString& TextureValue, int32 RangeIndex);
	void SetVectorParameterSelectedOption(const class FString& VectorParamName, const struct FLinearColor& VectorValue);
	void UpdateSkeletalMeshAsync(bool bIgnoreCloseDist, bool bForceHighPriority);
	void UpdateSkeletalMeshAsyncResult(TDelegate<void(const struct FUpdateContext& Result)> Callback, bool bIgnoreCloseDist, bool bForceHighPriority);

	int32 FindBoolParameterNameIndex(const class FString& ParamName) const;
	int32 FindFloatParameterNameIndex(const class FString& ParamName) const;
	int32 FindIntParameterNameIndex(const class FString& ParamName) const;
	int32 FindProjectorParameterNameIndex(const class FString& ParamName) const;
	int32 FindVectorParameterNameIndex(const class FString& ParamName) const;
	void ForEachAnimInstance(int32 ComponentIndex, TDelegate<void(class FName SlotIndex, TSubclassOf<class UAnimInstance> AnimInstClass)> Delegate) const;
	const struct FGameplayTagContainer GetAnimationGameplayTags() const;
	TSubclassOf<class UAnimInstance> GetAnimBP(int32 ComponentIndex, const class FName& Slot) const;
	bool GetBoolParameterSelectedOption(const class FString& BoolParamName) const;
	bool GetBuildParameterRelevancy() const;
	struct FLinearColor GetColorParameterSelectedOption(const class FString& ColorParamName) const;
	class FString GetCurrentState() const;
	class UCustomizableObject* GetCustomizableObject() const;
	float GetFloatParameterSelectedOption(const class FString& FloatParamName, int32 RangeIndex) const;
	int32 GetFloatValueRange(const class FString& ParamName) const;
	class FString GetIntParameterSelectedOption(const class FString& ParamName, int32 RangeIndex) const;
	int32 GetIntValueRange(const class FString& ParamName) const;
	TSet<class UAssetUserData*> GetMergedAssetUserData(int32 ComponentIndex) const;
	int32 GetNumComponents() const;
	float GetProjectorAngle(const class FString& ParamName, int32 RangeIndex) const;
	struct FVector GetProjectorDirection(const class FString& ParamName, int32 RangeIndex) const;
	ECustomizableObjectProjectorType GetProjectorParameterType(const class FString& ParamName, int32 RangeIndex) const;
	struct FVector GetProjectorPosition(const class FString& ParamName, int32 RangeIndex) const;
	struct FVector GetProjectorScale(const class FString& ParamName, int32 RangeIndex) const;
	struct FVector GetProjectorUp(const class FString& ParamName, int32 RangeIndex) const;
	void GetProjectorValue(const class FString& ProjectorParamName, struct FVector* OutPos, struct FVector* OutDirection, struct FVector* OutUp, struct FVector* OutScale, float* OutAngle, ECustomizableObjectProjectorType* OutType, int32 RangeIndex) const;
	int32 GetProjectorValueRange(const class FString& ParamName) const;
	class USkeletalMesh* GetSkeletalMesh(int32 ComponentIndex) const;
	class FName GetTextureParameterSelectedOption(const class FString& TextureParamName, int32 RangeIndex) const;
	int32 GetTextureValueRange(const class FString& ParamName) const;
	bool HasAnyParameters() const;
	bool HasAnySkeletalMesh() const;
	bool IsParameterDirty(const class FString& ParamName, int32 RangeIndex) const;
	bool IsParameterRelevant(const class FString& ParamName) const;
	struct FMultilayerProjectorLayer MultilayerProjectorGetLayer(const class FName& ProjectorParamName, int32 Index_0) const;
	struct FMultilayerProjectorVirtualLayer MultilayerProjectorGetVirtualLayer(const class FName& ProjectorParamName, const class FName& ID) const;
	TArray<class FName> MultilayerProjectorGetVirtualLayers(const class FName& ProjectorParamName) const;
	int32 MultilayerProjectorNumLayers(const class FName& ProjectorParamName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectInstance">();
	}
	static class UCustomizableObjectInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectInstance>();
	}
};

// Class CustomizableObject.MutableTextureMipDataProviderFactory
// 0x0028 (0x0050 - 0x0028)
class UMutableTextureMipDataProviderFactory final : public UTextureMipDataProviderFactory
{
public:
	class UCustomizableObjectInstance*            CustomizableObjectInstance;                        // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MutableTextureMipDataProviderFactory">();
	}
	static class UMutableTextureMipDataProviderFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMutableTextureMipDataProviderFactory>();
	}
};

// Class CustomizableObject.CustomizableObjectSystem
// 0x0008 (0x0030 - 0x0028)
class UCustomizableObjectSystem final : public UObject
{
public:
	class UCustomizableObjectSystemPrivate*       Private;                                           // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UCustomizableObjectSystem* GetInstance();
	static class UCustomizableObjectSystem* GetInstanceChecked();
	static bool IsUpdateResultValid(const EUpdateResult UpdateResult);

	void SetReleaseMutableTexturesImmediately(bool bReleaseTextures);

	int32 GetAverageBuildTime() const;
	int32 GetNumInstances() const;
	int32 GetNumPendingInstances() const;
	class FString GetPluginVersion() const;
	int64 GetTextureMemoryUsed() const;
	int32 GetTotalInstances() const;
	bool IsUpdating(const class UCustomizableObjectInstance* Instance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectSystem">();
	}
	static class UCustomizableObjectSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectSystem>();
	}
};

// Class CustomizableObject.CustomizableSkeletalMeshActor
// 0x0028 (0x0338 - 0x0310)
class ACustomizableSkeletalMeshActor final : public ASkeletalMeshActor
{
public:
	TArray<class UCustomizableSkeletalComponent*> CustomizableSkeletalComponents;                    // 0x0310(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class USkeletalMeshComponent*>         SkeletalMeshComponents;                            // 0x0320(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UCustomizableSkeletalComponent*         CustomizableSkeletalComponent;                     // 0x0330(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableSkeletalMeshActor">();
	}
	static class ACustomizableSkeletalMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACustomizableSkeletalMeshActor>();
	}
};

// Class CustomizableObject.DefaultImageProvider
// 0x0050 (0x0078 - 0x0028)
class UDefaultImageProvider final : public UCustomizableSystemImageProvider
{
public:
	TMap<class FName, class UTexture2D*>          Textures;                                          // 0x0028(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultImageProvider">();
	}
	static class UDefaultImageProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultImageProvider>();
	}
};

}

