#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomControlsRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CustomControlsRuntime.CustomControlOptions_Base.GetOwningComponent
// 0x0008 (0x0008 - 0x0000)
struct CustomControlOptions_Base_GetOwningComponent final
{
public:
	class UFortControllerComponent_CustomControls* ReturnValue;                                      // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.CustomControlOptions_ThirdPerson.BP_InitAimingTargetingPreset
// 0x0008 (0x0008 - 0x0000)
struct CustomControlOptions_ThirdPerson_BP_InitAimingTargetingPreset final
{
public:
	class UTargetingPreset*                       Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.CustomControlOptions_ThirdPerson.BP_InitMeleeTargetingPreset
// 0x0008 (0x0008 - 0x0000)
struct CustomControlOptions_ThirdPerson_BP_InitMeleeTargetingPreset final
{
public:
	class UTargetingPreset*                       Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.CustomControlOptions_ThirdPerson.BP_InitRangedTargetingPreset
// 0x0008 (0x0008 - 0x0000)
struct CustomControlOptions_ThirdPerson_BP_InitRangedTargetingPreset final
{
public:
	class UTargetingPreset*                       Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.CustomControlOptions_ThirdPerson.BP_InitRetentionTargetingPreset
// 0x0008 (0x0008 - 0x0000)
struct CustomControlOptions_ThirdPerson_BP_InitRetentionTargetingPreset final
{
public:
	class UTargetingPreset*                       Preset;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.AddOptions
// 0x0018 (0x0018 - 0x0000)
struct FortControllerComponent_CustomControls_AddOptions final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomControlOptions_Base*             Options;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.CreateOptions
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_CustomControls_CreateOptions final
{
public:
	TSubclassOf<class UCustomControlOptions_Base> OptionsClass;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomControlOptions_Base*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.GetOptions
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_CustomControls_GetOptions final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomControlOptions_Base*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.OnRep_ActiveOptions
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_CustomControls_OnRep_ActiveOptions final
{
public:
	class UCustomControlOptions_Base*             OldOptions;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.RemoveOptions
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_CustomControls_RemoveOptions final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.ServerSetDesiredAimTargetOffset
// 0x0004 (0x0004 - 0x0000)
struct FortControllerComponent_CustomControls_ServerSetDesiredAimTargetOffset final
{
public:
	float                                         NewDesiredAimTargetOffset;                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.ServerSetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_CustomControls_ServerSetFocusTarget final
{
public:
	const class AActor*                           NewFocusTarget;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.ServerSetOptionsQueueBlocked
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_CustomControls_ServerSetOptionsQueueBlocked final
{
public:
	bool                                          bIsBlocked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.ServerSetUseDesiredRotationOverride
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_CustomControls_ServerSetUseDesiredRotationOverride final
{
public:
	bool                                          bNewUseDesiredRotationOverride;                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.SetOptionsEnabled
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_CustomControls_SetOptionsEnabled final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.SetOptionsPriority
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_CustomControls_SetOptionsPriority final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRefreshRelativePriority;                          // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.WeaponGetAimRotOverride
// 0x0030 (0x0030 - 0x0000)
struct FortControllerComponent_CustomControls_WeaponGetAimRotOverride final
{
public:
	const class AFortWeapon*                      Weapon;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortAbilityTargetingSource                   TargetingSource;                                   // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OutOverrideAimRot;                                 // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOutExecutionResult;                               // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function CustomControlsRuntime.FortControllerComponent_CustomControls.GetMovementModeLogic
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_CustomControls_GetMovementModeLogic final
{
public:
	class UFortMovementMode_BaseExtLogic*         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function CustomControlsRuntime.FortMovementMode_CCThirdPersonTwinStickLogic.SetStickRotation
// 0x0018 (0x0018 - 0x0000)
struct FortMovementMode_CCThirdPersonTwinStickLogic_SetStickRotation final
{
public:
	struct FRotator                               InStickRotation;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

}

