#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomControlsRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CustomControlsRuntime_structs.hpp"
#include "TargetingSystem_classes.hpp"


namespace SDK
{

// Class CustomControlsRuntime.CustomControlInputBindings_Base
// 0x0018 (0x0040 - 0x0028)
class UCustomControlInputBindings_Base : public UObject
{
public:
	TWeakObjectPtr<class UFortControllerComponent_CustomControls> OwnerCustomControlsComponent;      // 0x0028(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerController>   OwnerController;                                   // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerPawn>         OwnerPawn;                                         // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomControlInputBindings_Base">();
	}
	static class UCustomControlInputBindings_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomControlInputBindings_Base>();
	}
};

// Class CustomControlsRuntime.CustomControlInputBindings_EnhancedInput
// 0x0030 (0x0070 - 0x0040)
class UCustomControlInputBindings_EnhancedInput : public UCustomControlInputBindings_Base
{
public:
	TWeakObjectPtr<class UFortEnhancedInputComponent> OwnerInputComponent;                           // 0x0040(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Priority;                                          // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C[0x14];                                      // 0x004C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInputMappingContext*               InputMapping;                                      // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FModifyContextOptions                  Options;                                           // 0x0068(0x0001)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomControlInputBindings_EnhancedInput">();
	}
	static class UCustomControlInputBindings_EnhancedInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomControlInputBindings_EnhancedInput>();
	}
};

// Class CustomControlsRuntime.CustomControlInputBindings_InputComponent
// 0x0008 (0x0048 - 0x0040)
class UCustomControlInputBindings_InputComponent : public UCustomControlInputBindings_Base
{
public:
	class UInputComponent*                        InputComponent;                                    // 0x0040(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomControlInputBindings_InputComponent">();
	}
	static class UCustomControlInputBindings_InputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomControlInputBindings_InputComponent>();
	}
};

// Class CustomControlsRuntime.CustomControlInputBindings_ThirdPersonSkydiving
// 0x0080 (0x00F0 - 0x0070)
class UCustomControlInputBindings_ThirdPersonSkydiving final : public UCustomControlInputBindings_EnhancedInput
{
public:
	class UInputAction*                           SkydivingDownInputAction;                          // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           SkydivingUpInputAction;                            // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   MappingNameSkydivingDown;                          // 0x0080(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayNameSkydivingDown;                          // 0x0088(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   MappingNameSkydivingUp;                            // 0x0098(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayNameSkydivingUp;                            // 0x00A0(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         RotateStickThreshold;                              // 0x00B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InSkydiveVolumeTags;                               // 0x00B8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomControlInputBindings_ThirdPersonSkydiving">();
	}
	static class UCustomControlInputBindings_ThirdPersonSkydiving* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomControlInputBindings_ThirdPersonSkydiving>();
	}
};

// Class CustomControlsRuntime.CustomControlInputBindings_TwinStick
// 0x0050 (0x00C0 - 0x0070)
class UCustomControlInputBindings_TwinStick : public UCustomControlInputBindings_EnhancedInput
{
public:
	float                                         InitialDialAimTargetOffsetScaleFactor;             // 0x0070(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetingBreakOffsetGamepad;                       // 0x0074(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetingBreakOffsetMouse;                         // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           GamepadLookAtInputAction;                          // 0x0080(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           GamepadAimAtInputAction;                           // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputAction*                           MouseLookAtInputAction;                            // 0x0090(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x28];                                      // 0x0098(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomControlInputBindings_TwinStick">();
	}
	static class UCustomControlInputBindings_TwinStick* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomControlInputBindings_TwinStick>();
	}
};

// Class CustomControlsRuntime.CustomControlInputBindings_TwinStickDial
// 0x0020 (0x00E0 - 0x00C0)
class UCustomControlInputBindings_TwinStickDial final : public UCustomControlInputBindings_TwinStick
{
public:
	class UInputAction*                           MouseAimAtInputAction;                             // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomControlInputBindings_TwinStickDial">();
	}
	static class UCustomControlInputBindings_TwinStickDial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomControlInputBindings_TwinStickDial>();
	}
};

// Class CustomControlsRuntime.CustomControlOptions_Base
// 0x0050 (0x0078 - 0x0028)
class UCustomControlOptions_Base : public UObject
{
public:
	TSubclassOf<class UFortMovementMode_BaseCCLogic> MovementModeLogic;                              // 0x0028(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RangedAttackStateDuration;                         // 0x0030(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MeleeAttackStateDuration;                          // 0x0034(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UCustomControlInputBindings_Base>> InputBindingsClasses;                // 0x0038(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FFortWeaponReticleData                 FortWeaponReticleData;                             // 0x0048(0x0014)(Edit, BlueprintVisible, Net, NoDestructor, NativeAccessSpecifierPublic)
	struct FInteractionPointOptions               InteractionPointOptions;                           // 0x005C(0x0010)(Edit, BlueprintVisible, Net, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTargetingPreset*                       InteractionTargetingPreset;                        // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BP_OnActivate();
	void BP_OnDeactivate();

	class UFortControllerComponent_CustomControls* GetOwningComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomControlOptions_Base">();
	}
	static class UCustomControlOptions_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomControlOptions_Base>();
	}
};

// Class CustomControlsRuntime.CustomControlOptions_ThirdPerson
// 0x0078 (0x00F0 - 0x0078)
class UCustomControlOptions_ThirdPerson final : public UCustomControlOptions_Base
{
public:
	struct FFortMovementMode_CCThirdPersonCreationData MovementModeCreationData;                     // 0x0078(0x0030)(Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic)
	class UTargetingPreset*                       RangedTargetingPresetTemplate;                     // 0x00A8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTargetingPreset*                       RetentionTargetingPresetTemplate;                  // 0x00B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTargetingPreset*                       RangedAimingTargetingPresetTemplate;               // 0x00B8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTargetingPreset*                       MeleeTargetingPresetTemplate;                      // 0x00C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleToClampFire;                                  // 0x00C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTargetingPreset*                       RangedTargetingPreset;                             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTargetingPreset*                       RetentionTargetingPreset;                          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTargetingPreset*                       RangedAimTargetingPreset;                          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTargetingPreset*                       MeleeTargetingPreset;                              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_InitAimingTargetingPreset(class UTargetingPreset* Preset);
	void BP_InitMeleeTargetingPreset(class UTargetingPreset* Preset);
	void BP_InitRangedTargetingPreset(class UTargetingPreset* Preset);
	void BP_InitRetentionTargetingPreset(class UTargetingPreset* Preset);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomControlOptions_ThirdPerson">();
	}
	static class UCustomControlOptions_ThirdPerson* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomControlOptions_ThirdPerson>();
	}
};

// Class CustomControlsRuntime.FortControllerComponent_CustomControls
// 0x0198 (0x0240 - 0x00A8)
class UFortControllerComponent_CustomControls final : public UFortControllerComponent
{
public:
	uint8                                         Pad_A8[0x30];                                      // 0x00A8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomControlsState                   CurrentState;                                      // 0x00D8(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomControlOptions_Base*             ActiveOptions;                                     // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCustomControlOptions_Base*>     OwnedOptions;                                      // 0x00F0(0x0010)(Net, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x58];                                     // 0x0100(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      BlockTagsQuery;                                    // 0x0158(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A0[0x8];                                      // 0x01A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCustomControlInputBindings_Base*> ActiveInputBindings;                             // 0x01A8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B8[0x88];                                     // 0x01B8(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddOptions(const class UObject* ContextObject, class UCustomControlOptions_Base* Options, float Priority, bool bEnabled);
	void ClientOnBlockOptions();
	void ClientRegisterTagsQueries();
	class UCustomControlOptions_Base* CreateOptions(TSubclassOf<class UCustomControlOptions_Base> OptionsClass);
	class UCustomControlOptions_Base* GetOptions(const class UObject* ContextObject);
	void OnRep_ActiveOptions(class UCustomControlOptions_Base* OldOptions);
	void RemoveOptions(const class UObject* ContextObject);
	void ServerResetAimTargetOffset();
	void ServerSetDesiredAimTargetOffset(const float NewDesiredAimTargetOffset);
	void ServerSetFocusTarget(const class AActor* NewFocusTarget);
	void ServerSetOptionsQueueBlocked(bool bIsBlocked);
	void ServerSetUseDesiredRotationOverride(const bool bNewUseDesiredRotationOverride);
	bool SetOptionsEnabled(const class UObject* ContextObject, bool bEnabled);
	bool SetOptionsPriority(const class UObject* ContextObject, float Priority, bool bRefreshRelativePriority);
	void WeaponGetAimRotOverride(const class AFortWeapon* Weapon, const EFortAbilityTargetingSource TargetingSource, struct FRotator* OutOverrideAimRot, bool* bOutExecutionResult);

	class UFortMovementMode_BaseExtLogic* GetMovementModeLogic() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortControllerComponent_CustomControls">();
	}
	static class UFortControllerComponent_CustomControls* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_CustomControls>();
	}
};

// Class CustomControlsRuntime.FortMovementMode_BaseCCRuntimeData
// 0x0008 (0x0040 - 0x0038)
class UFortMovementMode_BaseCCRuntimeData : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_BaseCCRuntimeData">();
	}
	static class UFortMovementMode_BaseCCRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_BaseCCRuntimeData>();
	}
};

// Class CustomControlsRuntime.FortMovementMode_BaseCCLogic
// 0x0008 (0x0118 - 0x0110)
class UFortMovementMode_BaseCCLogic : public UFortMovementMode_BaseExtLogic
{
public:
	TWeakObjectPtr<class AFortPlayerController>   OwnerController;                                   // 0x0110(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_BaseCCLogic">();
	}
	static class UFortMovementMode_BaseCCLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_BaseCCLogic>();
	}
};

// Class CustomControlsRuntime.FortMovementMode_CCThirdPersonRuntimeData
// 0x0028 (0x0068 - 0x0040)
class UFortMovementMode_CCThirdPersonRuntimeData : public UFortMovementMode_BaseCCRuntimeData
{
public:
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_CCThirdPersonRuntimeData">();
	}
	static class UFortMovementMode_CCThirdPersonRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_CCThirdPersonRuntimeData>();
	}
};

// Class CustomControlsRuntime.FortMovementMode_CCThirdPersonLogic
// 0x0000 (0x0118 - 0x0118)
class UFortMovementMode_CCThirdPersonLogic : public UFortMovementMode_BaseCCLogic
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_CCThirdPersonLogic">();
	}
	static class UFortMovementMode_CCThirdPersonLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_CCThirdPersonLogic>();
	}
};

// Class CustomControlsRuntime.FortMovementMode_CCThirdPersonFixedRuntimeData
// 0x0018 (0x0080 - 0x0068)
class UFortMovementMode_CCThirdPersonFixedRuntimeData final : public UFortMovementMode_CCThirdPersonRuntimeData
{
public:
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_CCThirdPersonFixedRuntimeData">();
	}
	static class UFortMovementMode_CCThirdPersonFixedRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_CCThirdPersonFixedRuntimeData>();
	}
};

// Class CustomControlsRuntime.FortMovementMode_CCThirdPersonFixedLogic
// 0x0000 (0x0118 - 0x0118)
class UFortMovementMode_CCThirdPersonFixedLogic final : public UFortMovementMode_CCThirdPersonLogic
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_CCThirdPersonFixedLogic">();
	}
	static class UFortMovementMode_CCThirdPersonFixedLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_CCThirdPersonFixedLogic>();
	}
};

// Class CustomControlsRuntime.FortMovementMode_CCThirdPersonTwinStickRuntimeData
// 0x0020 (0x0088 - 0x0068)
class UFortMovementMode_CCThirdPersonTwinStickRuntimeData final : public UFortMovementMode_CCThirdPersonRuntimeData
{
public:
	uint8                                         Pad_68[0x20];                                      // 0x0068(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_CCThirdPersonTwinStickRuntimeData">();
	}
	static class UFortMovementMode_CCThirdPersonTwinStickRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_CCThirdPersonTwinStickRuntimeData>();
	}
};

// Class CustomControlsRuntime.FortMovementMode_CCThirdPersonTwinStickLogic
// 0x0020 (0x0138 - 0x0118)
class UFortMovementMode_CCThirdPersonTwinStickLogic final : public UFortMovementMode_CCThirdPersonLogic
{
public:
	uint8                                         Pad_118[0x20];                                     // 0x0118(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetStickRotation(const struct FRotator& InStickRotation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_CCThirdPersonTwinStickLogic">();
	}
	static class UFortMovementMode_CCThirdPersonTwinStickLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_CCThirdPersonTwinStickLogic>();
	}
};

// Class CustomControlsRuntime.TargetingFilterCCFOV
// 0x0008 (0x0030 - 0x0028)
class UTargetingFilterCCFOV final : public USimpleTargetingFilterTask
{
public:
	float                                         FliedOfView;                                       // 0x0028(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireLineOfSight;                               // 0x002C(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingFilterCCFOV">();
	}
	static class UTargetingFilterCCFOV* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingFilterCCFOV>();
	}
};

// Class CustomControlsRuntime.TargetingSelectionCCRange
// 0x0010 (0x0038 - 0x0028)
class UTargetingSelectionCCRange : public USimpleTargetingSelectionTask
{
public:
	float                                         Radius;                                            // 0x0028(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x002C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardOffset;                                     // 0x0030(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalOffset;                                    // 0x0034(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionCCRange">();
	}
	static class UTargetingSelectionCCRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionCCRange>();
	}
};

// Class CustomControlsRuntime.TargetingSelectionCCIdleInteract
// 0x0000 (0x0038 - 0x0038)
class UTargetingSelectionCCIdleInteract final : public UTargetingSelectionCCRange
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionCCIdleInteract">();
	}
	static class UTargetingSelectionCCIdleInteract* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionCCIdleInteract>();
	}
};

// Class CustomControlsRuntime.CustomControlInputBindings_ThirdPersonSprint
// 0x0038 (0x0080 - 0x0048)
class UCustomControlInputBindings_ThirdPersonSprint final : public UCustomControlInputBindings_InputComponent
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnalogInputDeadZone;                               // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RotateStickThreshold;                              // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CameraRotationThreshold;                           // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InputRateIfCameraRotationThreshold;                // 0x005C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x20];                                      // 0x0060(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomControlInputBindings_ThirdPersonSprint">();
	}
	static class UCustomControlInputBindings_ThirdPersonSprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomControlInputBindings_ThirdPersonSprint>();
	}
};

}

