#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DashRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class DashRuntime.FortGameplayAbility_Dash
// 0x0170 (0x0CB0 - 0x0B40)
class UFortGameplayAbility_Dash final : public UFortGameplayAbility
{
public:
	class AFortPlayerPawn*                        OwningPawn;                                        // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         UseMovementForTargetDeadzone;                      // 0x0B48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DashDistance;                                      // 0x0B70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DashEndVelocity;                                   // 0x0B98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bDashEndVelocityUseZ;                              // 0x0BC0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bUseDynamicZTarget;                                // 0x0BE8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DynamicZMaxReverseAngle;                           // 0x0C10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DynamicZMinReverseAngle;                           // 0x0C38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DynamicZReverseModifier;                           // 0x0C60(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DynamicZReverseTargetMinZ;                         // 0x0C88(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	struct FVector GetDashTarget() const;
	struct FVector GetEndMovementVelocity() const;
	float GetMoveDistance() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameplayAbility_Dash">();
	}
	static class UFortGameplayAbility_Dash* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_Dash>();
	}
};

// Class DashRuntime.FortMovementMode_DashRuntimeData
// 0x0058 (0x0090 - 0x0038)
class UFortMovementMode_DashRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_38[0x58];                                      // 0x0038(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_DashRuntimeData">();
	}
	static class UFortMovementMode_DashRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_DashRuntimeData>();
	}
};

// Class DashRuntime.FortMovementMode_ExtDash
// 0x0008 (0x0118 - 0x0110)
class UFortMovementMode_ExtDash final : public UFortMovementMode_BaseExtLogic
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool TryActivateDashMME(class AFortPawn* TargetPawn, TSubclassOf<class UFortMovementMode_ExtDash> DashMME, const struct FFortMovementMode_DashCreationData& CreationData);

	EFortMovementModeExt_UpdateResult BP_UpdateBeforeCharacterMovement(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtDash">();
	}
	static class UFortMovementMode_ExtDash* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtDash>();
	}
};

}

