#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DaySequence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DaySequence_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class DaySequence.DaySequenceCheatManagerExtension
// 0x0000 (0x0028 - 0x0028)
class UDaySequenceCheatManagerExtension final : public UCheatManagerExtension
{
public:
	void SetTimeOfDay(float NewTimeOfDay) const;
	void SetTimeOfDaySpeed(float NewTimeOfDaySpeedMultiplier) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceCheatManagerExtension">();
	}
	static class UDaySequenceCheatManagerExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceCheatManagerExtension>();
	}
};

// Class DaySequence.DaySequenceConditionTag
// 0x0020 (0x0048 - 0x0028)
class UDaySequenceConditionTag final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BroadcastOnConditionValueChanged() const;
	bool Evaluate() const;
	class FString GetConditionName() const;
	void SetupBroadcastBindings() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceConditionTag">();
	}
	static class UDaySequenceConditionTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceConditionTag>();
	}
};

// Class DaySequence.DaySequenceModifierEasingFunction
// 0x0048 (0x0070 - 0x0028)
class UDaySequenceModifierEasingFunction final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceModifierEasingFunction">();
	}
	static class UDaySequenceModifierEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceModifierEasingFunction>();
	}
};

// Class DaySequence.DaySequenceModifierComponent
// 0x0120 (0x0340 - 0x0220)
class UDaySequenceModifierComponent final : public USceneComponent
{
public:
	class UDaySequenceModifierEasingFunction*     EasingFunction;                                    // 0x0220(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADaySequenceActor*                      TargetActor;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FComponentReference>            VolumeShapeComponents;                             // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  ExternalVolumeBlendTarget;                         // 0x0240(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDaySequence*                           UserDaySequence;                                   // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDaySequence*                           ProceduralDaySequence;                             // 0x0250(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDaySequenceCollectionAsset*            DaySequenceCollection;                             // 0x0258(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Bias;                                              // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DayNightCycleTime;                                 // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlendAmount;                                       // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomVolumeBlendWeight;                           // 0x0270(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDayNightCycleMode                            DayNightCycle;                                     // 0x0274(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDaySequenceModifierBlendMode                 BlendMode;                                         // 0x0275(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_276[0x2];                                      // 0x0276(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPostReinitializeSubSequences;                    // 0x0278(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnPostEnableModifier;                              // 0x0288(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AActor* OverlappingActor)> OnVolumeBlendTargetOverlapBegin;  // 0x0298(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A8[0x18];                                     // 0x02A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AActor* OverlappingActor)> OnVolumeBlendTargetOverlapEnd;    // 0x02C0(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D0[0x18];                                     // 0x02D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bIgnoreBias : 1;                                   // 0x02E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bUseVolume : 1;                                    // 0x02E8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsComponentEnabled : 1;                           // 0x02E8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsEnabled : 1;                                    // 0x02E8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bPreview : 1;                                      // 0x02E8(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_2E8_5 : 1;                                  // 0x02E8(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bUseCollection : 1;                                // 0x02E8(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2E9[0x57];                                     // 0x02E9(0x0057)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddBoolOverride(class UObject* Object, class FName PropertyName, bool bValue);
	void AddColorMaterialParameterOverride(class UObject* Object, int32 MaterialIndex, class FName ParameterName, const struct FLinearColor& Value);
	void AddColorOverride(class UObject* Object, class FName PropertyName, const struct FLinearColor& Value);
	void AddMaterialOverride(class UObject* Object, int32 MaterialIndex, class UMaterialInterface* Value);
	void AddScalarMaterialParameterOverride(class UObject* Object, int32 MaterialIndex, class FName ParameterName, float Value);
	void AddScalarOverride(class UObject* Object, class FName PropertyName, double Value);
	void AddStaticTimeOfDayOverride(class ADaySequenceActor* Actor, float Hours);
	void AddTransformOverride(class UObject* Object, const struct FTransform& Value);
	void AddVectorOverride(class UObject* Object, class FName PropertyName, const struct FVector& Value);
	void AddVisibilityOverride(class UObject* Object, bool bValue);
	void BindToDaySequenceActor(class ADaySequenceActor* DaySequenceActor);
	void DisableComponent();
	void DisableModifier();
	void EnableComponent();
	void EnableDistanceVolumeBlends(class AActor* InActor);
	void EnableModifier();
	bool IsBlendTargetInAnyVolume();
	void OnVolumeOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnVolumeOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ResetOverrides();
	void SetCustomVolumeBlendWeight(float Weight);
	void SetUserDaySequence(class UDaySequence* InDaySequence);
	void UnbindFromDaySequenceActor();

	float GetCurrentBlendWeight() const;
	void SetVolumeCollisionEnabled(const ECollisionEnabled InCollisionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceModifierComponent">();
	}
	static class UDaySequenceModifierComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceModifierComponent>();
	}
};

// Class DaySequence.DaySequenceModifierVolume
// 0x0030 (0x02C0 - 0x0290)
class ADaySequenceModifierVolume final : public AActor
{
public:
	class UDaySequenceModifierComponent*          DaySequenceModifier;                               // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                          DefaultBox;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADaySequenceActor*                      DaySequenceActor;                                  // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerController*                      CachedPlayerController;                            // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 CurrentBlendTarget;                                // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDaySequenceActorBound(class ADaySequenceActor* InActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceModifierVolume">();
	}
	static class ADaySequenceModifierVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADaySequenceModifierVolume>();
	}
};

// Class DaySequence.DaySequence
// 0x00C8 (0x0130 - 0x0068)
class UDaySequence final : public UMovieSceneSequence
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieScene*                            MovieScene;                                        // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDaySequenceBindingReferences          BindingReferences;                                 // 0x0078(0x00A0)(Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UObject>                    DirectorClass;                                     // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x0120(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequence">();
	}
	static class UDaySequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequence>();
	}
};

// Class DaySequence.DaySequenceActor
// 0x0140 (0x03D0 - 0x0290)
class ADaySequenceActor : public AInfo
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DayInterpCurve;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDaySequenceCollectionAsset*            DaySequenceCollection;                             // 0x02A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bias;                                              // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneBindingOverrides*            BindingOverrides;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bReplicatePlayback : 1;                            // 0x02C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDaySequencePlayer*                     SequencePlayer;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDaySequence*                           RootSequence;                                      // 0x02D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRunDayCycle;                                      // 0x02D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseInterpCurve;                                   // 0x02D9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2DA[0x2];                                      // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimecode                              DayLength;                                         // 0x02DC(0x0014)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimecode                              TimePerCycle;                                      // 0x02F0(0x0014)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimecode                              InitialTimeOfDay;                                  // 0x0304(0x0014)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_318[0x68];                                     // 0x0318(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TSubclassOf<class UDaySequenceConditionTag>, class UDaySequenceConditionTag*> TrackConditionMap; // 0x0380(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	bool ContainsDaySequence(const class UDaySequence* InDaySequence);
	void Multicast_SetTimePerCycle(float InHours);
	void Pause();
	void Play();
	void RemoveStaticTimeOfDay(bool bResumeFromStaticTime);
	void SetReplicatePlayback(bool ReplicatePlayback);
	void SetStaticTimeOfDay(float InHours);
	bool SetTimeOfDay(float InHours);
	void SetTimeOfDayPreview(float InHours);

	float GetDayLength() const;
	float GetInitialTimeOfDay() const;
	class UDaySequencePlayer* GetSequencePlayer() const;
	float GetStaticTimeOfDay() const;
	float GetTimeOfDay() const;
	float GetTimeOfDayPreview() const;
	float GetTimePerCycle() const;
	bool HasStaticTimeOfDay() const;
	bool IsPaused() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceActor">();
	}
	static class ADaySequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADaySequenceActor>();
	}
};

// Class DaySequence.DaySequenceCollectionAsset
// 0x0010 (0x0040 - 0x0030)
class UDaySequenceCollectionAsset final : public UDataAsset
{
public:
	TArray<struct FDaySequenceCollectionEntry>    DaySequences;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceCollectionAsset">();
	}
	static class UDaySequenceCollectionAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceCollectionAsset>();
	}
};

// Class DaySequence.DaySequenceDirector
// 0x0010 (0x0038 - 0x0028)
class UDaySequenceDirector final : public UObject
{
public:
	class UDaySequencePlayer*                     Player;                                            // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubSequenceID;                                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MovieScenePlayerIndex;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class AActor* GetBoundActor(const struct FMovieSceneObjectBindingID& ObjectBinding);
	TArray<class AActor*> GetBoundActors(const struct FMovieSceneObjectBindingID& ObjectBinding);
	class UObject* GetBoundObject(const struct FMovieSceneObjectBindingID& ObjectBinding);
	TArray<class UObject*> GetBoundObjects(const struct FMovieSceneObjectBindingID& ObjectBinding);
	class UMovieSceneSequence* GetSequence();
	void OnCreated();

	struct FQualifiedFrameTime GetCurrentTime() const;
	struct FQualifiedFrameTime GetRootSequenceTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceDirector">();
	}
	static class UDaySequenceDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceDirector>();
	}
};

// Class DaySequence.DaySequencePlayer
// 0x0008 (0x0468 - 0x0460)
class UDaySequencePlayer final : public UMovieSceneSequencePlayer
{
public:
	uint8                                         Pad_460[0x8];                                      // 0x0460(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequencePlayer">();
	}
	static class UDaySequencePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequencePlayer>();
	}
};

// Class DaySequence.DaySequenceProjectSettings
// 0x0030 (0x0060 - 0x0030)
class UDaySequenceProjectSettings final : public UDeveloperSettings
{
public:
	bool                                          bDefaultLockEngineToDisplayRate;                   // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultDisplayRate;                                // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultTickResolution;                             // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUpdateClockSource                            DefaultClockSource;                                // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceProjectSettings">();
	}
	static class UDaySequenceProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceProjectSettings>();
	}
};

// Class DaySequence.DaySequenceProvider
// 0x0010 (0x02A0 - 0x0290)
class ADaySequenceProvider : public AActor
{
public:
	TArray<class UDaySequence*>                   DaySequenceAssets;                                 // 0x0290(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceProvider">();
	}
	static class ADaySequenceProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADaySequenceProvider>();
	}
};

// Class DaySequence.DaySequenceSubsystem
// 0x0038 (0x0068 - 0x0030)
class UDaySequenceSubsystem final : public UWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(class ADaySequenceActor* NewActor)> OnDaySequenceActorSet;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDaySequenceActor(class ADaySequenceActor* InActor);

	class ADaySequenceActor* GetDaySequenceActor(bool bFindFallbackOnNull) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceSubsystem">();
	}
	static class UDaySequenceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceSubsystem>();
	}
};

// Class DaySequence.DaySequenceTrack
// 0x0000 (0x00A8 - 0x00A8)
class UDaySequenceTrack final : public UMovieSceneSubTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DaySequenceTrack">();
	}
	static class UDaySequenceTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceTrack>();
	}
};

// Class DaySequence.EnvironmentLightingActor
// 0x0030 (0x02D0 - 0x02A0)
class AEnvironmentLightingActor final : public ADaySequenceProvider
{
public:
	class USkyAtmosphereComponent*                SkyAtmosphereComponent;                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkyLightComponent*                     SkyLightComponent;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        SunRootComponent;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDirectionalLightComponent*             SunComponent;                                      // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UExponentialHeightFogComponent*         ExponentialHeightFogComponent;                     // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVolumetricCloudComponent*              VolumetricCloudComponent;                          // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvironmentLightingActor">();
	}
	static class AEnvironmentLightingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEnvironmentLightingActor>();
	}
};

}

