#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarValidatorCommon

#include "Basic.hpp"


namespace SDK::Params
{

// Function DelMarValidatorCommon.DelMarWorldValidator_Task.AddError
// 0x0010 (0x0010 - 0x0000)
struct DelMarWorldValidator_Task_AddError final
{
public:
	class FText                                   Msg;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarValidatorCommon.DelMarWorldValidator_Task.AddErrorTokenized
// 0x0018 (0x0018 - 0x0000)
struct DelMarWorldValidator_Task_AddErrorTokenized final
{
public:
	const class UObject*                          InAsset;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Msg;                                               // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarValidatorCommon.DelMarWorldValidator_Task.AddWarning
// 0x0010 (0x0010 - 0x0000)
struct DelMarWorldValidator_Task_AddWarning final
{
public:
	class FText                                   Msg;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarValidatorCommon.DelMarWorldValidator_Task.AddWarningTokenized
// 0x0018 (0x0018 - 0x0000)
struct DelMarWorldValidator_Task_AddWarningTokenized final
{
public:
	const class UObject*                          InAsset;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Msg;                                               // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarValidatorCommon.DelMarWorldValidator_Task.LogString
// 0x0010 (0x0010 - 0x0000)
struct DelMarWorldValidator_Task_LogString final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

