#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarSettings

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class DelMarSettings.DelMarInputContextRedirectMap
// 0x0050 (0x0080 - 0x0030)
class UDelMarInputContextRedirectMap final : public UDataAsset
{
public:
	TMap<class UFortInputMappingContext*, class UFortInputMappingContext*> RedirectMap;              // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarInputContextRedirectMap">();
	}
	static class UDelMarInputContextRedirectMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarInputContextRedirectMap>();
	}
};

// Class DelMarSettings.DelMarInputModifierPitchInversion
// 0x0000 (0x0028 - 0x0028)
class UDelMarInputModifierPitchInversion final : public UInputModifier
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarInputModifierPitchInversion">();
	}
	static class UDelMarInputModifierPitchInversion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarInputModifierPitchInversion>();
	}
};

// Class DelMarSettings.DelMarInputModifierZeroOut
// 0x0000 (0x0028 - 0x0028)
class UDelMarInputModifierZeroOut final : public UInputModifier
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarInputModifierZeroOut">();
	}
	static class UDelMarInputModifierZeroOut* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarInputModifierZeroOut>();
	}
};

// Class DelMarSettings.DelMarInputModifierAlwaysOne
// 0x0000 (0x0028 - 0x0028)
class UDelMarInputModifierAlwaysOne final : public UInputModifier
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarInputModifierAlwaysOne">();
	}
	static class UDelMarInputModifierAlwaysOne* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarInputModifierAlwaysOne>();
	}
};

// Class DelMarSettings.DelMarInputModifierScalarBySign
// 0x0030 (0x0058 - 0x0028)
class UDelMarInputModifierScalarBySign final : public UInputModifier
{
public:
	struct FVector                                PositiveScalar;                                    // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                NegativeScalar;                                    // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarInputModifierScalarBySign">();
	}
	static class UDelMarInputModifierScalarBySign* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarInputModifierScalarBySign>();
	}
};

// Class DelMarSettings.DelMarInputModifierClamp
// 0x0030 (0x0058 - 0x0028)
class UDelMarInputModifierClamp final : public UInputModifier
{
public:
	struct FVector                                Minimum;                                           // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                Maximum;                                           // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarInputModifierClamp">();
	}
	static class UDelMarInputModifierClamp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarInputModifierClamp>();
	}
};

// Class DelMarSettings.DelMarSettingsGlobals
// 0x0008 (0x0030 - 0x0028)
class UDelMarSettingsGlobals final : public UObject
{
public:
	struct FGameplayTag                           DefaultTouchControlsLayout;                        // 0x0028(0x0004)(Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarSettingsGlobals">();
	}
	static class UDelMarSettingsGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarSettingsGlobals>();
	}
};

// Class DelMarSettings.GameFeatureAction_AddInputContextMappingPlatformOverrides
// 0x0008 (0x00F8 - 0x00F0)
class UGameFeatureAction_AddInputContextMappingPlatformOverrides final : public UGameFeatureAction_AddInputContextMapping
{
public:
	class UDelMarInputContextRedirectMap*         DigitalRedirectMap;                                // 0x00F0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddInputContextMappingPlatformOverrides">();
	}
	static class UGameFeatureAction_AddInputContextMappingPlatformOverrides* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddInputContextMappingPlatformOverrides>();
	}
};

}

