#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarAudio

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DelMarCore_structs.hpp"


namespace SDK
{

// ScriptStruct DelMarAudio.DelMarStateMix
// 0x0038 (0x0038 - 0x0000)
struct FDelMarStateMix final
{
public:
	struct FGameplayTag                           MixStateTag;                                       // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAudioMixModifierGroup                 ActorMixModifiers;                                 // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
	class USoundControlBusMix*                    ControlBusMix;                                     // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoDeactivate;                                   // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         duration;                                          // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           FallbackState;                                     // 0x0030(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarAudio.DelMarStateMixCollection
// 0x0018 (0x0018 - 0x0000)
struct FDelMarStateMixCollection final
{
public:
	class FName                                   Group;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDelMarStateMix>                Mixes;                                             // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarAudio.DelMarEvent_AudioStateComponent
// 0x0008 (0x0008 - 0x0000)
struct FDelMarEvent_AudioStateComponent final
{
public:
	class UDelMarAudioStatePlayspaceComponent*    StateComponent;                                    // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarAudio.DelmarAudioVirtualizationSettings
// 0x000C (0x000C - 0x0000)
struct FDelmarAudioVirtualizationSettings final
{
public:
	int32                                         MaxNumPlayers;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumDistantPlayers;                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistantPlayerThreshold;                            // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

