#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarCore

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "DelMarCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "FortniteAI_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DelMarTrackRuntime_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "LinkId_structs.hpp"
#include "VehicleCosmeticsRuntime_classes.hpp"
#include "CommonInput_structs.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "AudioGameplay_classes.hpp"
#include "VehicleCosmeticsAudioRuntime_classes.hpp"


namespace SDK
{

// Class DelMarCore.DelMarActorMover
// 0x0040 (0x0C20 - 0x0BE0)
class ADelMarActorMover final : public AFortCreativeDeviceProp
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       MovementSpline;                                    // 0x0BE8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDelMarSplineMovementType                     MovementType;                                      // 0x0BF0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BF1[0x7];                                      // 0x0BF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ManagedActor;                                      // 0x0BF8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarSplineActorMovementComponent*    SplineMovementComponent;                           // 0x0C00(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C08[0x10];                                     // 0x0C08(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ServerMovementStartTime;                           // 0x0C18(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1C[0x4];                                      // 0x0C1C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitializeMovement();
	void OnRep_ServerStartTime();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarActorMover">();
	}
	static class ADelMarActorMover* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarActorMover>();
	}
};

// Class DelMarCore.DelMarAIController
// 0x01F8 (0x05B0 - 0x03B8)
class ADelMarAIController final : public AAIController
{
public:
	uint8                                         Pad_3B8[0x20];                                     // 0x03B8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ADelMarAIController* AIController, const struct FFortAthenaLoadout& Loadout)> OnLoadoutChanged; // 0x03D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DescriptorTag;                                     // 0x03E8(0x0004)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAthenaLoadout                     CosmeticLoadoutBC;                                 // 0x03F0(0x0130)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FCosmeticLoadout                       VehicleCosmeticLoadout;                            // 0x0520(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EDelMarInvertSteerMethod                      BotSteerMethod;                                    // 0x0530(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          BTAssetToRunOnPawnAISpawned;                       // 0x0538(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UBehaviorTree*>                  SkillLevelBehaviorTrees;                           // 0x0540(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	int32                                         MinSkillLevelForRubberbanding;                     // 0x0550(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDelMarCoreOobTubePositionalRenderingComponent> OobTubePositionRenderingComponentClass; // 0x0558(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarVehicle>          DelMarVehicle;                                     // 0x0560(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_568[0x10];                                     // 0x0568(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DelMarBotControllerUID;                            // 0x0578(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DelMarBotSkillLevel;                               // 0x057C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DelMarBotPlayerName;                               // 0x0580(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarAIService*                       DelMarAIService;                                   // 0x0590(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortPlayerPawn*                        PlayerBotPawn;                                     // 0x0598(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A0[0x10];                                     // 0x05A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleGroundedStateChanged(const TScriptInterface<class IDelMarVehicleInterface>& VehicleRef, bool bValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAIController">();
	}
	static class ADelMarAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarAIController>();
	}
};

// Class DelMarCore.DelMarAIService
// 0x00F0 (0x0168 - 0x0078)
class UDelMarAIService final : public UAthenaAIService
{
public:
	TSubclassOf<class UFortAthenaAISpawnerDataComponent_AIBotCosmeticBase> CosmeticComponentClass;   // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UDelMarAIVehicleCosmeticLibraryData> VehicleCosmeticLibrary;                // 0x0080(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBotsUniqueIDUseValidAccountID;                    // 0x00A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseRegionalNameList;                              // 0x00A1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortAthenaAIBotNameDataAsset> BotNameDataAsset;                            // 0x00A8(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ADelMarAIController>        AIControllerClass;                                 // 0x00C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UDataTable>              MMRSpawnTablePtr;                                  // 0x00D0(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ADelMarAIController*>            DelMarAIControllers;                               // 0x00F0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceManager>      RaceManager;                                       // 0x0100(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarRespawnManagerComponent> RespawnManagerComponent;                    // 0x0108(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class FString>                           ReservedPlayerNames;                               // 0x0110(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePlayerRegistered(class AFortPlayerState* RegisteredPlayerState);
	void HandlePlayerUnregistered(class AFortPlayerState* UnregisteredPlayerState, bool bSetAsInactive);

	int32 GetMaxNumberOfPlayers() const;
	const TArray<class ADelMarAIController*> GetRegisteredAIBotControllers() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAIService">();
	}
	static class UDelMarAIService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAIService>();
	}
};

// Class DelMarCore.DelMarAIVehicleCosmeticLibraryData
// 0x0030 (0x0060 - 0x0030)
class UDelMarAIVehicleCosmeticLibraryData final : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class UDataTable>              PredefineVehiclCosmeticSetsDataTable;              // 0x0030(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FDelMarAIVehicleCosmeticSlotDataTableInfo> RandomizedVehicleSlotDataTables;        // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarAIVehicleCosmeticLibraryData">();
	}
	static class UDelMarAIVehicleCosmeticLibraryData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarAIVehicleCosmeticLibraryData>();
	}
};

// Class DelMarCore.DriveHazardInfo
// 0x00B8 (0x00E0 - 0x0028)
class UDriveHazardInfo final : public UObject
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DriveHazardInfo">();
	}
	static class UDriveHazardInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDriveHazardInfo>();
	}
};

// Class DelMarCore.DelMarBTService_VehicleBase
// 0x0030 (0x00A0 - 0x0070)
class UDelMarBTService_VehicleBase : public UBTService
{
public:
	struct FBlackboardKeySelector                 VehicleKey;                                        // 0x0070(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarVehicle>          DelMarVehicle;                                     // 0x0098(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarBTService_VehicleBase">();
	}
	static class UDelMarBTService_VehicleBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarBTService_VehicleBase>();
	}
};

// Class DelMarCore.DelMarBTService_FindDriveGoal
// 0x04F0 (0x0590 - 0x00A0)
class alignas(0x10) UDelMarBTService_FindDriveGoal final : public UDelMarBTService_VehicleBase
{
public:
	struct FBlackboardKeySelector                 DriveGoalLocationKey;                              // 0x00A0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 DriveGoalRotationKey;                              // 0x00C8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 IsJumpDriveGoalKey;                                // 0x00F0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 IsOffRoadDriveGoalKey;                             // 0x0118(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 IsKickflipDriveGoalKey;                            // 0x0140(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 KickflipDirecitonKey;                              // 0x0168(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 HasUpcomingCollisionKey;                           // 0x0190(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         GroundedDriveGoalVehicleForwardOffset;             // 0x01B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AirDriveGoalVehicleForwardOffset;                  // 0x01BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PathNoiseAmplitude;                                // 0x01C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PathNoiseFrequency;                                // 0x01C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxNumberOfCheckedTrackSegments;                   // 0x01C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GroundedOffroadRaycastDistance;                    // 0x01CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GroundedOffRoadRaycastTrackForwardOffset;          // 0x01D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrackGapCheckForwardOffset;                        // 0x01D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ReturnToTrackRaycastForwardOffset;                 // 0x01D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ReturnToTrackRaycastDepthPadding;                  // 0x01DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ReturnToTrackMaintainVehicleOffsetDegreeThreshold; // 0x01E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ReturnToTrackRaycastMinAngleDifference;            // 0x01E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UnsafeLandingDesiredUnderthrustHeightFactor;       // 0x01E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UnsafeLandingJumpGoalTrackOffsetReductionFactor;   // 0x01EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OffRoadSurfaceMaxNormalToTrackAngleThreshold;      // 0x01F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxVehicleAirRollAngleToReturnToTrackFromBelow;    // 0x01F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumberOfSideAvoidanceRaycasts;                     // 0x01F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DegreesBetweenRaycasts;                            // 0x01FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DriftPrimaryTraceRotationFactor;                   // 0x0200(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NonJumpableHazardMinHitNormalDegrees;              // 0x0204(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             RaycastCollisionChannel;                           // 0x0208(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class AActor>>             IgnoredActorClasses;                               // 0x0210(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     RaycastDistanceCurve;                              // 0x0220(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     RayCastDistanceContributionCurve;                  // 0x02B0(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     VehicleDistanceAvoidanceCurve;                     // 0x0340(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         DriveGoalOffsetCancelPadding;                      // 0x03D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DriveHazardOffsetCancelPadding;                    // 0x03D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VehicleTrackOffsetCancelPadding;                   // 0x03D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DriveHazardMaxJumpDistanceFactor;                  // 0x03DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DriveHazardMinJumpDistanceFactor;                  // 0x03E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HazardJumpGoalMaxHeightOffset;                     // 0x03E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HazardJumpGoalMinHeightOffset;                     // 0x03E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlockedJumpTracePadding;                           // 0x03EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrackGapJumpHeightThreshold;                       // 0x03F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrackGapDriveGoalHeightOffset;                     // 0x03F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>             JumpableActorClasses;                              // 0x03F8(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                         DownwardKickflipSurfaceNormalDegreeThreshold;      // 0x0408(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UpwardKickflipMinNormalDegreesToWorldUp;           // 0x040C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         KickflipDriveGoalTrackHeightOffset;                // 0x0410(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         KickflipDriveGoalForwardDistanceThreshold;         // 0x0414(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UnderKickflipSurfaceForwardDistanceThreshold;      // 0x0418(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         KickflipTraceHeightOffset;                         // 0x041C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PercentChanceToIgnoreDriveHazard;                  // 0x0420(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PercentChanceToNotCheckForSafeLanding;             // 0x0424(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarTrackPositionComponent> TrackPositionComponent;                      // 0x0428(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarTrackBase>        CurrentTrack;                                      // 0x0430(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarTrackSplineComponent> CurrentTrackSplineComponent;                   // 0x0438(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarTrackOobTubePositionalRenderingComponent> OobTubePositionalRenderingComponent; // 0x0440(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TWeakObjectPtr<class AActor>, class UDriveHazardInfo*> PrevFrameDriveHazardInfoMap;         // 0x0448(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  OffRoadDriveActor;                                 // 0x0498(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  CurrentJumpHazard;                                 // 0x04A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A8[0xE8];                                     // 0x04A8(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleKickflipActivated(bool bLeft);
	void HandleVehicleAnyWheelsOnGroundStateChanged(const TScriptInterface<class IDelMarVehicleInterface>& VehicleRef, bool bAnyWheelsOnGround);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarBTService_FindDriveGoal">();
	}
	static class UDelMarBTService_FindDriveGoal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarBTService_FindDriveGoal>();
	}
};

// Class DelMarCore.DelMarBTService_ResetVehicle
// 0x0020 (0x00C0 - 0x00A0)
class UDelMarBTService_ResetVehicle final : public UDelMarBTService_VehicleBase
{
public:
	TWeakObjectPtr<class UDelMarPlayerRaceDataComponent> PlayerRaceDataComponent;                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarTrackPositionComponent> TrackPositionComponent;                      // 0x00A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarBTService_ResetVehicle">();
	}
	static class UDelMarBTService_ResetVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarBTService_ResetVehicle>();
	}
};

// Class DelMarCore.DelMarBTTask_VehicleBase
// 0x0030 (0x00A0 - 0x0070)
class UDelMarBTTask_VehicleBase : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                 VehicleKey;                                        // 0x0070(0x0028)(Edit, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ADelMarVehicle>          DelMarVehicle;                                     // 0x0098(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarBTTask_VehicleBase">();
	}
	static class UDelMarBTTask_VehicleBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarBTTask_VehicleBase>();
	}
};

// Class DelMarCore.DelMarBTTask_DriveTrack
// 0x0870 (0x0910 - 0x00A0)
class alignas(0x10) UDelMarBTTask_DriveTrack final : public UDelMarBTTask_VehicleBase
{
public:
	struct FBlackboardKeySelector                 DriveGoalLocationKey;                              // 0x00A0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 DriveGoalRotationKey;                              // 0x00C8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 IsJumpDriveGoalKey;                                // 0x00F0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 IsOffRoadDriveGoalKey;                             // 0x0118(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 IsKickflipDriveGoalKey;                            // 0x0140(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 KickflipDirecitonKey;                              // 0x0168(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 HasUpcomingCollisionKey;                           // 0x0190(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     GroundedTrackHorizontalOffsetSteerCurve;           // 0x01B8(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     AirTrackHorizontalOffsetSteerCurve;                // 0x0248(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     CollisionAvoidanceHorizontalOffsetSteerCurve;      // 0x02D8(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     GroundedTurnDegreesSteerDecisionCurve;             // 0x0368(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     AirTurnDegreesSteerDecisionCurve;                  // 0x03F8(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     CollisionTurnDegreesSteerDecisionCurve;            // 0x0488(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         DriveThrottle;                                     // 0x0518(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanKickDrift;                                     // 0x051C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51D[0x3];                                      // 0x051D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberOfDriftCheckSamples;                         // 0x0520(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinDriftSampleDistanceScaleFactor;                 // 0x0524(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxDriftSampleDistanceScaleFactor;                 // 0x0528(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinExitDriftSampleDistanceFromVehicle;             // 0x052C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxExitDriftSampleDistanceFromVehicle;             // 0x0530(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinRequiredDriftDegrees;                           // 0x0534(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxRequiredDriftDegrees;                           // 0x0538(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinRequiredKickDriftDegrees;                       // 0x053C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxRequiredKickDriftDegrees;                       // 0x0540(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinSecondsToUpdateRandomDriftConfigValues;         // 0x0544(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     PercentChanceToKickDriftCurve;                     // 0x0548(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         MinDriftSlipRatioForExitKickDrift;                 // 0x05D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinDriftSpeed;                                     // 0x05DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DriftKickUnderSteerDegreesThreshold;               // 0x05E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DriftKickOverSteerDegreesThreshold;                // 0x05E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DriftTapUnderSteerDegreesThreshold;                // 0x05E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DriftTapOverSteerDegreesThreshold;                 // 0x05EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DriftCounterSteerDegreesThreshold;                 // 0x05F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDelMarScaledCurve                     MinDriftSlipRatioCurve;                            // 0x05F8(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     DistanceBetweenDriftSamplesCurve;                  // 0x0688(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     DriftSampleDistanceFromVehicleCurve;               // 0x0718(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FDelMarScaledCurve                     DriveGoalJumpHeightThresholdCurve;                 // 0x07A8(0x0090)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         JumpGoalTrackAngleDistanceOffset;                  // 0x0838(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         JumpMinSpeed;                                      // 0x083C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinNumTurboChargesNeededToTurbo;                   // 0x0840(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxTurboTrackCutoffAngleInDegrees;                 // 0x0844(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TurboActivationBaseChance;                         // 0x0848(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SecondaryTurboBoostChance;                         // 0x084C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinTimeBetweenTurboCheck;                          // 0x0850(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxTimeBetweenTurboCheck;                          // 0x0854(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarTrackPositionComponent> TrackPositionComponent;                      // 0x0858(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarTrackBase>        CurrentTrack;                                      // 0x0860(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarTrackSplineComponent> CurrentTrackSplineComponent;                   // 0x0868(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlackboardComponent*                   BlackboardComponent;                               // 0x0870(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_878[0x98];                                     // 0x0878(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleTurboActivated();
	void HandleVehicleAnyWheelsOnGroundStateChanged(const TScriptInterface<class IDelMarVehicleInterface>& VehicleRef, bool bAnyWheelsOnGround);
	void TurboBonusZoneStateChanged(EDelMarTurboZoneState NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarBTTask_DriveTrack">();
	}
	static class UDelMarBTTask_DriveTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarBTTask_DriveTrack>();
	}
};

// Class DelMarCore.DelMarBTTask_RaceCountdown
// 0x0018 (0x00B8 - 0x00A0)
class UDelMarBTTask_RaceCountdown final : public UDelMarBTTask_VehicleBase
{
public:
	float                                         MaxReactionTime;                                   // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinReactionTime;                                   // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarBTTask_RaceCountdown">();
	}
	static class UDelMarBTTask_RaceCountdown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarBTTask_RaceCountdown>();
	}
};

// Class DelMarCore.DelMarCameraModeOverrideComponent
// 0x0000 (0x00A8 - 0x00A8)
class UDelMarCameraModeOverrideComponent final : public UFortCameraModeOverrideComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarCameraModeOverrideComponent">();
	}
	static class UDelMarCameraModeOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarCameraModeOverrideComponent>();
	}
};

// Class DelMarCore.DelMarChallengeGhostSystemControllerComponent
// 0x0038 (0x00D8 - 0x00A0)
class UDelMarChallengeGhostSystemControllerComponent final : public UControllerComponent
{
public:
	TSubclassOf<class UDelMarGhostPlaybackSessionComponent> GhostPlaybackSessionComponentClass;      // 0x00A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDelMarGhostRecordingSessionComponent> GhostRecordingSessionComponentClass;    // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        BestRunTime;                                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarGhostPlaybackSessionComponent> CachedPlaybackSession;                // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UDelMarGhostRecordingSessionComponent> CachedRecordingSession;              // 0x00C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarChallengeRaceManager> CachedRaceManager;                             // 0x00C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerState>        CachedLocalPlayerState;                            // 0x00D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarChallengeGhostSystemControllerComponent">();
	}
	static class UDelMarChallengeGhostSystemControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarChallengeGhostSystemControllerComponent>();
	}
};

// Class DelMarCore.DelMarRaceManager
// 0x0218 (0x04A8 - 0x0290)
class ADelMarRaceManager : public AActor
{
public:
	uint8                                         Pad_290[0x90];                                     // 0x0290(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnRaceFinished;                                    // 0x0320(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceStarted;                                     // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceCountdownStarted;                            // 0x0340(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRaceReset;                                       // 0x0350(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState)> OnPlayerFinishedRace;        // 0x0360(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState)> OnPlayerLapComplete;         // 0x0370(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerState* PlayerState)> OnPlayerResetRun;            // 0x0380(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bRaceStarted;                                      // 0x0390(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRaceFinished;                                     // 0x0391(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerState*>               SpectatorPlayerStates;                             // 0x0398(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class AFortPlayerState*>               ActiveRacerPlayerStates;                           // 0x03A8(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UDelMarRaceConfigComponent*             RaceConfig;                                        // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ADelMarRaceLevelConfig>  ActiveRaceLevelConfig;                             // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarTimeManagerComponent*            TimeManager;                                       // 0x03C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarRespawnManagerComponent*         RespawnManager;                                    // 0x03D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarCheckpointManagerComponent*      CheckpointManager;                                 // 0x03D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarRubberbandingManagerComponent*   RubberbandingManager;                              // 0x03E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarPositionalTrackerComponent*      PositionalTracker;                                 // 0x03E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarEliminationRaceManagerComponent* EliminationManager;                                // 0x03F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarGlobalInputDisabler*             InputDisablerComponent;                            // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDelMarMatchEventSystemComponent*       MatchEventSystemComponent;                         // 0x0400(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class AFortPlayerState*>                 ManagedPlayerStates;                               // 0x0408(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TWeakObjectPtr<class AFortPlayerState>>  InactivePlayerStates;                              // 0x0458(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void FinalizeRegisteredPlayerInitialization(class AFortPlayerState* PlayerState);
	void FinishRace();
	void HandleRegisteredPlayerPawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
	void NetMulticast_FinishRace(double RaceFinishedTime);
	void NetMulticast_ResetRace(bool bNextRound);
	void NetMulticast_ResetRun(const class AFortPlayerState* InPlayerState, bool bPlayerTriggered);
	void OnRep_ActiveRaceLevelConfig();
	void RegisterPlayerController(class AController* InController);
	void RegisterPlayerState(class AFortPlayerState* InPlayerState);
	void RequestCountdownForPlayer(class AFortPlayerState* PlayerState);
	void RequestStartRace(bool bSkipCountdown);
	void ResetRace(bool bIsRoundReset);
	void ResetRun(class AFortPlayerState* PlayerState, bool bPlayerTriggered);
	void SetActiveRaceLevelConfig(class ADelMarRaceLevelConfig* InRaceLevelConfig);
	void SetPlayerAsSpectator(class AFortPlayerState* PlayerState);
	void SetSpectatorAsPlayer(class AFortPlayerState* PlayerState);
	void UnregisterAllPlayers(bool bSetAsInactive);
	void UnregisterPlayerController(class AController* InController, bool bSetAsInactive);
	void UnregisterPlayerState(class AFortPlayerState* InPlayerState, bool bSetAsInactive);

	class ADelMarRaceLevelConfig* GetActiveRaceLevelConfig() const;
	TArray<class AFortPlayerState*> GetActiveRacers() const;
	EDelMarRaceMode GetCurrentRaceMode() const;
	EDelMarRaceSpawnMode GetCurrentSpawnMode() const;
	class UDelMarEliminationRaceManagerComponent* GetEliminationManagerComponent() const;
	TArray<class AFortPlayerState*> GetManagedPlayerStatesArray() const;
	int32 GetNumberOfLapsForRace() const;
	int32 GetNumInactiveRacers() const;
	class UDelMarPositionalTrackerComponent* GetPositionalTracker() const;
	class UDelMarRaceConfigComponent* GetRaceConfig() const;
	class UDelMarRespawnManagerComponent* GetRespawnManagerComponent() const;
	class UDelMarRubberbandingManagerComponent* GetRubberbandingManager() const;
	TArray<class AFortPlayerState*> GetSpectators() const;
	class UDelMarTimeManagerComponent* GetTimeManager() const;
	bool IsActiveRacer(const class AFortPlayerState* PlayerState) const;
	bool IsSpectator(const class AFortPlayerState* PlayerState) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRaceManager">();
	}
	static class ADelMarRaceManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarRaceManager>();
	}
};

// Class DelMarCore.DelMarChallengeRaceManager
// 0x0010 (0x04B8 - 0x04A8)
class ADelMarChallengeRaceManager final : public ADelMarRaceManager
{
public:
	bool                                          bIsOvertime;                                       // 0x04A8(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           OvertimeTimer;                                     // 0x04B0(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void NetMulticast_StartOvertime(const double RaceFinishTimestamp);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarChallengeRaceManager">();
	}
	static class ADelMarChallengeRaceManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADelMarChallengeRaceManager>();
	}
};

// Class DelMarCore.DelMarStateMachine
// 0x0108 (0x01A8 - 0x00A0)
class UDelMarStateMachine : public UActorComponent
{
public:
	TArray<struct FDelMarStateOverride>           StateOverrides;                                    // 0x00A0(0x0010)(ZeroConstructor, Transient, Config, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, TSubclassOf<class UDelMarState>> StateMappings;                        // 0x00B0(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTag                           RequestedStateTag;                                 // 0x0100(0x0004)(Edit, Net, DisableEditOnTemplate, EditConst, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           CurrentStateTag;                                   // 0x0104(0x0004)(Edit, DisableEditOnTemplate, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           DefaultStateTag;                                   // 0x0108(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDelMarState*>                   ActiveStates;                                      // 0x0110(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UDelMarState*>                   ReplicatedStates;                                  // 0x0120(0x0010)(Net, ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTag                           WaitingForStateReplicationTag;                     // 0x0130(0x0004)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_134[0x74];                                     // 0x0134(0x0074)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_RequestedStateTag();
	void RequestState(const struct FGameplayTag& StateTag);

	class UDelMarState* GetActiveStateByTag(const struct FGameplayTag& GameplayTag) const;
	class UDelMarState* GetCurrentState() const;
	struct FGameplayTag GetCurrentStateTag() const;
	struct FGameplayTag GetRequestedStateTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarStateMachine">();
	}
	static class UDelMarStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarStateMachine>();
	}
};

// Class DelMarCore.DelMarState
// 0x0008 (0x0030 - 0x0028)
class UDelMarState : public UObject
{
public:
	struct FGameplayTag                           StateTag;                                          // 0x0028(0x0004)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarState">();
	}
	static class UDelMarState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarState>();
	}
};

// Class DelMarCore.DelMarRacerState
// 0x0000 (0x0030 - 0x0030)
class UDelMarRacerState : public UDelMarState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRacerState">();
	}
	static class UDelMarRacerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRacerState>();
	}
};

// Class DelMarCore.DelMarRacerState_WithSpectatorTransitionBase
// 0x0000 (0x0030 - 0x0030)
class UDelMarRacerState_WithSpectatorTransitionBase : public UDelMarRacerState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRacerState_WithSpectatorTransitionBase">();
	}
	static class UDelMarRacerState_WithSpectatorTransitionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRacerState_WithSpectatorTransitionBase>();
	}
};

// Class DelMarCore.DelMarChallengeRacerState_RunActive
// 0x0000 (0x0030 - 0x0030)
class UDelMarChallengeRacerState_RunActive final : public UDelMarRacerState_WithSpectatorTransitionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarChallengeRacerState_RunActive">();
	}
	static class UDelMarChallengeRacerState_RunActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarChallengeRacerState_RunActive>();
	}
};

// Class DelMarCore.DelMarRacerStateMachineComponent
// 0x0030 (0x01D8 - 0x01A8)
class UDelMarRacerStateMachineComponent : public UDelMarStateMachine
{
public:
