#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarFrontend

#include "Basic.hpp"

#include "EpicMediaBasePlayer_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DelMarFrontend.DelMarFrontendCheatManager
// 0x0000 (0x0028 - 0x0028)
class UDelMarFrontendCheatManager final : public UChildCheatManager
{
public:
	void DelMarMarkTutorialPlayed();
	void DelMarResetNux();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarFrontendCheatManager">();
	}
	static class UDelMarFrontendCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarFrontendCheatManager>();
	}
};

// Class DelMarFrontend.DelMarFrontendExperienceFlow
// 0x0160 (0x0188 - 0x0028)
class UDelMarFrontendExperienceFlow final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CachedPlayerController;                            // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   VideoPlayerClass;                                  // 0x0038(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAthenaConfirmationWindow>  ConfirmationWindowClass;                           // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   TutorialPromptTitle;                               // 0x0060(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   TutorialPromptDescription;                         // 0x0070(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   TutorialPromptConfirmButtonText;                   // 0x0080(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   TutorialPromptDeclineButtonText;                   // 0x0090(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   SpeedRunPromptTitle;                               // 0x00A0(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   SpeedRunPromptDescription;                         // 0x00B0(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   SpeedRunPromptConfirmButtonText;                   // 0x00C0(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   SpeedRunPromptDeclineButtonText;                   // 0x00D0(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class UDelMarGameUserSettings*                DelMarUserSettings;                                // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            NUXTrailerRating;                                  // 0x00F0(0x0050)(Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x48];                                     // 0x0140(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FinishTrailerStep();
	void HandleVideoTerminalError(EBaseMediaTerminalErrorReason Reason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarFrontendExperienceFlow">();
	}
	static class UDelMarFrontendExperienceFlow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarFrontendExperienceFlow>();
	}
};

// Class DelMarFrontend.DelMarFrontendSubsystem
// 0x00C8 (0x00F8 - 0x0030)
class UDelMarFrontendSubsystem final : public UFortLocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AVehicleCosmeticsPreviewVehicle*        PreviewVehicle;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFrontendLobbyActor                    LobbyVehicleActorData;                             // 0x0040(0x0070)(Edit, NativeAccessSpecifierPrivate)
	struct FCosmeticLoadoutSlot                   LobbyVehicleDefaultBody;                           // 0x00B0(0x0020)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x28];                                      // 0x00D0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarFrontendSubsystem">();
	}
	static class UDelMarFrontendSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarFrontendSubsystem>();
	}
};

// Class DelMarFrontend.MatchmakingWidgetErrorVisualsForDelMar
// 0x0000 (0x0068 - 0x0068)
class UMatchmakingWidgetErrorVisualsForDelMar final : public UMatchmakingWidgetErrorVisualsContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchmakingWidgetErrorVisualsForDelMar">();
	}
	static class UMatchmakingWidgetErrorVisualsForDelMar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchmakingWidgetErrorVisualsForDelMar>();
	}
};

// Class DelMarFrontend.DelMarMatchmakingWidgetExtension
// 0x0030 (0x0058 - 0x0028)
class UDelMarMatchmakingWidgetExtension final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ModeSetButtonPrimaryText;                          // 0x0030(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortActivityModeSetSelectionModalBase> GameSelectionOverride;                 // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayGameSelectionOnContentStack;               // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                CustomHeadingWidget;                               // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarMatchmakingWidgetExtension">();
	}
	static class UDelMarMatchmakingWidgetExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarMatchmakingWidgetExtension>();
	}
};

// Class DelMarFrontend.DelMarRankedWidgetExtension
// 0x0028 (0x0050 - 0x0028)
class UDelMarRankedWidgetExtension final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   RankInfoModalOverride;                             // 0x0030(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarRankedWidgetExtension">();
	}
	static class UDelMarRankedWidgetExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarRankedWidgetExtension>();
	}
};

// Class DelMarFrontend.DelMarTrackSelectModal
// 0x0040 (0x0450 - 0x0410)
class UDelMarTrackSelectModal final : public UFortActivityModeSetSelectionModalBase
{
public:
	class UFortActivityPrivacyButton*             Button_ActivityPrivacy;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_428[0x28];                                     // 0x0428(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarTrackSelectModal">();
	}
	static class UDelMarTrackSelectModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarTrackSelectModal>();
	}
};

// Class DelMarFrontend.DelMarFrontendRuntimeOptions
// 0x0060 (0x0098 - 0x0038)
class UDelMarFrontendRuntimeOptions final : public URuntimeOptionsBase
{
public:
	class FString                                 FrontendNuxVideoKey;                               // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FrontendNuxVideoName;                              // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FrontendNuxVideoId;                                // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NuxVideoVersion;                                   // 0x0060(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysShowNuxVideo;                               // 0x0064(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableFrontendNuxFlow;                           // 0x0065(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableFrontendSpeedRunPrompt;                    // 0x0066(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFrontendSpeedRunPromptUsesTwoButtons;             // 0x0067(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DelMarTutorialLinkCode;                            // 0x0068(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DelMarSpeedRunLinkCode;                            // 0x0078(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DelMarDefaultLinkCode;                             // 0x0088(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UDelMarFrontendRuntimeOptions* GetDelMarFrontendRuntimeOptions();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DelMarFrontendRuntimeOptions">();
	}
	static class UDelMarFrontendRuntimeOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDelMarFrontendRuntimeOptions>();
	}
};

}

