#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarCore

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "DelMarCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "LinkId_structs.hpp"
#include "CosmeticsFrameworkLoadouts_structs.hpp"


namespace SDK::Params
{

// Function DelMarCore.DelMarAIController.HandleGroundedStateChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarAIController_HandleGroundedStateChanged final
{
public:
	TScriptInterface<class IDelMarVehicleInterface> VehicleRef;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarAIService.HandlePlayerRegistered
// 0x0008 (0x0008 - 0x0000)
struct DelMarAIService_HandlePlayerRegistered final
{
public:
	class AFortPlayerState*                       RegisteredPlayerState;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarAIService.HandlePlayerUnregistered
// 0x0010 (0x0010 - 0x0000)
struct DelMarAIService_HandlePlayerUnregistered final
{
public:
	class AFortPlayerState*                       UnregisteredPlayerState;                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAsInactive;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarAIService.GetMaxNumberOfPlayers
// 0x0004 (0x0004 - 0x0000)
struct DelMarAIService_GetMaxNumberOfPlayers final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarAIService.GetRegisteredAIBotControllers
// 0x0010 (0x0010 - 0x0000)
struct DelMarAIService_GetRegisteredAIBotControllers final
{
public:
	TArray<class ADelMarAIController*>            ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarBTService_FindDriveGoal.HandleKickflipActivated
// 0x0001 (0x0001 - 0x0000)
struct DelMarBTService_FindDriveGoal_HandleKickflipActivated final
{
public:
	bool                                          bLeft;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarBTService_FindDriveGoal.HandleVehicleAnyWheelsOnGroundStateChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarBTService_FindDriveGoal_HandleVehicleAnyWheelsOnGroundStateChanged final
{
public:
	TScriptInterface<class IDelMarVehicleInterface> VehicleRef;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnyWheelsOnGround;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarBTTask_DriveTrack.HandleVehicleAnyWheelsOnGroundStateChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarBTTask_DriveTrack_HandleVehicleAnyWheelsOnGroundStateChanged final
{
public:
	TScriptInterface<class IDelMarVehicleInterface> VehicleRef;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnyWheelsOnGround;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarBTTask_DriveTrack.TurboBonusZoneStateChanged
// 0x0001 (0x0001 - 0x0000)
struct DelMarBTTask_DriveTrack_TurboBonusZoneStateChanged final
{
public:
	EDelMarTurboZoneState                         NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.FinalizeRegisteredPlayerInitialization
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_FinalizeRegisteredPlayerInitialization final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.HandleRegisteredPlayerPawnSet
// 0x0018 (0x0018 - 0x0000)
struct DelMarRaceManager_HandleRegisteredPlayerPawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.NetMulticast_FinishRace
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_NetMulticast_FinishRace final
{
public:
	double                                        RaceFinishedTime;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.NetMulticast_ResetRace
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_NetMulticast_ResetRace final
{
public:
	bool                                          bNextRound;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.NetMulticast_ResetRun
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_NetMulticast_ResetRun final
{
public:
	const class AFortPlayerState*                 InPlayerState;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayerTriggered;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarRaceManager.RegisterPlayerController
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_RegisterPlayerController final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.RegisterPlayerState
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_RegisterPlayerState final
{
public:
	class AFortPlayerState*                       InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.RequestCountdownForPlayer
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_RequestCountdownForPlayer final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.RequestStartRace
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_RequestStartRace final
{
public:
	bool                                          bSkipCountdown;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.ResetRace
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_ResetRace final
{
public:
	bool                                          bIsRoundReset;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.ResetRun
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_ResetRun final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayerTriggered;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarRaceManager.SetActiveRaceLevelConfig
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_SetActiveRaceLevelConfig final
{
public:
	class ADelMarRaceLevelConfig*                 InRaceLevelConfig;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.SetPlayerAsSpectator
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_SetPlayerAsSpectator final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.SetSpectatorAsPlayer
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_SetSpectatorAsPlayer final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.UnregisterAllPlayers
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_UnregisterAllPlayers final
{
public:
	bool                                          bSetAsInactive;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.UnregisterPlayerController
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_UnregisterPlayerController final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAsInactive;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarRaceManager.UnregisterPlayerState
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_UnregisterPlayerState final
{
public:
	class AFortPlayerState*                       InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAsInactive;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarRaceManager.GetActiveRaceLevelConfig
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetActiveRaceLevelConfig final
{
public:
	class ADelMarRaceLevelConfig*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetActiveRacers
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_GetActiveRacers final
{
public:
	TArray<class AFortPlayerState*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetCurrentRaceMode
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_GetCurrentRaceMode final
{
public:
	EDelMarRaceMode                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetCurrentSpawnMode
// 0x0001 (0x0001 - 0x0000)
struct DelMarRaceManager_GetCurrentSpawnMode final
{
public:
	EDelMarRaceSpawnMode                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetEliminationManagerComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetEliminationManagerComponent final
{
public:
	class UDelMarEliminationRaceManagerComponent* ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetManagedPlayerStatesArray
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_GetManagedPlayerStatesArray final
{
public:
	TArray<class AFortPlayerState*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetNumberOfLapsForRace
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceManager_GetNumberOfLapsForRace final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetNumInactiveRacers
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceManager_GetNumInactiveRacers final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetPositionalTracker
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetPositionalTracker final
{
public:
	class UDelMarPositionalTrackerComponent*      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetRaceConfig
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetRaceConfig final
{
public:
	class UDelMarRaceConfigComponent*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetRespawnManagerComponent
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetRespawnManagerComponent final
{
public:
	class UDelMarRespawnManagerComponent*         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetRubberbandingManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetRubberbandingManager final
{
public:
	class UDelMarRubberbandingManagerComponent*   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetSpectators
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_GetSpectators final
{
public:
	TArray<class AFortPlayerState*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.GetTimeManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceManager_GetTimeManager final
{
public:
	class UDelMarTimeManagerComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManager.IsActiveRacer
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_IsActiveRacer final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarRaceManager.IsSpectator
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManager_IsSpectator final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarChallengeRaceManager.NetMulticast_StartOvertime
// 0x0008 (0x0008 - 0x0000)
struct DelMarChallengeRaceManager_NetMulticast_StartOvertime final
{
public:
	double                                        RaceFinishTimestamp;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarStateMachine.RequestState
// 0x0004 (0x0004 - 0x0000)
struct DelMarStateMachine_RequestState final
{
public:
	struct FGameplayTag                           StateTag;                                          // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarStateMachine.GetActiveStateByTag
// 0x0010 (0x0010 - 0x0000)
struct DelMarStateMachine_GetActiveStateByTag final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelMarState*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarStateMachine.GetCurrentState
// 0x0008 (0x0008 - 0x0000)
struct DelMarStateMachine_GetCurrentState final
{
public:
	class UDelMarState*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarStateMachine.GetCurrentStateTag
// 0x0004 (0x0004 - 0x0000)
struct DelMarStateMachine_GetCurrentStateTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarStateMachine.GetRequestedStateTag
// 0x0004 (0x0004 - 0x0000)
struct DelMarStateMachine_GetRequestedStateTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarSpectatorControllerComponent.ServerSetSpectatorTarget
// 0x0008 (0x0008 - 0x0000)
struct DelMarSpectatorControllerComponent_ServerSetSpectatorTarget final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarSpectatorControllerComponent.SetIsLateJoinSpectator
// 0x0001 (0x0001 - 0x0000)
struct DelMarSpectatorControllerComponent_SetIsLateJoinSpectator final
{
public:
	bool                                          bNewLateJoinSpectator;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarSpectatorControllerComponent.SetSpectatorTarget
// 0x0008 (0x0008 - 0x0000)
struct DelMarSpectatorControllerComponent_SetSpectatorTarget final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarSpectatorControllerComponent.IsLateJoinSpectator
// 0x0001 (0x0001 - 0x0000)
struct DelMarSpectatorControllerComponent_IsLateJoinSpectator final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.StartCountdownForPlayer
// 0x0018 (0x0018 - 0x0000)
struct DelMarTimeManagerComponent_StartCountdownForPlayer final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ServerCountdownStartTime;                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ServerRunStartTime;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.StartCountdownForRace
// 0x0018 (0x0018 - 0x0000)
struct DelMarTimeManagerComponent_StartCountdownForRace final
{
public:
	double                                        ServerCountdownStartTime;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ServerRunStartTime;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InServerCountdownIntervalTime;                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetRaceTimeRemaining
// 0x0008 (0x0008 - 0x0000)
struct DelMarTimeManagerComponent_GetRaceTimeRemaining final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetSecondsRemainingTillRaceStart
// 0x0008 (0x0008 - 0x0000)
struct DelMarTimeManagerComponent_GetSecondsRemainingTillRaceStart final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetSecondsSinceRaceStart
// 0x0008 (0x0008 - 0x0000)
struct DelMarTimeManagerComponent_GetSecondsSinceRaceStart final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetServerCountdownIntervalTime
// 0x0008 (0x0008 - 0x0000)
struct DelMarTimeManagerComponent_GetServerCountdownIntervalTime final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetServerRaceFinishTime
// 0x0008 (0x0008 - 0x0000)
struct DelMarTimeManagerComponent_GetServerRaceFinishTime final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarTimeManagerComponent.GetServerRaceStartTime
// 0x0008 (0x0008 - 0x0000)
struct DelMarTimeManagerComponent_GetServerRaceStartTime final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarCompetitiveRaceManager.HandleFinalRacePositionsUpdated
// 0x0060 (0x0060 - 0x0000)
struct DelMarCompetitiveRaceManager_HandleFinalRacePositionsUpdated final
{
public:
	TArray<struct FDelMarFinalRacePositionEntry>  FinalRacePositions;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDelMarEvent_RunRecorded               RecordedRun;                                       // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarConnectedHintComponent.HandleActorBeginOverlap
// 0x0010 (0x0010 - 0x0000)
struct DelMarConnectedHintComponent_HandleActorBeginOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarConnectedHintComponent.HandleActorEndOverlap
// 0x0010 (0x0010 - 0x0000)
struct DelMarConnectedHintComponent_HandleActorEndOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarConnectedHintComponent.PassNuxHintTypeToConnectedHintComponent
// 0x0004 (0x0004 - 0x0000)
struct DelMarConnectedHintComponent_PassNuxHintTypeToConnectedHintComponent final
{
public:
	struct FGameplayTag                           HintTypeTag;                                       // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarCoreOobTubePositionalRenderingComponent.HandleAIPawnSpawned
// 0x0010 (0x0010 - 0x0000)
struct DelMarCoreOobTubePositionalRenderingComponent_HandleAIPawnSpawned final
{
public:
	class AAIController*                          BotController;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              BotPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarCoreOobTubePositionalRenderingComponent.HandleViewTargetChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarCoreOobTubePositionalRenderingComponent_HandleViewTargetChanged final
{
public:
	class AFortPlayerController*                  FortPC;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OldViewTarget;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewViewTarget;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarCoreSplineMeshComponent.OnBeginActorOverlap
// 0x0110 (0x0110 - 0x0000)
struct DelMarCoreSplineMeshComponent_OnBeginActorOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarCosmeticsDatabase.GetItemsForSlot
// 0x0018 (0x0018 - 0x0000)
struct DelMarCosmeticsDatabase_GetItemsForSlot final
{
public:
	struct FGameplayTag                           Slot;                                              // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDelMarCosmeticItemDefinition*>  ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarCosmeticsDatabase.GetSlotInfos
// 0x0010 (0x0010 - 0x0000)
struct DelMarCosmeticsDatabase_GetSlotInfos final
{
public:
	TArray<struct FDelMarCosmeticSlotInfo>        ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarDriverInteractionComponent.HandleViewTargetChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarDriverInteractionComponent_HandleViewTargetChanged final
{
public:
	class AFortPlayerController*                  InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OldViewTarget;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewViewTarget;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarGhostSessionComponent.IsSessionActive
// 0x0001 (0x0001 - 0x0000)
struct DelMarGhostSessionComponent_IsSessionActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarGhostPlaybackSessionComponent.SetPlaybackLog
// 0x0008 (0x0008 - 0x0000)
struct DelMarGhostPlaybackSessionComponent_SetPlaybackLog final
{
public:
	class UDelMarGhostReplayLog*                  InLog;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarGhostPlaybackTrigger.BP_HandlePlaybackCompleted
// 0x0018 (0x0018 - 0x0000)
struct DelMarGhostPlaybackTrigger_BP_HandlePlaybackCompleted final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarGhostPlaybackTrigger.OnBeginOverlap
// 0x0110 (0x0110 - 0x0000)
struct DelMarGhostPlaybackTrigger_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarGhostRecordingSessionComponent.SetRecordOffPhysicsDelegate
// 0x0001 (0x0001 - 0x0000)
struct DelMarGhostRecordingSessionComponent_SetRecordOffPhysicsDelegate final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarGlobalLeaderboardControllerComponent.ClientNewPersonalBest
// 0x0048 (0x0048 - 0x0000)
struct DelMarGlobalLeaderboardControllerComponent_ClientNewPersonalBest final
{
public:
	struct FDelMarEvent_GlobalLeaderboardNewPersonalBest PersonalBestEvent;                          // 0x0000(0x0048)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarGlobalLeaderboardControllerComponent.ServerNewPersonalBest
// 0x0048 (0x0048 - 0x0000)
struct DelMarGlobalLeaderboardControllerComponent_ServerNewPersonalBest final
{
public:
	struct FDelMarEvent_GlobalLeaderboardNewPersonalBest PersonalBestRetrievedEvent;                 // 0x0000(0x0048)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarGuidedTutorialZoneActor.HandleVehicleDemolished
// 0x0004 (0x0004 - 0x0000)
struct DelMarGuidedTutorialZoneActor_HandleVehicleDemolished final
{
public:
	struct FGameplayTag                           CausedByTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarGuidedTutorialZoneActor.OnBeginOverlap
// 0x0110 (0x0110 - 0x0000)
struct DelMarGuidedTutorialZoneActor_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarGuidedTutorialZoneActor.OnEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct DelMarGuidedTutorialZoneActor_OnEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarInputModifierHazard.OnBeginOverlap
// 0x0110 (0x0110 - 0x0000)
struct DelMarInputModifierHazard_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPhysicsRateDevice.SetPhysicsRate
// 0x0001 (0x0001 - 0x0000)
struct DelMarPhysicsRateDevice_SetPhysicsRate final
{
public:
	EDelMarPhysicsRate                            PhysicsRate;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerActiveRaceManagerComponent.OnRep_ActiveRaceManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerActiveRaceManagerComponent_OnRep_ActiveRaceManager final
{
public:
	class ADelMarRaceManager*                     PreviousRaceManager;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerActiveRaceManagerComponent.SetActiveRaceManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerActiveRaceManagerComponent_SetActiveRaceManager final
{
public:
	class ADelMarRaceManager*                     RaceManager;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerActiveRaceManagerComponent.GetActiveRaceManager
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerActiveRaceManagerComponent_GetActiveRaceManager final
{
public:
	class ADelMarRaceManager*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerAnalyticsComponent.HandleDriftKickActivated
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerAnalyticsComponent_HandleDriftKickActivated final
{
public:
	float                                         DriftDirection;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDelMarVehicleDriftState                      DriftState;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarPlayerAnalyticsComponent.HandleKickflipActivated
// 0x0001 (0x0001 - 0x0000)
struct DelMarPlayerAnalyticsComponent_HandleKickflipActivated final
{
public:
	bool                                          bLeft;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerAnalyticsComponent.HandlePlayerResetRun
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerAnalyticsComponent_HandlePlayerResetRun final
{
public:
	class AFortPlayerState*                       PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerAnalyticsComponent.HandlePotentialDriftBoostChanged
// 0x0004 (0x0004 - 0x0000)
struct DelMarPlayerAnalyticsComponent_HandlePotentialDriftBoostChanged final
{
public:
	float                                         Percent;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerAnalyticsComponent.HandleTurboBonusZoneChanged
// 0x0001 (0x0001 - 0x0000)
struct DelMarPlayerAnalyticsComponent_HandleTurboBonusZoneChanged final
{
public:
	EDelMarTurboZoneState                         BonusZoneState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerAnalyticsComponent.HandleUnderthrustPercentChanged
// 0x0004 (0x0004 - 0x0000)
struct DelMarPlayerAnalyticsComponent_HandleUnderthrustPercentChanged final
{
public:
	float                                         PercentageUnderthrustRemaining;                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerAnalyticsComponent.HandleVehicleDemolished
// 0x0004 (0x0004 - 0x0000)
struct DelMarPlayerAnalyticsComponent_HandleVehicleDemolished final
{
public:
	struct FGameplayTag                           CausedByTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerAnalyticsComponent.HandleWorldBonusSpeedStackGained
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerAnalyticsComponent_HandleWorldBonusSpeedStackGained final
{
public:
	struct FGameplayTag                           Source;                                            // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stacks;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerRaceDataComponent.GetNumViewingSpectator
// 0x0004 (0x0004 - 0x0000)
struct DelMarPlayerRaceDataComponent_GetNumViewingSpectator final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerRaceDataComponent.GetViewingSpectators
// 0x0010 (0x0010 - 0x0000)
struct DelMarPlayerRaceDataComponent_GetViewingSpectators final
{
public:
	TArray<class APlayerState*>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerRaceDataComponent.NetMulticast_CheckpointPassed_ParallelPath
// 0x0010 (0x0010 - 0x0000)
struct DelMarPlayerRaceDataComponent_NetMulticast_CheckpointPassed_ParallelPath final
{
public:
	struct FDelMarEvent_CheckpointPassed_ParallelPath CheckpointEvent;                               // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerRaceDataComponent.NetMulticast_CheckpointPassedOutOfOrder_ParallelPath
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerRaceDataComponent_NetMulticast_CheckpointPassedOutOfOrder_ParallelPath final
{
public:
	struct FDelMarEvent_CheckpointPassedOutOfOrder_ParallelPath InCheckpointPassedOutOfOrderEvent;   // 0x0000(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerRaceDataComponent.NetMulticast_LapCompleted
// 0x0020 (0x0020 - 0x0000)
struct DelMarPlayerRaceDataComponent_NetMulticast_LapCompleted final
{
public:
	struct FDelMarEvent_LapComplete               InLapEvent;                                        // 0x0000(0x0020)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerRaceDataComponent.NetMulticast_RaceCompleted
// 0x0010 (0x0010 - 0x0000)
struct DelMarPlayerRaceDataComponent_NetMulticast_RaceCompleted final
{
public:
	double                                        RunTime;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValidRun;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarPlayerRaceDataComponent.NetMulticast_SectionCompleted_ParallelPath
// 0x0020 (0x0020 - 0x0000)
struct DelMarPlayerRaceDataComponent_NetMulticast_SectionCompleted_ParallelPath final
{
public:
	struct FDelMarEvent_SectionComplete_ParallelPath InSectionEvent;                                 // 0x0000(0x0020)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerRaceDataComponent.NetMulticast_TeleportEntered
// 0x0008 (0x0008 - 0x0000)
struct DelMarPlayerRaceDataComponent_NetMulticast_TeleportEntered final
{
public:
	struct FDelMarEvent_TeleportEnteredEvent      InCheckpointTeleportingEvent;                      // 0x0000(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerIdleComponent.OnPlayerDisconnected
// 0x0010 (0x0010 - 0x0000)
struct DelMarPlayerIdleComponent_OnPlayerDisconnected final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDisconnected;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarCore.DelMarPlayerQuestDistanceTraveledComponent.HandleVehicleDemolished
// 0x0004 (0x0004 - 0x0000)
struct DelMarPlayerQuestDistanceTraveledComponent_HandleVehicleDemolished final
{
public:
	struct FGameplayTag                           CausedByTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarPlayerQuestMatchInfoComponent.HandleVehicleDemolished
// 0x0004 (0x0004 - 0x0000)
struct DelMarPlayerQuestMatchInfoComponent_HandleVehicleDemolished final
{
public:
	struct FGameplayTag                           CausedByTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarProxyGhostVisualComponent.HandlePartCustomizationUpdated
// 0x0004 (0x0004 - 0x0000)
struct DelMarProxyGhostVisualComponent_HandlePartCustomizationUpdated final
{
public:
	int32                                         MeshPartIndex;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarProxyGhostVisualComponent.HandleViewTargetChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarProxyGhostVisualComponent_HandleViewTargetChanged final
{
public:
	class AFortPlayerController*                  InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OldViewTarget;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewViewTarget;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceLevelConfig.SpawnRaceManager
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceLevelConfig_SpawnRaceManager final
{
public:
	bool                                          bFireInitializationEvent;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADelMarRaceManager*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceLevelConfig.GetRaceManagerClass
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceLevelConfig_GetRaceManagerClass final
{
public:
	TSubclassOf<class ADelMarRaceManager>         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceLevelConfig.GetRaceModeTag
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceLevelConfig_GetRaceModeTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManagerVerbComponent.HandleFinalRacePositionsChanged
// 0x0060 (0x0060 - 0x0000)
struct DelMarRaceManagerVerbComponent_HandleFinalRacePositionsChanged final
{
public:
	TArray<struct FDelMarFinalRacePositionEntry>  FinalRacePositions;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDelMarEvent_RunRecorded               RecordedRun;                                       // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManagerVerbComponent.HandlePlayerLapCompleted
// 0x0020 (0x0020 - 0x0000)
struct DelMarRaceManagerVerbComponent_HandlePlayerLapCompleted final
{
public:
	struct FDelMarEvent_LapComplete               LapCompleteEvent;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DelMarCore.DelMarRaceManagerVerbComponent.HandlePlayerPositionsChanged
// 0x0010 (0x0010 - 0x0000)
struct DelMarRaceManagerVerbComponent_HandlePlayerPositionsChanged final
{
public:
