#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarDiorama

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DelMarCore_structs.hpp"


namespace SDK::Params
{

// Function DelMarDiorama.DelMarCockpitActor.BP_OnBoundVehicleChanged
// 0x0008 (0x0008 - 0x0000)
struct DelMarCockpitActor_BP_OnBoundVehicleChanged final
{
public:
	const class ADelMarVehicle*                   NewVehicle;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverCheatManager.DelMarDioramaOpenChannel
// 0x0001 (0x0001 - 0x0000)
struct DelMarDriverCheatManager_DelMarDioramaOpenChannel final
{
public:
	bool                                          bOpened;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverCheatManager.DelMarDioramaSetDriverReaction
// 0x0010 (0x0010 - 0x0000)
struct DelMarDriverCheatManager_DelMarDioramaSetDriverReaction final
{
public:
	class FString                                 ReactionTag;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverCheatManager.DelMarDioramaSetEnabled
// 0x0001 (0x0001 - 0x0000)
struct DelMarDriverCheatManager_DelMarDioramaSetEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverCheatManager.DelMarDioramaSetLightingChannel
// 0x0001 (0x0001 - 0x0000)
struct DelMarDriverCheatManager_DelMarDioramaSetLightingChannel final
{
public:
	bool                                          bMainChannel;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverCheatManager.DelMarDioramaSetLocation
// 0x000C (0x000C - 0x0000)
struct DelMarDriverCheatManager_DelMarDioramaSetLocation final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverCheatManager.DelMarDioramaSetVisibleInSceneCaptureOnly
// 0x0001 (0x0001 - 0x0000)
struct DelMarDriverCheatManager_DelMarDioramaSetVisibleInSceneCaptureOnly final
{
public:
	bool                                          bOnly;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverCheatManager.DelMarIntercomBroadcastEmote
// 0x0010 (0x0010 - 0x0000)
struct DelMarDriverCheatManager_DelMarIntercomBroadcastEmote final
{
public:
	class FString                                 EmoteTag;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverCheatManager.DelMarIntercomPlayInteraction
// 0x0010 (0x0010 - 0x0000)
struct DelMarDriverCheatManager_DelMarIntercomPlayInteraction final
{
public:
	class FString                                 InteractionTag;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverAnimInstance.IsDrivingSpeed
// 0x0001 (0x0001 - 0x0000)
struct DelMarDriverAnimInstance_IsDrivingSpeed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDioramaControllerComponent.HandleViewTargetChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarDioramaControllerComponent_HandleViewTargetChanged final
{
public:
	class AFortPlayerController*                  PC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Old;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewViewTarget;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverChannel.HandleDraftStateChanged
// 0x0001 (0x0001 - 0x0000)
struct DelMarDriverChannel_HandleDraftStateChanged final
{
public:
	EDelmarDraftingState                          DraftState;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverChannel.HandleDriftBoostActivated
// 0x0004 (0x0004 - 0x0000)
struct DelMarDriverChannel_HandleDriftBoostActivated final
{
public:
	float                                         PercentageMaxBoostGained;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverChannel.HandleSpeedChanged
// 0x0004 (0x0004 - 0x0000)
struct DelMarDriverChannel_HandleSpeedChanged final
{
public:
	float                                         NewSpeed;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverChannel.HandleStartlineBoostActivated
// 0x0004 (0x0004 - 0x0000)
struct DelMarDriverChannel_HandleStartlineBoostActivated final
{
public:
	float                                         PercentageSpeedEarned;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverChannel.HandleVehicleDemolished
// 0x0004 (0x0004 - 0x0000)
struct DelMarDriverChannel_HandleVehicleDemolished final
{
public:
	struct FGameplayTag                           CausedByTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarDriverChannel.HandleVehicleHitWall
// 0x0028 (0x0028 - 0x0000)
struct DelMarDriverChannel_HandleVehicleHitWall final
{
public:
	float                                         ImpactMagnitude;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldLocation;                                     // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardRotationDegrees;                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarDiorama.DelMarDriverChannel.HandleVehicleLanded
// 0x0008 (0x0008 - 0x0000)
struct DelMarDriverChannel_HandleVehicleLanded final
{
public:
	float                                         LandingForce;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandedKickflip;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarDiorama.DelMarDriverChannel.HandleVehicleSpawned
// 0x0002 (0x0002 - 0x0000)
struct DelMarDriverChannel_HandleVehicleSpawned final
{
public:
	bool                                          bFirstCar;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrevCarDemolished;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarIntercomComponent.ClientReceiveEmote
// 0x0010 (0x0010 - 0x0000)
struct DelMarIntercomComponent_ClientReceiveEmote final
{
public:
	struct FGameplayTag                           EmoteTag;                                          // 0x0000(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           Instigator;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarIntercomComponent.ClientReceiveInteraction
// 0x0018 (0x0018 - 0x0000)
struct DelMarIntercomComponent_ClientReceiveInteraction final
{
public:
	struct FGameplayTag                           InteractionTag;                                    // 0x0000(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerState*                     Instigator;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class APlayerState*                     Receiver;                                          // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarIntercomComponent.HandleViewTargetChanged
// 0x0018 (0x0018 - 0x0000)
struct DelMarIntercomComponent_HandleViewTargetChanged final
{
public:
	class AFortPlayerController*                  InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OldViewTarget;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewViewTarget;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarIntercomComponent.ServerReceiveEmote
// 0x0004 (0x0004 - 0x0000)
struct DelMarIntercomComponent_ServerReceiveEmote final
{
public:
	struct FGameplayTag                           EmoteTag;                                          // 0x0000(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarDiorama.DelMarIntercomComponent.ServerReceiveInteraction
// 0x0010 (0x0010 - 0x0000)
struct DelMarIntercomComponent_ServerReceiveInteraction final
{
public:
	struct FGameplayTag                           EmoteTag;                                          // 0x0000(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class APlayerState*                     Receiver;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

