#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum DelMarCore.EDelmarDraftingState
// NumValues: 0x0006
enum class EDelmarDraftingState : uint8
{
	NotActive                                = 0,
	HasTarget                                = 1,
	GainingSpeed                             = 2,
	GracePeriod                              = 3,
	LosingSpeed                              = 4,
	EDelmarDraftingState_MAX                 = 5,
};

// Enum DelMarCore.EDelMarVehicleDriftState
// NumValues: 0x0008
enum class EDelMarVehicleDriftState : uint8
{
	NotDrifting                              = 0,
	Drifting                                 = 1,
	InitialKick                              = 2,
	SwapKick                                 = 3,
	ExitVelocity                             = 4,
	ExitForward                              = 5,
	ForcedDrift                              = 6,
	EDelMarVehicleDriftState_MAX             = 7,
};

// Enum DelMarCore.EDelMarTurboZoneState
// NumValues: 0x0007
enum class EDelMarTurboZoneState : uint8
{
	None                                     = 0,
	Visible                                  = 1,
	Failed                                   = 2,
	Active                                   = 3,
	Success                                  = 4,
	Missed                                   = 5,
	EDelMarTurboZoneState_MAX                = 6,
};

// Enum DelMarCore.EDelMarVehicleForwardState
// NumValues: 0x0005
enum class EDelMarVehicleForwardState : uint8
{
	None                                     = 0,
	ForwardAccel                             = 1,
	Braking                                  = 2,
	Reversing                                = 3,
	EDelMarVehicleForwardState_MAX           = 4,
};

// Enum DelMarCore.EDelMarSplineMovementType
// NumValues: 0x0004
enum class EDelMarSplineMovementType : uint8
{
	OneShot                                  = 0,
	Repeat                                   = 1,
	PingPong                                 = 2,
	EDelMarSplineMovementType_MAX            = 3,
};

// Enum DelMarCore.EDelMarFloatOperation
// NumValues: 0x0008
enum class EDelMarFloatOperation : uint8
{
	DMFO_Set                                 = 0,
	DMFO_Add                                 = 1,
	DMFO_Subtract                            = 2,
	DMFO_Multiply                            = 3,
	DMFO_BaseMultiply                        = 4,
	DMFO_Divide                              = 5,
	DMFO_Min                                 = 6,
	DMFO_Max                                 = 7,
};

// Enum DelMarCore.EDelMarModifierStackingPolicy
// NumValues: 0x0004
enum class EDelMarModifierStackingPolicy : uint8
{
	DMSP_Allow                               = 0,
	DMSP_DontAdd                             = 1,
	DMSP_ClearOthers                         = 2,
	DMSP_MAX                                 = 3,
};

// Enum DelMarCore.EDelMarGlobalLeaderboardType
// NumValues: 0x0004
enum class EDelMarGlobalLeaderboardType : uint8
{
	Top                                      = 0,
	Focused                                  = 1,
	Friend                                   = 2,
	EDelMarGlobalLeaderboardType_MAX         = 3,
};

// Enum DelMarCore.EDelMarNetModel
// NumValues: 0x0003
enum class EDelMarNetModel : uint8
{
	ClientAuthoritative                      = 0,
	ChaosRollback                            = 1,
	EDelMarNetModel_MAX                      = 2,
};

// Enum DelMarCore.EDelMarJellyHazardProcessorInfo
// NumValues: 0x0004
enum class EDelMarJellyHazardProcessorInfo : uint32
{
	None                                     = 0,
	WithoutJellyHazardHit                    = 1,
	WithJellyHazardHit                       = 2,
	EDelMarJellyHazardProcessorInfo_MAX      = 3,
};

// Enum DelMarCore.EDelMarDemolishedProcessorInfo
// NumValues: 0x0004
enum class EDelMarDemolishedProcessorInfo : uint32
{
	None                                     = 0,
	WithoutDemolish                          = 1,
	WithDemolish                             = 2,
	EDelMarDemolishedProcessorInfo_MAX       = 3,
};

// Enum DelMarCore.EDelMarPositionChangeInfo
// NumValues: 0x0004
enum class EDelMarPositionChangeInfo : uint8
{
	None                                     = 0,
	PassPlayer                               = 1,
	PassedByPlayer                           = 2,
	EDelMarPositionChangeInfo_MAX            = 3,
};

// Enum DelMarCore.EDelMarPlaylistTypeInfo
// NumValues: 0x0004
enum class EDelMarPlaylistTypeInfo : uint8
{
	Any                                      = 0,
	Casual                                   = 1,
	Ranked                                   = 2,
	EDelMarPlaylistTypeInfo_MAX              = 3,
};

// Enum DelMarCore.EDelMarPhysicsRate
// NumValues: 0x0004
enum class EDelMarPhysicsRate : uint8
{
	ThirtyHz                                 = 0,
	SixtyHz                                  = 1,
	OneHundredTwentyHz                       = 2,
	EDelMarPhysicsRate_MAX                   = 3,
};

// Enum DelMarCore.EDelMarSplineGenerationMode
// NumValues: 0x0003
enum class EDelMarSplineGenerationMode : uint8
{
	PerSplinePoint                           = 0,
	UserAmount                               = 1,
	EDelMarSplineGenerationMode_MAX          = 2,
};

// Enum DelMarCore.EDelMarRaceMode
// NumValues: 0x0006
enum class EDelMarRaceMode : uint8
{
	ChallengeMode                            = 0,
	CompetitiveMode                          = 1,
	DeathRaceMode                            = 2,
	TutorialRaceMode                         = 3,
	Invalid                                  = 4,
	EDelMarRaceMode_MAX                      = 5,
};

// Enum DelMarCore.EDelMarInvertSteerMethod
// NumValues: 0x0006
enum class EDelMarInvertSteerMethod : uint8
{
	CeilingAngle                             = 0,
	CeilingTimeDelay                         = 1,
	CeilingReleaseInput                      = 2,
	Never                                    = 3,
	Always                                   = 4,
	EDelMarInvertSteerMethod_MAX             = 5,
};

// Enum DelMarCore.EDelMarKickflipDirection
// NumValues: 0x000A
enum class EDelMarKickflipDirection : uint8
{
	None                                     = 0,
	Up                                       = 1,
	Down                                     = 2,
	Left                                     = 3,
	Right                                    = 4,
	UpLeft                                   = 5,
	DownLeft                                 = 6,
	UpRight                                  = 7,
	DownRight                                = 8,
	EDelMarKickflipDirection_MAX             = 9,
};

// Enum DelMarCore.EDelMarVehicleWheelIndex
// NumValues: 0x0006
enum class EDelMarVehicleWheelIndex : uint8
{
	FrontLeft                                = 0,
	FrontRight                               = 1,
	BackLeft                                 = 2,
	BackRight                                = 3,
	Num                                      = 4,
	EDelMarVehicleWheelIndex_MAX             = 5,
};

// Enum DelMarCore.EMixModifierTarget
// NumValues: 0x0004
enum class EMixModifierTarget : uint8
{
	Volume                                   = 0,
	Pitch                                    = 1,
	LowpassFrequency                         = 2,
	EMixModifierTarget_MAX                   = 3,
};

// Enum DelMarCore.EDelMarCheckpointMeshType
// NumValues: 0x0004
enum class EDelMarCheckpointMeshType : uint8
{
	Default                                  = 0,
	StartLine                                = 1,
	FinishLine                               = 2,
	EDelMarCheckpointMeshType_MAX            = 3,
};

// Enum DelMarCore.EDelMarTimerDirection
// NumValues: 0x0003
enum class EDelMarTimerDirection : uint8
{
	CountUp                                  = 0,
	CountDown                                = 1,
	EDelMarTimerDirection_MAX                = 2,
};

// Enum DelMarCore.EDelMarPostRaceVote
// NumValues: 0x0004
enum class EDelMarPostRaceVote : uint8
{
	Unset                                    = 0,
	PlayAgain                                = 1,
	NextMap                                  = 2,
	MAX                                      = 3,
};

// Enum DelMarCore.EDelMarVehicleCollisionOverrideSetting
// NumValues: 0x0004
enum class EDelMarVehicleCollisionOverrideSetting : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Unset                                    = 2,
	Max                                      = 3,
};

// Enum DelMarCore.EDelMarRaceSpawnMode
// NumValues: 0x0005
enum class EDelMarRaceSpawnMode : uint8
{
	SpawnAtMostRecentSplinePoint             = 0,
	SpawnAtMostRecentCheckpoint              = 1,
	SpawnAtRaceStart                         = 2,
	NoAutomaticRespawn                       = 3,
	EDelMarRaceSpawnMode_MAX                 = 4,
};

// Enum DelMarCore.EDelMarPostMatchFlows
// NumValues: 0x0003
enum class EDelMarPostMatchFlows : uint8
{
	PlayTogetherFlow                         = 0,
	PlayTrackFlow                            = 1,
	EDelMarPostMatchFlows_MAX                = 2,
};

// Enum DelMarCore.EDelMarPostMatchState
// NumValues: 0x000C
enum class EDelMarPostMatchState : uint8
{
	WaitingForParty                          = 0,
	WaitingForLobby                          = 1,
	StartingNextRace                         = 2,
	MatchmakingStarted                       = 3,
	MatchmakingSucceeded                     = 4,
	MatchmakingFailed                        = 5,
	MatchmakingCancelled                     = 6,
	Idle                                     = 7,
	Failed                                   = 8,
	Completed                                = 9,
	INVALID                                  = 10,
	EDelMarPostMatchState_MAX                = 11,
};

// ScriptStruct DelMarCore.DelMarLapRecord
// 0x0018 (0x0018 - 0x0000)
struct FDelMarLapRecord final
{
public:
	double                                        LapDuration;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<double>                                SectionTimes;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarRunRecord
// 0x0020 (0x0020 - 0x0000)
struct FDelMarRunRecord final
{
public:
	double                                        RunDuration;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RunStartTimestamp;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDelMarLapRecord>               LapRecords;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarEvent_SectionRecorded
// 0x0050 (0x0050 - 0x0000)
struct FDelMarEvent_SectionRecorded final
{
public:
	int32                                         ActiveLap;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDelMarRunRecord                       BestSectionsRunRecord;                             // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	struct FDelMarRunRecord                       CurrentRunRecord;                                  // 0x0028(0x0020)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	bool                                          bIsNewSectionRecord;                               // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarAIDifficultySpawnInfo
// 0x0008 (0x0008 - 0x0000)
struct FDelMarAIDifficultySpawnInfo final
{
public:
	int32                                         SkillLevel;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BotFillPercentage;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarAIMMRSpawnDataTableRow
// 0x0020 (0x0028 - 0x0008)
struct FDelMarAIMMRSpawnDataTableRow final : public FTableRowBase
{
public:
	int32                                         MMRBracketLow;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MMRBracketHigh;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FallbackSkillLevel;                                // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDelMarAIDifficultySpawnInfo>   BotSpawnInfo;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarEvent_PostRaceReturnToLobbySelected
// 0x0001 (0x0001 - 0x0000)
struct FDelMarEvent_PostRaceReturnToLobbySelected final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarInputMappingContextData
// 0x0010 (0x0010 - 0x0000)
struct FDelMarInputMappingContextData final
{
public:
	int32                                         Priority;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInputMappingContext*               MappingContext;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarAIVehicleCosmeticSlotDataTableInfo
// 0x0040 (0x0040 - 0x0000)
struct FDelMarAIVehicleCosmeticSlotDataTableInfo final
{
public:
	TSoftObjectPtr<class UCosmeticLoadoutSlotTemplate> SlotTemplate;                                 // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              VehicleSlotCosmeticDataTable;                      // 0x0020(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVerbMessageBase
// 0x00C0 (0x0138 - 0x0078)
struct FDelMarVerbMessageBase : public FVerbMessage
{
public:
	struct FSubjectTagsPair                       LevelDescriptionId;                                // 0x0078(0x0038)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FSubjectTagsPair                       GameModeId;                                        // 0x00B0(0x0038)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FSubjectTagsPair                       VehicleTags;                                       // 0x00E8(0x0038)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	EDelMarPlaylistTypeInfo                       RankedPlaylistInfo;                                // 0x0120(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortVerb_ObjectWrapper>        Cosmetics;                                         // 0x0128(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct DelMarCore.DelMarVerbMessage_DriftBoostActivated
// 0x0008 (0x0140 - 0x0138)
struct FDelMarVerbMessage_DriftBoostActivated final : public FDelMarVerbMessageBase
{
public:
	float                                         DriftBoostPercent;                                 // 0x0138(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarCosmeticLoadoutSlotData
// 0x0040 (0x0040 - 0x0000)
struct FDelMarCosmeticLoadoutSlotData final
{
public:
	TSoftObjectPtr<class UCosmeticLoadoutSlotTemplate> SlotTemplate;                                 // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 EquippedItemDefinitionObject;                      // 0x0020(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarGlobalLeaderboardEntry
// 0x0040 (0x0040 - 0x0000)
struct FDelMarGlobalLeaderboardEntry final
{
public:
	class FString                                 PlayerAccountId;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerName;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RunDuration;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Rank;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Percentile;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalPlayer;                                    // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarEvent_GlobalLeaderboardNewPersonalBest
// 0x0048 (0x0048 - 0x0000)
struct FDelMarEvent_GlobalLeaderboardNewPersonalBest final
{
public:
	TWeakObjectPtr<class AFortPlayerState>        Player;                                            // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDelMarGlobalLeaderboardEntry          PersonalBest;                                      // 0x0008(0x0040)(Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarAIVehicleCosmeticLoadoutSetDataTableRow
// 0x0018 (0x0020 - 0x0008)
struct FDelMarAIVehicleCosmeticLoadoutSetDataTableRow final : public FTableRowBase
{
public:
	TArray<struct FDelMarCosmeticLoadoutSlotData> LoadoutSlots;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarVehicleOutPersistent
// 0x0A28 (0x0A50 - 0x0028)
struct alignas(0x10) FDelMarVehicleOutPersistent final : public FFortVehicleOutPersistent
{
public:
	uint8                                         Pad_28[0xA28];                                     // 0x0028(0x0A28)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarAIVehicleCosmeticSlotDataTableRow
// 0x0028 (0x0030 - 0x0008)
struct FDelMarAIVehicleCosmeticSlotDataTableRow final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UObject>                 EquippedItemDefinitionObject;                      // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.AvoidanceInfo
// 0x0080 (0x0080 - 0x0000)
struct FAvoidanceInfo final
{
public:
	TMap<TWeakObjectPtr<class AActor>, class UDriveHazardInfo*> DriveHazardInfoMap;                  // 0x0000(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UDriveHazardInfo*>               NonJumpableDriveHazardInfos;                       // 0x0050(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UDriveHazardInfo*>               JumpableDriveHazardInfos;                          // 0x0060(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarVerbMessage_InitialTurboActivated
// 0x0000 (0x0138 - 0x0138)
struct FDelMarVerbMessage_InitialTurboActivated final : public FDelMarVerbMessageBase
{
};

// ScriptStruct DelMarCore.DelMarCosmeticSlotInfo
// 0x0050 (0x0050 - 0x0000)
struct FDelMarCosmeticSlotInfo final
{
public:
	struct FGameplayTag                           SlotTag;                                           // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SlotName;                                          // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ShortDescription;                                  // 0x0018(0x0010)(Edit, NativeAccessSpecifierPublic)
	bool                                          bCanBeEmpty;                                       // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              UnassignedPreviewImage;                            // 0x0030(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarEvent_PostRaceNextRaceSelected
// 0x0001 (0x0001 - 0x0000)
struct FDelMarEvent_PostRaceNextRaceSelected final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarEvent_DriverInteractionAdded
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FDelMarEvent_DriverInteractionAdded final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarActivatedInput
// 0x0020 (0x0020 - 0x0000)
struct FDelMarActivatedInput final
{
public:
	class UInputAction*                           Action;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Rubberbanding
// 0x0004 (0x0004 - 0x0000)
struct FDelMarVehicleReplicatedState_Rubberbanding final
{
public:
	float                                         AppliedBonusSpeed;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarEventRouterExt
// 0x0018 (0x0018 - 0x0000)
struct FDelMarEventRouterExt final
{
public:
	bool                                          bWorldIsTearingDown;                               // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayEventRouterComponent*          EventRouter;                                       // 0x0008(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EventRouterContextObject;                          // 0x0010(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarGameplayStateChangedEvent
// 0x0008 (0x0008 - 0x0000)
struct FDelMarGameplayStateChangedEvent final
{
public:
	struct FGameplayTag                           PrevStateId;                                       // 0x0000(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NewStateId;                                        // 0x0004(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarEvent_MissedCheckpointDemoCountdown
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDelMarEvent_MissedCheckpointDemoCountdown final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarRaceCVar
// 0x0030 (0x0030 - 0x0000)
struct FDelMarRaceCVar final
{
public:
	class FString                                 VariableName;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarEvent_ResetRace
// 0x0001 (0x0001 - 0x0000)
struct FDelMarEvent_ResetRace final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarLeaderboardSettings
// 0x0020 (0x0020 - 0x0000)
struct FDelMarLeaderboardSettings final
{
public:
	class FString                                 EventId;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WindowId;                                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarEvent_ResetRun
// 0x0001 (0x0001 - 0x0000)
struct FDelMarEvent_ResetRun final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarVerbMessage_DistanceTraveled
// 0x0008 (0x0140 - 0x0138)
struct FDelMarVerbMessage_DistanceTraveled final : public FDelMarVerbMessageBase
{
public:
	float                                         TotalDistance;                                     // 0x0138(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarEvent_RaceFinished
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDelMarEvent_RaceFinished final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarEvent_FirstPlayerFinishedCountdown
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FDelMarEvent_FirstPlayerFinishedCountdown final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarEvent_LoadingScreenData
// 0x0010 (0x0010 - 0x0000)
struct FDelMarEvent_LoadingScreenData final
{
public:
	class UDelMarLevelDataAsset*                  LevelData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           RaceMode;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarVehicleAbilityConfig
// 0x0011 (0x0011 - 0x0000)
struct FDelMarVehicleAbilityConfig final
{
public:
	bool                                          bAirControlEnabled;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAirFreestyleEnabled;                              // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAirThrottleEnabled;                               // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoAerialRotationEnabled;                        // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoUprightEnabled;                               // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDraftingEnabled;                                  // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDriftEnabled;                                     // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDriftBoostEnabled;                                // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInfiniteUnderthrustEnabled;                       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJumpEnabled;                                      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKickflipEnabled;                                  // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOversteerEnabled;                                 // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReattachmentEnabled;                              // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartlineBoostEnabled;                            // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStrafeEnabled;                                    // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTurboEnabled;                                     // 0x000F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnderthrustEnabled;                               // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarEvent_RaceActive
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDelMarEvent_RaceActive final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarActivatedInputFrame
// 0x0018 (0x0018 - 0x0000)
struct FDelMarActivatedInputFrame final
{
public:
	float                                         duration;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDelMarActivatedInput>          Inputs;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarEvent_RunActive
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FDelMarEvent_RunActive final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarVehicleInContinuous
// 0x0000 (0x0040 - 0x0040)
struct FDelMarVehicleInContinuous final : public FFortAthenaVehicleInputState
{
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Ability
// 0x0008 (0x0008 - 0x0000)
struct FDelMarVehicleReplicatedState_Ability
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         duration;                                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_AutoUpright
// 0x0018 (0x0020 - 0x0008)
struct FDelMarVehicleReplicatedState_AutoUpright final : public FDelMarVehicleReplicatedState_Ability
{
public:
	struct FVector_NetQuantizeNormal              TargetVehicleUp;                                   // 0x0008(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_BonusSpeedAbility
// 0x0004 (0x000C - 0x0008)
struct FDelMarVehicleReplicatedState_BonusSpeedAbility : public FDelMarVehicleReplicatedState_Ability
{
public:
	float                                         AppliedBonusSpeed;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Drafting
// 0x000C (0x0018 - 0x000C)
struct FDelMarVehicleReplicatedState_Drafting final : public FDelMarVehicleReplicatedState_BonusSpeedAbility
{
public:
	float                                         AccumulatedLosingSpeedSeconds;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulatedStartDraftingSeconds;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalEarnedBonusSpeed;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Drift
// 0x0028 (0x0030 - 0x0008)
struct FDelMarVehicleReplicatedState_Drift final : public FDelMarVehicleReplicatedState_Ability
{
public:
	float                                         CurrentRotationAngle;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDelMarVehicleDriftState                      DriftState;                                        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TargetDriftSide;                                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantize100                 InitialImpulseTorque;                              // 0x0018(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_DriftBoost
// 0x0014 (0x0020 - 0x000C)
struct FDelMarVehicleReplicatedState_DriftBoost final : public FDelMarVehicleReplicatedState_BonusSpeedAbility
{
public:
	float                                         AccumulatedDriftBoostSeconds;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulatedWaitingPeriodSeconds;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalEarnedBonusSpeed;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         QueuedBonusSpeed;                                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         QueuedBoostExtraSeconds;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Drive
// 0x0030 (0x0030 - 0x0000)
struct FDelMarVehicleReplicatedState_Drive final
{
public:
	float                                         BaseTargetSpeed;                                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvertedSteeringActive;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bDisableDriveForces;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bDisableWheelFriction;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal              LastAverageWheelWorldContactNormal;                // 0x0010(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumLandingSpeed;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Kickflip
// 0x0058 (0x0060 - 0x0008)
struct FDelMarVehicleReplicatedState_Kickflip final : public FDelMarVehicleReplicatedState_Ability
{
public:
	struct FVector_NetQuantizeNormal              RelativeUpDirection;                               // 0x0008(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal              KickDirection;                                     // 0x0020(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeftSide;                                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTakeLongestRoll;                                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateTowardsVelocity;                            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanStartLongRoll;                                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartingRollSign;                                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KickflipKeybindPressTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActivationCharges;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal              StartingPrimaryDirection;                          // 0x0048(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Oversteer
// 0x0004 (0x0004 - 0x0000)
struct FDelMarVehicleReplicatedState_Oversteer final
{
public:
	float                                         AccumulatedSteer;                                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Reattachment
// 0x0020 (0x0028 - 0x0008)
struct FDelMarVehicleReplicatedState_Reattachment final : public FDelMarVehicleReplicatedState_Ability
{
public:
	struct FVector_NetQuantizeNormal              AttachmentDirection;                               // 0x0008(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanActivate;                                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_StartlineBoost
// 0x0008 (0x0014 - 0x000C)
struct FDelMarVehicleReplicatedState_StartlineBoost final : public FDelMarVehicleReplicatedState_BonusSpeedAbility
{
public:
	float                                         PercentageMaxBonusSpeedEarned;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFailedAttempt;                                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Strafe
// 0x0008 (0x0010 - 0x0008)
struct FDelMarVehicleReplicatedState_Strafe final : public FDelMarVehicleReplicatedState_Ability
{
public:
	bool                                          bLeftSide;                                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StrafeKeybindPressTime;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Turbo
// 0x000C (0x0018 - 0x000C)
struct FDelMarVehicleReplicatedState_Turbo final : public FDelMarVehicleReplicatedState_BonusSpeedAbility
{
public:
	int32                                         LastBonusZoneInteractionIndex;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccessfulBonusZone;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdditionalActiveSeconds;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_Underthrust
// 0x0004 (0x000C - 0x0008)
struct FDelMarVehicleReplicatedState_Underthrust final : public FDelMarVehicleReplicatedState_Ability
{
public:
	float                                         RemainingThrustSeconds;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState_AirControl
// 0x0004 (0x000C - 0x0008)
struct FDelMarVehicleReplicatedState_AirControl final : public FDelMarVehicleReplicatedState_Ability
{
public:
	float                                         AerialDivingBonusSpeed;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarInputBufferData
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x04) FDelMarInputBufferData final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarVehicleReplicatedState
// 0x0290 (0x0290 - 0x0000)
struct FDelMarVehicleReplicatedState final
{
public:
	int32                                         FrameNum;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDelMarVehicleInContinuous             Input;                                             // 0x0008(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigidBodyState                        RBState;                                           // 0x0050(0x0080)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_AutoUpright AutoUpright;                                    // 0x00D0(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_Drafting Drafting;                                          // 0x00F0(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_Drift    Drift;                                             // 0x0108(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_DriftBoost DriftBoost;                                      // 0x0138(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_Drive    Drive;                                             // 0x0158(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_Ability  Jump;                                              // 0x0188(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_Kickflip Kickflip;                                          // 0x0190(0x0060)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_Oversteer Oversteer;                                        // 0x01F0(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDelMarVehicleReplicatedState_Reattachment Reattachment;                                  // 0x01F8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_Rubberbanding Rubberbanding;                                // 0x0220(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_StartlineBoost StartlineBoost;                              // 0x0224(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_Strafe   Strafe;                                            // 0x0238(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_Turbo    Turbo;                                             // 0x0248(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_Underthrust Underthrust;                                    // 0x0260(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarVehicleReplicatedState_AirControl AirControl;                                      // 0x026C(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDelMarInputBufferData                 BufferData;                                        // 0x0278(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarEvent_OvertimeActive
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDelMarEvent_OvertimeActive final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarEvent_CountdownActive
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FDelMarEvent_CountdownActive final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarEvent_MidTutorialModal
// 0x0001 (0x0001 - 0x0000)
struct FDelMarEvent_MidTutorialModal final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarVehicleSuspensionConfig
// 0x0014 (0x0014 - 0x0000)
struct FDelMarVehicleSuspensionConfig final
{
public:
	float                                         MaxRaise;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDrop;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stiffness;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingCompression;                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingRelaxation;                                 // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarEvent_PlayerFinishedRace
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FDelMarEvent_PlayerFinishedRace final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DelMarCore.DelMarEvent_RacerStateChanged
// 0x0010 (0x0010 - 0x0000)
struct FDelMarEvent_RacerStateChanged final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PrevStateId;                                       // 0x0008(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NewStateId;                                        // 0x000C(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DelMarCore.DelMarVerbMessage_LapComplete
// 0x0010 (0x0148 - 0x0138)
struct FDelMarVerbMessage_LapComplete final : public FDelMarVerbMessageBase
{
public:
	double                                        LapCompleteTime;                                   // 0x0138(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
