#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DelMarAudio

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DelMarAudio_structs.hpp"
#include "DelMarCore_structs.hpp"


namespace SDK::Params
{

// Function DelMarAudio.DelMarAudioCheatManager.DelMarSetMusicTrigger
// 0x0004 (0x0004 - 0x0000)
struct DelMarAudioCheatManager_DelMarSetMusicTrigger final
{
public:
	class FName                                   TriggerName;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarAudioProximityComponentBase.BP_Update
// 0x0010 (0x0010 - 0x0000)
struct DelMarAudioProximityComponentBase_BP_Update final
{
public:
	const class APlayerCameraManager*             Camera;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ADelMarVehicle*                   Vehicle;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarAudioProximityComponentBase.CreateSoundAttached
// 0x0028 (0x0028 - 0x0000)
struct DelMarAudioProximityComponentBase_CreateSoundAttached final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        AttachComponent;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachPointName;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenAttachedToDestroyed;                      // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoDestroy;                                      // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        ReturnValue;                                       // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarAudioProximityComponent.GetObjectScale
// 0x0004 (0x0004 - 0x0000)
struct DelMarAudioProximityComponent_GetObjectScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarAudioPassbyComponent.BP_StartPassby
// 0x0010 (0x0010 - 0x0000)
struct DelMarAudioPassbyComponent_BP_StartPassby final
{
public:
	class AActor*                                 Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassbySpeed;                                       // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarAudio.DelMarAudioPassbyComponent.IsPlayingPassby
// 0x0001 (0x0001 - 0x0000)
struct DelMarAudioPassbyComponent_IsPlayingPassby final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarAudioStateMixerSubsystem.AddMixes
// 0x0018 (0x0018 - 0x0000)
struct DelMarAudioStateMixerSubsystem_AddMixes final
{
public:
	class FName                                   GroupName;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDelMarStateMix>                Mixes;                                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarAudioStateMixerSubsystem.ClearMixState
// 0x0008 (0x0008 - 0x0000)
struct DelMarAudioStateMixerSubsystem_ClearMixState final
{
public:
	struct FGameplayTag                           MixState;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeactivateChildren;                               // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarAudio.DelMarAudioStateMixerSubsystem.RemoveMixes
// 0x0004 (0x0004 - 0x0000)
struct DelMarAudioStateMixerSubsystem_RemoveMixes final
{
public:
	class FName                                   GroupName;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarAudioStateMixerSubsystem.SetMixState
// 0x0008 (0x0008 - 0x0000)
struct DelMarAudioStateMixerSubsystem_SetMixState final
{
public:
	struct FGameplayTag                           MixState;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFallBackToNearestParent;                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeactivateChildren;                               // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DelMarAudio.DelMarAudioStateMixerSubsystem.GetActiveMixes
// 0x0050 (0x0050 - 0x0000)
struct DelMarAudioStateMixerSubsystem_GetActiveMixes final
{
public:
	TMap<struct FGameplayTag, struct FDelMarStateMix> ReturnValue;                                   // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarAudioStatePlayspaceComponent.HandleVehicleDemolished
// 0x0004 (0x0004 - 0x0000)
struct DelMarAudioStatePlayspaceComponent_HandleVehicleDemolished final
{
public:
	struct FGameplayTag                           CausedByTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarCrowdAudioManager.BP_OnGameplayStateChanged
// 0x0004 (0x0004 - 0x0000)
struct DelMarCrowdAudioManager_BP_OnGameplayStateChanged final
{
public:
	struct FGameplayTag                           NewStateTag;                                       // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarCrowdAudioManager.BP_OnRaceModeChanged
// 0x0004 (0x0004 - 0x0000)
struct DelMarCrowdAudioManager_BP_OnRaceModeChanged final
{
public:
	struct FGameplayTag                           NewRaceModeTag;                                    // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarCrowdAudioManager.BP_OnRacerStateChanged
// 0x0004 (0x0004 - 0x0000)
struct DelMarCrowdAudioManager_BP_OnRacerStateChanged final
{
public:
	struct FGameplayTag                           NewStateTag;                                       // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarRaceMusicManager.BP_OnCountdownTimeSet
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceMusicManager_BP_OnCountdownTimeSet final
{
public:
	float                                         TimeUntilRunStart;                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarRaceMusicManager.BP_OnGameplayStateChanged
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceMusicManager_BP_OnGameplayStateChanged final
{
public:
	struct FGameplayTag                           NewStateTag;                                       // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarRaceMusicManager.BP_OnRaceModeChanged
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceMusicManager_BP_OnRaceModeChanged final
{
public:
	struct FGameplayTag                           NewModeTag;                                        // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarRaceMusicManager.BP_OnRacerStateChanged
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceMusicManager_BP_OnRacerStateChanged final
{
public:
	struct FGameplayTag                           NewStateTag;                                       // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarRaceMusicManager.HandleSpectatorViewTargetChange
// 0x0018 (0x0018 - 0x0000)
struct DelMarRaceMusicManager_HandleSpectatorViewTargetChange final
{
public:
	class AFortPlayerController*                  PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OldViewTarget;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewViewTarget;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarRaceMusicManager.SetAudioTrigger
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceMusicManager_SetAudioTrigger final
{
public:
	class FName                                   InTrigger;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarRaceMusicManager.SetPlaylist
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceMusicManager_SetPlaylist final
{
public:
	class UDelMarRaceMusicPlaylist*               InPlaylist;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarRaceMusicManager.SetPostRaceMusic
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceMusicManager_SetPostRaceMusic final
{
public:
	class USoundBase*                             InPostRaceMusic;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarRaceMusicManager.SetPreRaceMusic
// 0x0008 (0x0008 - 0x0000)
struct DelMarRaceMusicManager_SetPreRaceMusic final
{
public:
	class USoundBase*                             InPreRaceMusic;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarRaceMusicManager.StartStartLineMusic
// 0x0004 (0x0004 - 0x0000)
struct DelMarRaceMusicManager_StartStartLineMusic final
{
public:
	float                                         CountdownLength;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DelMarAudio.DelMarAudioVirtualizationSubsystem.HandleRaceModeChanged
// 0x0004 (0x0004 - 0x0000)
struct DelMarAudioVirtualizationSubsystem_HandleRaceModeChanged final
{
public:
	struct FDelMarEvent_RaceModeSet               Event;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

}

