#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicBacchusHUD

#include "Basic.hpp"

#include "DynamicUI_structs.hpp"
#include "DynamicUI_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class DynamicBacchusHUD.DynamicBacchusHUDDirector
// 0x01D8 (0x0488 - 0x02B0)
class ADynamicBacchusHUDDirector : public ADynamicUIDirectorBase
{
public:
	struct FDynamicUIWidgetTarget                 TouchControlRegionWidget;                          // 0x02B0(0x0078)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UFortMobileHUDWidgetRegistry*           BaseHUDWidgetRegistry;                             // 0x0328(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicUIScene*                        WatermarkScene;                                    // 0x0330(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UDynamicUIMobileScene*> ScenesPool;                              // 0x0338(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UFortMobileHUDWidgetRegistry*           HUDWidgetRegistry;                                 // 0x0388(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_390[0xA0];                                     // 0x0390(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CurrentContextTags;                                // 0x0430(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FFortMobileHUDLayoutProfile            LayoutProfile;                                     // 0x0450(0x0038)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicBacchusHUDDirector">();
	}
	static class ADynamicBacchusHUDDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicBacchusHUDDirector>();
	}
};

// Class DynamicBacchusHUD.DynamicUIMobileScene
// 0x00B8 (0x0130 - 0x0078)
class UDynamicUIMobileScene final : public UDynamicUIScene
{
public:
	uint8                                         Pad_78[0xB8];                                      // 0x0078(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicUIMobileScene">();
	}
	static class UDynamicUIMobileScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicUIMobileScene>();
	}
};

}

