#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function DynamicUI.DynamicUIDirectorBase.AddScene
// 0x0008 (0x0008 - 0x0000)
struct DynamicUIDirectorBase_AddScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicUI.DynamicUIDirectorBase.RemoveScene
// 0x0008 (0x0008 - 0x0000)
struct DynamicUIDirectorBase_RemoveScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicUI.DynamicUIDirectorBase.GetOwningLocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct DynamicUIDirectorBase_GetOwningLocalPlayer final
{
public:
	class ULocalPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicUI.DynamicUIDirectorBase.GetOwningLocalPlayerController
// 0x0008 (0x0008 - 0x0000)
struct DynamicUIDirectorBase_GetOwningLocalPlayerController final
{
public:
	class APlayerController*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicUI.DynamicUIManager.AddScene
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIManager_AddScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      Player;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicUI.DynamicUIManager.AddScenes
// 0x0018 (0x0018 - 0x0000)
struct DynamicUIManager_AddScenes final
{
public:
	TArray<class UDynamicUIScene*>                Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class APlayerController*                      Player;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicUI.DynamicUIManager.AddSceneToFirstLocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct DynamicUIManager_AddSceneToFirstLocalPlayer final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicUI.DynamicUIManager.RemoveScene
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIManager_RemoveScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      Player;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicUI.DynamicUIManager.RemoveSceneFromFirstLocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct DynamicUIManager_RemoveSceneFromFirstLocalPlayer final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicUI.DynamicUIManager.RemoveScenes
// 0x0018 (0x0018 - 0x0000)
struct DynamicUIManager_RemoveScenes final
{
public:
	TArray<class UDynamicUIScene*>                Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class APlayerController*                      Player;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DynamicUI.DynamicUIManager.IsSceneActive
// 0x0018 (0x0018 - 0x0000)
struct DynamicUIManager_IsSceneActive final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      Player;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DynamicUI.DynamicUIManager.IsSceneActiveOnFirstLocalPlayer
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIManager_IsSceneActiveOnFirstLocalPlayer final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

