#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EncountersRuntime

#include "Basic.hpp"

#include "EncountersRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "WorldConditions_classes.hpp"
#include "LagerRuntime_structs.hpp"
#include "LagerRuntime_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "StructUtils_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "GameplayStateTreeModule_classes.hpp"


namespace SDK
{

// Class EncountersRuntime.EncounterGameplayCueActor
// 0x0000 (0x0290 - 0x0290)
class AEncounterGameplayCueActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterGameplayCueActor">();
	}
	static class AEncounterGameplayCueActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEncounterGameplayCueActor>();
	}
};

// Class EncountersRuntime.EncounterVolumePointProvider
// 0x0008 (0x05E0 - 0x05D8)
class AEncounterVolumePointProvider final : public AFortAthenaLivingWorldVolume
{
public:
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterVolumePointProvider">();
	}
	static class AEncounterVolumePointProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEncounterVolumePointProvider>();
	}
};

// Class EncountersRuntime.EncounterMobAnchor
// 0x0020 (0x02B0 - 0x0290)
class AEncounterMobAnchor final : public AActor
{
public:
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0290(0x0020)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterMobAnchor">();
	}
	static class AEncounterMobAnchor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEncounterMobAnchor>();
	}
};

// Class EncountersRuntime.EncounterMobManagerComponent
// 0x0178 (0x0218 - 0x00A0)
class UEncounterMobManagerComponent final : public UGameFrameworkComponent
{
public:
	TArray<struct FEncounterMobInstance>          SpawnedMobs;                                       // 0x00A0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FEncounterMobSpawnData>         MobEncounterSpawnData;                             // 0x00B0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FEncounterMobSpawnInfo                 DefaultMobSpawnInfo;                               // 0x00C0(0x00A0)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         LWMDensityWeight;                                  // 0x0160(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         LWMDensityRange;                                   // 0x0188(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier)> OnEncounterStarted;     // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier)> OnEncounterPaused;      // 0x01C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier)> OnEncounterResumed;     // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier, class AActor* SpawnedActor)> OnEncounterActorSpawned; // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier, class AActor* DamagedActor, class AActor* DamageCauser)> OnEncounterActorDead; // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& MobIdentifier)> OnEncounterEnded;       // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ALivingWorldEncounterPrefab> EncounterPrefab;                               // 0x0210(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void EndAndCleanupAllMobEncounters();
	void EndMobEncounter(const struct FGameplayTag& MobIdentifier);
	void OnMobActorDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnMobActorSpawn(class AActor* SpawnedActor, const class UFortAthenaLivingWorldEventData* EventData);
	void OnMobPawnEndPlay(class AActor* Mob, EEndPlayReason EndPlayReason);
	void PauseMobEncounter(const struct FGameplayTag& MobIdentifier);
	void ResumeMobEncounter(const struct FGameplayTag& MobIdentifier);
	bool StartMobEncounter(const struct FGameplayTag& MobIdentifier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterMobManagerComponent">();
	}
	static class UEncounterMobManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterMobManagerComponent>();
	}
};

// Class EncountersRuntime.EncounterItemDefinition
// 0x0220 (0x0328 - 0x0108)
class UEncounterItemDefinition final : public UFortItemDefinition
{
public:
	bool                                          bAutoHandleSuccessFailure;                         // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0110(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UStateTree>              StateTreeOverride;                                 // 0x0130(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        ProximityGameplayCueTag;                           // 0x0150(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        ActorCleanupGameplayCueTag;                        // 0x0154(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           SuccessRewards;                                    // 0x0158(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FEncounterRewardBehavior               SuccessRewardBehavior;                             // 0x0168(0x0080)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        ActorSuccessGameplayCueTag;                        // 0x01E8(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        PlayerSuccessGameplayCueTag;                       // 0x01EC(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           FailureRewards;                                    // 0x01F0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FEncounterRewardBehavior               FailureRewardBehavior;                             // 0x0200(0x0080)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        ActorFailureGameplayCueTag;                        // 0x0280(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueTag                        PlayerFailureGameplayCueTag;                       // 0x0284(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         LWMDensityWeight;                                  // 0x0288(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         LWMDensityRange;                                   // 0x02B0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseGlobalLWMBudget;                               // 0x02D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedStruct>               Vars;                                              // 0x02E0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FInstancedStruct>               VariableSelections;                                // 0x02F0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FWorldConditionQueryDefinition         CanSpawnWorldConditionDefinition;                  // 0x0300(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortAthenaLivingWorldPrefabActorSpawnerData> ActorSpawnerDatas;                   // 0x0318(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterItemDefinition">();
	}
	static class UEncounterItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterItemDefinition>();
	}
};

// Class EncountersRuntime.EncounterWorldConditionSchema
// 0x0008 (0x0040 - 0x0038)
class UEncounterWorldConditionSchema final : public UWorldConditionSchema
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterWorldConditionSchema">();
	}
	static class UEncounterWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterWorldConditionSchema>();
	}
};

// Class EncountersRuntime.LWMEncounterInstance
// 0x00F0 (0x0118 - 0x0028)
class ULWMEncounterInstance final : public UObject
{
public:
	TWeakObjectPtr<class UFortAthenaLivingWorldEncounterInstance> LWMInstance;                       // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AFortPawn>>       SpawnedMobPawns;                                   // 0x0030(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x58];                                      // 0x0040(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  EncounterAnchorPoint;                              // 0x0098(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AActor>                  UserActor;                                         // 0x00A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> ActivePointProviderInterfaces; // 0x00A8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x60];                                      // 0x00B8(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMobActorDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnMobActorSpawn(class AActor* SpawnedActor, const class UFortAthenaLivingWorldEventData* EventData);
	void OnMobPawnEndPlay(class AActor* Mob, EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LWMEncounterInstance">();
	}
	static class ULWMEncounterInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULWMEncounterInstance>();
	}
};

// Class EncountersRuntime.SpawnActorTaskHelper
// 0x0010 (0x0038 - 0x0028)
class USpawnActorTaskHelper : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpawnActorTaskHelper">();
	}
	static class USpawnActorTaskHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnActorTaskHelper>();
	}
};

// Class EncountersRuntime.EncounterActorSpawnerData
// 0x0050 (0x00A0 - 0x0050)
class UEncounterActorSpawnerData final : public UFortAthenaActorSpawnerData
{
public:
	struct FEncounterPrefabEntry                  EncounterEntry;                                    // 0x0050(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterActorSpawnerData">();
	}
	static class UEncounterActorSpawnerData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterActorSpawnerData>();
	}
};

// Class EncountersRuntime.EncounterStateTreeComponent
// 0x0008 (0x0178 - 0x0170)
class UEncounterStateTreeComponent final : public UStateTreeComponent
{
public:
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterStateTreeComponent">();
	}
	static class UEncounterStateTreeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterStateTreeComponent>();
	}
};

// Class EncountersRuntime.EncounterBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UEncounterBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UEncounterMobManagerComponent* GetRelevantMobManagerComponentForActor(const class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterBlueprintLibrary">();
	}
	static class UEncounterBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterBlueprintLibrary>();
	}
};

// Class EncountersRuntime.EncounterFactionData
// 0x0088 (0x00B8 - 0x0030)
class UEncounterFactionData final : public UPrimaryDataAsset
{
public:
	struct FGameplayTagQuery                      RequiredCapabilities;                              // 0x0030(0x0048)(Edit, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  FactionCapabilities;                               // 0x0078(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FWorldConditionQueryDefinition         WorldConditionDefinition;                          // 0x0098(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class UDataTable*                             LWMEncounterTable;                                 // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterFactionData">();
	}
	static class UEncounterFactionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterFactionData>();
	}
};

// Class EncountersRuntime.EncounterGameplayVolume
// 0x0108 (0x0438 - 0x0330)
class AEncounterGameplayVolume : public AGameplayVolume
{
public:
	uint8                                         Pad_330[0x18];                                     // 0x0330(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UEncounterStateTreeComponent*           EncounterStateTreeComponent;                       // 0x0348(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_350[0x8];                                      // 0x0350(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IEncounterPointProviderInterface>> TrackedEncounterPointProviders; // 0x0358(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AEncounterMobAnchor>> TrackedEncounterAnchors;                       // 0x0368(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class ABuildingActor>>  TrackedBuildingActors;                             // 0x0378(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AFortPlayerController>> OverlappingPlayers;                          // 0x0388(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UOverlapComponent>       OverlapComponent;                                  // 0x0398(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, class FString>            AllVisitedPlayersMap;                              // 0x03A0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F0[0x48];                                     // 0x03F0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCleanup();

	bool IsDoneCleaningUp() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterGameplayVolume">();
	}
	static class AEncounterGameplayVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEncounterGameplayVolume>();
	}
};

// Class EncountersRuntime.EncounterManagerComponent
// 0x0230 (0x02D0 - 0x00A0)
class UEncounterManagerComponent final : public UGameFrameworkComponent
{
public:
	TWeakObjectPtr<class AEncounterGameplayVolume> EncounterVolume;                                  // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEncounterItemDefinition*               EncounterDefinition;                               // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  CenterActorOverride;                               // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    PostEncounterLWMEvent;                             // 0x00B8(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    PostEncounterLWMCategory;                          // 0x00C8(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSet<class AFortPlayerController*>            ExplicitContributors;                              // 0x00D8(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FActorIdentifierEntry>          ActorIdentifiers;                                  // 0x0128(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasHandledSuccessFailure;                         // 0x0138(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLWMEncounterInfo>              EncounterInfos;                                    // 0x0140(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayEffectIdentifierInfo>  GameplayEffectInfos;                               // 0x0150(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class ALivingWorldEncounterPrefab> EncounterPrefab;                               // 0x0160(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UDataTable>              LWMEncounterTable;                                 // 0x0168(0x0020)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_188[0x100];                                    // 0x0188(0x0100)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  LastThreat;                                        // 0x0288(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AActor>                  ReservoirActor;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FTrackedActorInfo>              TrackedActorInfos;                                 // 0x0298(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x28];                                     // 0x02A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddExplicitContributor(class AFortPlayerController* Contributor);
	void HandleEncounterFailure(int32 RewardIndex);
	void HandleEncounterSuccess(int32 RewardIndex);
	void OnStateTreeStatusChanged(EStateTreeRunStatus Status);
	void RemoveExplicitContributor(class AFortPlayerController* Contributor);
	void SetPersistentValue(const struct FGameplayTag& Identifier, int32 Value);

	int32 GetPersistentValue(const struct FGameplayTag& Identifier) const;
	TSoftClassPtr<class UClass> GetVariable_ActorClass(const struct FGameplayTag& VarName) const;
	const TArray<struct FFortAthenaLivingWorldEventDataActorSpawnDescription> GetVariable_ActorDescription(const struct FGameplayTag& VarName) const;
	bool GetVariable_Bool(const struct FGameplayTag& VarName) const;
	float GetVariable_Float(const struct FGameplayTag& VarName) const;
	struct FGameplayTag GetVariable_GameplayTag(const struct FGameplayTag& VarName) const;
	struct FGameplayTagContainer GetVariable_GameplayTagContainer(const struct FGameplayTag& VarName) const;
	int32 GetVariable_Int(const struct FGameplayTag& VarName) const;
	const class UFortWorldItemDefinition* GetVariable_ItemDefinition(const struct FGameplayTag& VarName) const;
	const class UFortAthenaLivingWorldEncounter* GetVariable_LWMEncounter(const struct FGameplayTag& VarName) const;
	struct FGameplayTagQuery GetVariable_TagQuery(const struct FGameplayTag& VarName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterManagerComponent">();
	}
	static class UEncounterManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEncounterManagerComponent>();
	}
};

// Class EncountersRuntime.EncounterPatrolPathPointProvider
// 0x0008 (0x0398 - 0x0390)
class AEncounterPatrolPathPointProvider final : public AFortAthenaPatrolPathPointProvider
{
public:
	uint8                                         Pad_390[0x8];                                      // 0x0390(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterPatrolPathPointProvider">();
	}
	static class AEncounterPatrolPathPointProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEncounterPatrolPathPointProvider>();
	}
};

// Class EncountersRuntime.EncounterPointProviderInterface
// 0x0000 (0x0000 - 0x0000)
class IEncounterPointProviderInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterPointProviderInterface">();
	}
	static class IEncounterPointProviderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEncounterPointProviderInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class EncountersRuntime.EncounterStaticPointProvider
// 0x0008 (0x0390 - 0x0388)
class AEncounterStaticPointProvider : public AFortAthenaLivingWorldStaticPointProvider
{
public:
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EncounterStaticPointProvider">();
	}
	static class AEncounterStaticPointProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEncounterStaticPointProvider>();
	}
};

// Class EncountersRuntime.FortCheatManager_Encounters
// 0x0000 (0x0028 - 0x0028)
class UFortCheatManager_Encounters final : public UChildCheatManager
{
public:
	void EncountersDump();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCheatManager_Encounters">();
	}
	static class UFortCheatManager_Encounters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_Encounters>();
	}
};

// Class EncountersRuntime.LivingWorldEncounterPrefab
// 0x0088 (0x09D0 - 0x0948)
class ALivingWorldEncounterPrefab : public AFortAthenaLivingWorldPrefab
{
public:
	uint8                                         Pad_948[0x58];                                     // 0x0948(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEncounterPrefabInfo>           EncounterEntries;                                  // 0x09A0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UEncounterItemDefinition*               EncounterDefinition;                               // 0x09B0(0x0008)(Net, ZeroConstructor, Transient, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  ReservoirActorOverride;                            // 0x09B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UEncounterManagerComponent> EncounterManager;                               // 0x09C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C8[0x8];                                      // 0x09C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_EncounterDefinition();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LivingWorldEncounterPrefab">();
	}
	static class ALivingWorldEncounterPrefab* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALivingWorldEncounterPrefab>();
	}
};

// Class EncountersRuntime.FortVerbProcessor_EncounterCompleted
// 0x0000 (0x00A0 - 0x00A0)
class UFortVerbProcessor_EncounterCompleted final : public UFortObjectiveProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVerbProcessor_EncounterCompleted">();
	}
	static class UFortVerbProcessor_EncounterCompleted* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVerbProcessor_EncounterCompleted>();
	}
};

}

