#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Entity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "Entity_structs.hpp"


namespace SDK
{

// Class Entity.BaseEntity
// 0x0020 (0x0048 - 0x0028)
class UBaseEntity : public UObject
{
public:
	TArray<class UObject*>                        Components;                                        // 0x0028(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        OwnedEntities;                                     // 0x0038(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseEntity">();
	}
	static class UBaseEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseEntity>();
	}
};

// Class Entity.EntityPrefab
// 0x0000 (0x00A8 - 0x00A8)
class UEntityPrefab final : public UBlueprint
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityPrefab">();
	}
	static class UEntityPrefab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityPrefab>();
	}
};

// Class Entity.EntityReplicationSupport
// 0x0000 (0x0000 - 0x0000)
class IEntityReplicationSupport final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityReplicationSupport">();
	}
	static class IEntityReplicationSupport* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEntityReplicationSupport>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class Entity.EntityReplicator
// 0x01B8 (0x0448 - 0x0290)
class AEntityReplicator final : public AActor
{
public:
	bool                                          bIsNetInitialized;                                 // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 EntityPtr;                                         // 0x0298(0x0020)(Net, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 EntityOwnerPtr;                                    // 0x02C0(0x0020)(Net, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                        EntityServerPath;                                  // 0x02E0(0x0018)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                        EntityOwnerServerPath;                             // 0x02F8(0x0018)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFastEntityComponentArray              NonDynamicEntityComponents;                        // 0x0310(0x0118)(Net, NativeAccessSpecifierPrivate)
	class UObject*                                EntityPendingInitialization;                       // 0x0428(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        EntityComponentsPendingInitialization;             // 0x0430(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_440[0x8];                                      // 0x0440(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityReplicator">();
	}
	static class AEntityReplicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEntityReplicator>();
	}
};

// Class Entity.WorldExecutionSubsystem
// 0x0220 (0x0250 - 0x0030)
class UWorldExecutionSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UExecutionSubsystem*                    ExecutionSystem;                                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x210];                                     // 0x0040(0x0210)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldExecutionSubsystem">();
	}
	static class UWorldExecutionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldExecutionSubsystem>();
	}
};

// Class Entity.SimulationEntity
// 0x0010 (0x02A0 - 0x0290)
class ASimulationEntity final : public AActor
{
public:
	class UObject*                                SimulationEntity;                                  // 0x0290(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimulationEntity">();
	}
	static class ASimulationEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASimulationEntity>();
	}
};

// Class Entity.EntityRegistryBase
// 0x0000 (0x0030 - 0x0030)
class UEntityRegistryBase : public UWorldSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityRegistryBase">();
	}
	static class UEntityRegistryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityRegistryBase>();
	}
};

// Class Entity.EntityVerseEngineSubsystem
// 0x0008 (0x0038 - 0x0030)
class UEntityVerseEngineSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityVerseEngineSubsystem">();
	}
	static class UEntityVerseEngineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityVerseEngineSubsystem>();
	}
};

}

