#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Entity_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseAssets_0_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Entity_classes.hpp"
#include "VerseNative_structs.hpp"
#include "Entity_0_structs.hpp"
#include "VerseNative_0_classes.hpp"


namespace SDK
{

// VerseClass Entity.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class Entity_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass Entity.$SolarisSignatureFunctionOuter", true>();
	}
	static class Entity_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<Entity_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass Entity.entity_prefab
// 0x0000 (0x00C8 - 0x00C8)
class Uentity_prefab final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"entity_prefab">();
	}
	static class Uentity_prefab* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uentity_prefab>();
	}
};

// VerseClass Entity.Component
// 0x0138 (0x0160 - 0x0028)
class UComponent : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x04FC5AE7__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RGetEntity; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9357B49C__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RSetEntity_L_Nentity_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5D92EF7D__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x893C6C92__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBB897016__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x00CF4B66_OnSimulate;                     // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x349A65CA__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA45C6DAC__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xEA9EE3DB__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4BEE94C2__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsDisposed; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7D624042__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsInitialized; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3088CFFC__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsInScene; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6720B42E__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsSimulating; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7EB32A1D__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RGetTickEvents; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x26F0F200__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RSetTickEvents_L_Ntick__events_R; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC7ED594E__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	class Entity_0::UEntity*                      __verse_0xECA943DB_Entity;                         // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Utick_events*                           __verse_0x0381BCE3_TickEvents;                     // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_148[0x18];                                     // 0x0148(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class Entity_0::UEntity* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RGetEntity(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Utick_events* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RGetTickEvents(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsDisposed(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsInitialized(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsInScene(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsSimulating(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RSetEntity_L_Nentity_R(class Entity_0::UEntity* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RSetTickEvents_L_Ntick__events_R(class Utick_events* __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnSimulate(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Component">();
	}
	static class UComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponent>();
	}
};

// VerseClass Entity.replication_component
// 0x0020 (0x0180 - 0x0160)
class Ureplication_component final : public UComponent
{
public:
	uint8                                         Pad_160[0x20];                                     // 0x0160(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"replication_component">();
	}
	static class Ureplication_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ureplication_component>();
	}
};

// VerseClass Entity.Entity
// 0x0098 (0x00E0 - 0x0048)
class Entity_0::UEntity : public UBaseEntity
{
public:
	FVerseFunctionProperty_                       __verse_0x89EC7136__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetParent; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x299474B1__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RUnsetParent; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x507948D8__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RAttachEntities_L_N_Kentity_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDDD24F95__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetEntities; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3E80514D__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetComponents_L_NComponentType_20where_20ComponentType_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1DB930C9__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RAttachComponents_L_N_Kcomponent_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD7B126E7__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RIsDisposed; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RAttachComponents_L_N_Kcomponent_R(const TArray<class UComponent*>& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RAttachEntities_L_N_Kentity_R(const TArray<class Entity_0::UEntity*>& __verse_0xB2CDDD72_Argument);
	TArray<class UComponent*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetComponents_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	TArray<class Entity_0::UEntity*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetEntities(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class Entity_0::UEntity*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RGetParent(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RIsDisposed(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity_N_RUnsetParent(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass Entity.Entity", true>();
	}
	static class Entity_0::UEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<Entity_0::UEntity>();
	}
};

// VerseClass Entity._Root
// 0x0000 (0x0028 - 0x0028)
class Entity_0::U_Root final : public UObject
{
public:
	static TOptional<class Usimulation_entity*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eGetSimulationEntity_U_L_Nentity_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Entity_0::Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass Entity._Root", true>();
	}
	static class Entity_0::U_Root* GetDefaultObj()
	{
		return GetDefaultObjImpl<Entity_0::U_Root>();
	}
};

// VerseClass Entity.task_component$OnSimulate
// 0x0010 (0x0168 - 0x0158)
class Utask_component_OnSimulate final : public UConcurrency_task
{
public:
	class UComponent*                             _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct Entity_0::Ftuple_L_R                   __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_component$OnSimulate">();
	}
	static class Utask_component_OnSimulate* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_component_OnSimulate>();
	}
};

// VerseClass Entity.simulation_entity
// 0x0000 (0x00E0 - 0x00E0)
class Usimulation_entity final : public Entity_0::UEntity
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"simulation_entity">();
	}
	static class Usimulation_entity* GetDefaultObj()
	{
		return GetDefaultObjImpl<Usimulation_entity>();
	}
};

// VerseClass Entity.tick_events
// 0x0030 (0x0058 - 0x0028)
class Utick_events final : public UObject
{
public:
	class Uexecution_subscribable*                __verse_0x8A2FD5A2_PrePhysics;                     // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uexecution_subscribable*                __verse_0x64E0C2D3_StartPhysics;                   // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uexecution_subscribable*                __verse_0x2CC1E195_DuringPhysics;                  // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uexecution_subscribable*                __verse_0xA3739C71_EndPhysics;                     // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uexecution_subscribable*                __verse_0xF70848B2_PostPhysics;                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uexecution_subscribable*                __verse_0xDA501C13_EndFrame;                       // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"tick_events">();
	}
	static class Utick_events* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utick_events>();
	}
};

// VerseClass Entity.transform_component
// 0x00F0 (0x0250 - 0x0160)
class Utransform_component final : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x91D253D2__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftransform__component_N_RSetTransform_L_Ntransform_R; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCB286664__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftransform__component_N_ROnRep__Transform; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	struct FSpatialMath_transform                 __verse_0x61C3007D_Transform;                      // 0x0180(0x0060)(Net, InstancedReference, NoDestructor)
	struct FSpatialMath_transform                 __verse_0xEA0A1CBC_InitialRelativeTransform;       // 0x01E0(0x0060)(Edit, InstancedReference, SaveGame, NoDestructor)
	uint8                                         Pad_240[0x10];                                     // 0x0240(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftransform__component_N_ROnRep__Transform(const struct Entity_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftransform__component_N_RSetTransform_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"transform_component">();
	}
	static class Utransform_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utransform_component>();
	}
};

// VerseClass Entity.typed_element_component
// 0x0000 (0x0160 - 0x0160)
class Utyped_element_component final : public UComponent
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"typed_element_component">();
	}
	static class Utyped_element_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utyped_element_component>();
	}
};

}

