#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Entity

#include "Basic.hpp"

#include "NetCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum Entity.EEntityNotificationState
// NumValues: 0x0015
enum class EEntityNotificationState : uint8
{
	Created                                  = 0,
	Initializing                             = 1,
	Initialized                              = 2,
	AddingToScene                            = 3,
	AddedToScene                             = 4,
	BeginningSimulation                      = 5,
	BeganSimulation                          = 6,
	EndingSimulation                         = 7,
	EndedSimulation                          = 8,
	RemovingFromScene                        = 9,
	RemovedFromScene                         = 10,
	Uninitializing                           = 11,
	Uninitialized                            = 12,
	TearingDown                              = 13,
	TearedDown                               = 14,
	ClientDenied                             = 15,
	Disposing                                = 16,
	Disposed                                 = 17,
	ReInstantiated                           = 18,
	RemovingChild                            = 19,
	EEntityNotificationState_MAX             = 20,
};

// Enum Entity.EEntityEndPlayReason
// NumValues: 0x0004
enum class EEntityEndPlayReason : uint8
{
	RemoveFromWorld                          = 0,
	RemoveFromEntity                         = 1,
	Destroy                                  = 2,
	EEntityEndPlayReason_MAX                 = 3,
};

// ScriptStruct Entity.FastEntityComponentArrayItem
// 0x0004 (0x0010 - 0x000C)
struct FFastEntityComponentArrayItem final : public FFastArraySerializerItem
{
public:
	class FName                                   ComponentName;                                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Entity.FastEntityComponentArray
// 0x0010 (0x0118 - 0x0108)
struct FFastEntityComponentArray final : public FFastArraySerializer
{
public:
	TArray<struct FFastEntityComponentArrayItem>  Components;                                        // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct Entity.WorldExecutionPhase
// 0x0030 (0x0058 - 0x0028)
struct FWorldExecutionPhase final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Entity.ReplicatedDataEntry
// 0x0018 (0x0018 - 0x0000)
struct FReplicatedDataEntry final
{
public:
	class UObject*                                ReplicatedData;                                    // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Entity.ReplicatedDataRegistry
// 0x0010 (0x0010 - 0x0000)
struct FReplicatedDataRegistry final
{
public:
	TArray<struct FReplicatedDataEntry>           Registry;                                          // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
};

}

