#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityLevel

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class EntityLevel.EntityLevel
// 0x0030 (0x02C0 - 0x0290)
class AEntityLevel final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Entities;                                          // 0x0298(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    SavedEntityClass;                                  // 0x02B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UObject>                    SavedEntityComponentClass;                         // 0x02B8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityLevel">();
	}
	static class AEntityLevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEntityLevel>();
	}
};

// Class EntityLevel.EntitySceneComponent
// 0x0010 (0x0520 - 0x0510)
class UEntitySceneComponent final : public UPrimitiveComponent
{
public:
	class AEntityLevel*                           EntityLevel;                                       // 0x0508(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIgnoreAttachmentUponPaste;                        // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_511[0xF];                                      // 0x0511(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntitySceneComponent">();
	}
	static class UEntitySceneComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntitySceneComponent>();
	}
};

// Class EntityLevel.EntityProxyActor
// 0x0038 (0x02C8 - 0x0290)
class AEntityProxyActor final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Entity;                                            // 0x0298(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AEntityLevel*                           EntityLevel;                                       // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                TransformComponent;                                // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x10];                                     // 0x02B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityProxyActor">();
	}
	static class AEntityProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEntityProxyActor>();
	}
};

// Class EntityLevel.EntityProxyActorComponent
// 0x0010 (0x00B0 - 0x00A0)
class UEntityProxyActorComponent final : public UActorComponent
{
public:
	class UObject*                                Entity;                                            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EntityComponent;                                   // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityProxyActorComponent">();
	}
	static class UEntityProxyActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityProxyActorComponent>();
	}
};

}

