#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityTestSuite

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Entity_0_classes.hpp"
#include "EntityTestSuite_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseNative_0_classes.hpp"


namespace SDK
{

// VerseClass EntityTestSuite.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class EntityTestSuite::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass EntityTestSuite.$SolarisSignatureFunctionOuter", true>();
	}
	static class EntityTestSuite::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<EntityTestSuite::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass EntityTestSuite.task_EntityTestSuite_lambda_test_component_2$OnSimulate
// 0x00E0 (0x0238 - 0x0158)
class Utask_EntityTestSuite_lambda_test_component_2_OnSimulate final : public UConcurrency_task
{
public:
	class UEntityTestSuite_lambda_test_component_2* _Self;                                           // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0168(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_2;                                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_event*                           __verse_0x00000000__3;                             // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_3;                                      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_4;                                 // 0x0190(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_5;                                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_6;                                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_7;                          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x01B8(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_9;                                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x01D0(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_12;                                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_event*                           __verse_0x00000000__7;                             // 0x01E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_13;                                     // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_14;                                // 0x01F8(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_15;                                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_16;                                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_17;                         // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x0220(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_19;                                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_EntityTestSuite_lambda_test_component_2$OnSimulate">();
	}
	static class Utask_EntityTestSuite_lambda_test_component_2_OnSimulate* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_EntityTestSuite_lambda_test_component_2_OnSimulate>();
	}
};

// VerseClass EntityTestSuite.EntityTestSuite_lambda_test_component
// 0x0230 (0x0390 - 0x0160)
class alignas(0x10) UEntityTestSuite_lambda_test_component final : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x2E7EDCED__L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component_N_ROnSimulateInternal; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x90F28CD6__L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component_N_ROnSimulateCancelledInternal; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UVerse_event*                           __verse_0x657D7B30_NopEvent;                       // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_188[0x208];                                    // 0x0188(0x0208)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component_N_ROnSimulateCancelledInternal(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component_N_ROnSimulateInternal(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnSimulate(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityTestSuite_lambda_test_component">();
	}
	static class UEntityTestSuite_lambda_test_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityTestSuite_lambda_test_component>();
	}
};

// VerseClass EntityTestSuite.EntityTestSuite_lambda_test_component_2
// 0x0230 (0x0390 - 0x0160)
class alignas(0x10) UEntityTestSuite_lambda_test_component_2 final : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xED9FB708__L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component__2_N_ROnSimulateInternal; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x345C5A23__L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component__2_N_ROnSimulateCancelledInternal; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UVerse_event*                           __verse_0x657D7B30_NopEvent;                       // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_188[0x208];                                    // 0x0188(0x0208)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component__2_N_ROnSimulateCancelledInternal(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fEntityTestSuite_2flambda__test__component__2_N_ROnSimulateInternal(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnBeginSimulation(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnEndSimulation(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnInitialized(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnUninitializing(const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnSimulate(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct EntityTestSuite::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityTestSuite_lambda_test_component_2">();
	}
	static class UEntityTestSuite_lambda_test_component_2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityTestSuite_lambda_test_component_2>();
	}
};

// VerseClass EntityTestSuite.EntityTestSuite_test_component
// 0x0000 (0x0160 - 0x0160)
class UEntityTestSuite_test_component final : public UComponent
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityTestSuite_test_component">();
	}
	static class UEntityTestSuite_test_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityTestSuite_test_component>();
	}
};

// VerseClass EntityTestSuite.task_EntityTestSuite_lambda_test_component$OnSimulate
// 0x00E0 (0x0238 - 0x0158)
class Utask_EntityTestSuite_lambda_test_component_OnSimulate final : public UConcurrency_task
{
public:
	class UEntityTestSuite_lambda_test_component* _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0168(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_2;                                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_event*                           __verse_0x00000000__3;                             // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_3;                                      // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_4;                                 // 0x0190(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_5;                                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_6;                                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_7;                          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_8;                                         // 0x01B8(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_9;                                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_10;                         // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x01D0(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_12;                                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerse_event*                           __verse_0x00000000__7;                             // 0x01E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_13;                                     // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_14;                                // 0x01F8(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_15;                                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_16;                                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_17;                         // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_18;                                        // 0x0220(0x0010)(HasGetValueTypeHash)
	struct EntityTestSuite::Ftuple_L_R            _ExprResult_19;                                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_EntityTestSuite_lambda_test_component$OnSimulate">();
	}
	static class Utask_EntityTestSuite_lambda_test_component_OnSimulate* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_EntityTestSuite_lambda_test_component_OnSimulate>();
	}
};

}

