#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityInteract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "LocalizableMessage_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class EntityInteract.EntityInteractLibrary
// 0x0000 (0x0028 - 0x0028)
class UEntityInteractLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class AActor* EntityInteractGetActor(const class UObject* WorldContextObject, const struct FHitResult& HitResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityInteractLibrary">();
	}
	static class UEntityInteractLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityInteractLibrary>();
	}
};

// Class EntityInteract.EntityInteractProxyActor
// 0x00B8 (0x0348 - 0x0290)
class AEntityInteractProxyActor final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLocalizableMessage                    InteractMessage;                                   // 0x0298(0x0030)(Net, RepNotify, NativeAccessSpecifierPrivate)
	struct FLocalizableMessage                    CoolDownMessage;                                   // 0x02C8(0x0030)(Net, RepNotify, NativeAccessSpecifierPrivate)
	class FText                                   InteractText;                                      // 0x02F8(0x0010)(NativeAccessSpecifierPrivate)
	class FText                                   CooldownText;                                      // 0x0308(0x0010)(NativeAccessSpecifierPrivate)
	struct FTimerHandle                           CoolDownTimerHandle;                               // 0x0318(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_320[0x10];                                     // 0x0320(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForwardInteractOffset;                             // 0x0330(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RightInteractOffset;                               // 0x0334(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                         TimesTriggered;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x0340(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_CoolDownMessage();
	void OnRep_InteractMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EntityInteractProxyActor">();
	}
	static class AEntityInteractProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEntityInteractProxyActor>();
	}
};

// Class EntityInteract.FortAthenaMutator_EntityInteract
// 0x0000 (0x0338 - 0x0338)
class AFortAthenaMutator_EntityInteract final : public AFortAthenaMutator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMutator_EntityInteract">();
	}
	static class AFortAthenaMutator_EntityInteract* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_EntityInteract>();
	}
};

}

