#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesAssets_0

#include "Basic.hpp"

#include "EpicGamesAssets_0_structs.hpp"


namespace SDK::Params
{

// Function EpicGamesAssets.Assets_play_sound_subscription._L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel
// 0x0001 (0x0001 - 0x0000)
struct Assets_play_sound_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel final
{
public:
	struct EpicGamesAssets_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesAssets.Assets._L_2fUnrealEngine_2ecom_2fAssets_N_RPlaySound_L_Nsound_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0020 (0x0020 - 0x0000)
struct Assets__L_2fUnrealEngine_2ecom_2fAssets_N_RPlaySound_L_Nsound_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	struct Ftuple_Lsound_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument;       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function EpicGamesAssets.Assets._L_2fUnrealEngine_2ecom_2fAssets_N_RPlaySoundAtLocation_L_Nsound_M_Nvector3_M_N_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0070 (0x0070 - 0x0000)
struct Assets__L_2fUnrealEngine_2ecom_2fAssets_N_RPlaySoundAtLocation_L_Nsound_M_Nvector3_M_N_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	struct Ftuple_Lsound_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0060)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0060(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function EpicGamesAssets.Assets._L_2fUnrealEngine_2ecom_2fAssets_N_RSpawnParticleSystem_L_Nparticle__system_M_Nvector3_M_N_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0070 (0x0070 - 0x0000)
struct Assets__L_2fUnrealEngine_2ecom_2fAssets_N_RSpawnParticleSystem_L_Nparticle__system_M_Nvector3_M_N_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_N_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	struct Ftuple_Lparticle__system_Mvector3_M_QRotation_Nrotation_20_3d_20_2e_2e_2e_M_QStartDelay_Nfloat_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0060)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0060(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function EpicGamesAssets.Assets_spawn_particle_system_subscription._L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel
// 0x0001 (0x0001 - 0x0000)
struct Assets_spawn_particle_system_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel final
{
public:
	struct EpicGamesAssets_0::Ftuple_L_R          __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

