#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicGamesEngineRestricted_0

#include "Basic.hpp"

#include "EpicGamesEngineRestricted_0_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function EpicGamesEngineRestricted.EpicGamesRestricted_Spline.EpicGamesRestricted_Spline_spline_query_result$Factory
// 0x0080 (0x0080 - 0x0000)
struct EpicGamesRestricted_Spline_EpicGamesRestricted_Spline_spline_query_result_Factory final
{
public:
	struct FEpicGamesRestricted_Spline_spline_query_result RetVal;                                   // 0x0000(0x0080)(Parm, OutParm, ReturnParm, NoDestructor)
};

// Function EpicGamesEngineRestricted.EpicGamesRestricted_Spline.EpicGamesRestricted_Spline_spline_query_result$OverrideFactory
// 0x00D0 (0x00D0 - 0x0000)
struct EpicGamesRestricted_Spline_EpicGamesRestricted_Spline_spline_query_result_OverrideFactory final
{
public:
	struct FEpicGamesRestricted_Spline_spline_query_result RetVal;                                   // 0x0000(0x0080)(Parm, OutParm, ReturnParm, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0080(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_component._L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RFindClosestInputKeyToWorldPosition_L_Nvector3_R
// 0x0028 (0x0028 - 0x0000)
struct EpicGamesRestricted_Spline_spline_component__L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RFindClosestInputKeyToWorldPosition_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<double>                             RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_component._L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RFindDistanceAlongSplineAtInputKey_L_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct EpicGamesRestricted_Spline_spline_component__L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RFindDistanceAlongSplineAtInputKey_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_component._L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RGetInputKeyAtDistanceAlongSpline_L_Nfloat_R
// 0x0018 (0x0018 - 0x0000)
struct EpicGamesRestricted_Spline_spline_component__L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RGetInputKeyAtDistanceAlongSpline_L_Nfloat_R final
{
public:
	double                                        __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_component._L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RGetSplineLength
// 0x0010 (0x0010 - 0x0000)
struct EpicGamesRestricted_Spline_spline_component__L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RGetSplineLength final
{
public:
	struct EpicGamesEngineRestricted_0::Ftuple_L_R __verse_0xB2CDDD72_Argument;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_component._L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RQueryAtDistanceAlongSpline_L_Nfloat_M_Nlogic_R
// 0x00A0 (0x00A0 - 0x0000)
struct EpicGamesRestricted_Spline_spline_component__L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RQueryAtDistanceAlongSpline_L_Nfloat_M_Nlogic_R final
{
public:
	struct EpicGamesEngineRestricted_0::Ftuple_Lfloat_Mlogic_R __verse_0xB2CDDD72_Argument;          // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<struct FEpicGamesRestricted_Spline_spline_query_result> RetVal;                        // 0x0010(0x0090)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

// Function EpicGamesEngineRestricted.EpicGamesRestricted_Spline_spline_component._L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RQueryAtTime_L_Nfloat_M_Nlogic_R
// 0x00A0 (0x00A0 - 0x0000)
struct EpicGamesRestricted_Spline_spline_component__L_2fUnrealEngine_2ecom_2fEpicGamesRestricted_2fSpline_2fspline__component_N_RQueryAtTime_L_Nfloat_M_Nlogic_R final
{
public:
	struct EpicGamesEngineRestricted_0::Ftuple_Lfloat_Mlogic_R __verse_0xB2CDDD72_Argument;          // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash)
	TOptional<struct FEpicGamesRestricted_Spline_spline_query_result> RetVal;                        // 0x0010(0x0090)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor)
};

}

