#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicMediaBasePlayer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EpicMediaBasePlayer_structs.hpp"
#include "MediaUtils_structs.hpp"
#include "EpicStreamMediaSource_structs.hpp"


namespace SDK::Params
{

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.GetLicensedAudio
// 0x0001 (0x0001 - 0x0000)
struct EpicBaseStreamingVideo_GetLicensedAudio final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.GetMediaPlayer
// 0x0008 (0x0008 - 0x0000)
struct EpicBaseStreamingVideo_GetMediaPlayer final
{
public:
	class UMediaPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.GetMediaPlayerOptions
// 0x0080 (0x0080 - 0x0000)
struct EpicBaseStreamingVideo_GetMediaPlayerOptions final
{
public:
	struct FMediaPlayerOptions                    ReturnValue;                                       // 0x0000(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.GetMediaSource
// 0x0008 (0x0008 - 0x0000)
struct EpicBaseStreamingVideo_GetMediaSource final
{
public:
	class UEpicStreamMediaSource*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.GetSoundComponent
// 0x0008 (0x0008 - 0x0000)
struct EpicBaseStreamingVideo_GetSoundComponent final
{
public:
	class UMediaSoundComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.HandleLicensedAudioTreatmentChanged
// 0x0001 (0x0001 - 0x0000)
struct EpicBaseStreamingVideo_HandleLicensedAudioTreatmentChanged final
{
public:
	EUCPTypes                                     UCPType;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.HandleMediaOpened
// 0x0010 (0x0010 - 0x0000)
struct EpicBaseStreamingVideo_HandleMediaOpened final
{
public:
	class FString                                 OpenedUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.HandleMediaOpenedFailed
// 0x0010 (0x0010 - 0x0000)
struct EpicBaseStreamingVideo_HandleMediaOpenedFailed final
{
public:
	class FString                                 FailedUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.Init
// 0x0020 (0x0020 - 0x0000)
struct EpicBaseStreamingVideo_Init final
{
public:
	class UMediaTexture*                          InVideoTexture;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaPlayer*                           InMediaPlayer;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEpicStreamMediaSource*                 InMediaSource;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InCDNFailover;                                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.MethodDebounce
// 0x0001 (0x0001 - 0x0000)
struct EpicBaseStreamingVideo_MethodDebounce final
{
public:
	bool                                          bDebounce;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.OnFailedURL
// 0x0010 (0x0010 - 0x0000)
struct EpicBaseStreamingVideo_OnFailedURL final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.OnSuccessfulURL
// 0x0010 (0x0010 - 0x0000)
struct EpicBaseStreamingVideo_OnSuccessfulURL final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.Open
// 0x0088 (0x0088 - 0x0000)
struct EpicBaseStreamingVideo_Open final
{
public:
	struct FMediaPlayerOptions                    InMediaOptions;                                    // 0x0000(0x0080)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.RetryOnError
// 0x0002 (0x0002 - 0x0000)
struct EpicBaseStreamingVideo_RetryOnError final
{
public:
	EBaseMediaTerminalErrorReason                 Reason;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.SetCreateAudioComponent
// 0x0001 (0x0001 - 0x0000)
struct EpicBaseStreamingVideo_SetCreateAudioComponent final
{
public:
	bool                                          bInCreateAudioComponent;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.SetEnableExternalCloseCallback
// 0x0001 (0x0001 - 0x0000)
struct EpicBaseStreamingVideo_SetEnableExternalCloseCallback final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.SetOpenTimeout
// 0x0008 (0x0008 - 0x0000)
struct EpicBaseStreamingVideo_SetOpenTimeout final
{
public:
	double                                        InTimeoutTime;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.SetSoundSubmixes
// 0x0018 (0x0018 - 0x0000)
struct EpicBaseStreamingVideo_SetSoundSubmixes final
{
public:
	class UMediaSoundComponent*                   InSoundComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundSubmixBase*                       InDefault;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundSubmixBase*                       InLicensed;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.SetSyncTimes
// 0x0020 (0x0020 - 0x0000)
struct EpicBaseStreamingVideo_SetSyncTimes final
{
public:
	struct FDateTime                              InNowTime;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              InStartTime;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DynamicStart;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InOffset_s;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDelay_s;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.SetVideoSize
// 0x0008 (0x0008 - 0x0000)
struct EpicBaseStreamingVideo_SetVideoSize final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.Start
// 0x0018 (0x0018 - 0x0000)
struct EpicBaseStreamingVideo_Start final
{
public:
	class FString                                 InVUID;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaTexture*                          InVideoTexture;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.Stop
// 0x0002 (0x0002 - 0x0000)
struct EpicBaseStreamingVideo_Stop final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopPlayer;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaBasePlayer.EpicBaseStreamingVideo.IsSyncStartTimeSet
// 0x0001 (0x0001 - 0x0000)
struct EpicBaseStreamingVideo_IsSyncStartTimeSet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

