#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicMediaVideoWidgetBase

#include "Basic.hpp"

#include "EpicMediaBasePlayer_structs.hpp"


namespace SDK::Params
{

// Function EpicMediaVideoWidgetBase.EpicMediaVideoWidgetBase.GetBasePlayer
// 0x0008 (0x0008 - 0x0000)
struct EpicMediaVideoWidgetBase_GetBasePlayer final
{
public:
	class UEpicBaseStreamingVideo*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaVideoWidgetBase.EpicMediaVideoWidgetBase.Init
// 0x0001 (0x0001 - 0x0000)
struct EpicMediaVideoWidgetBase_Init final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function EpicMediaVideoWidgetBase.EpicMediaVideoWidgetBase.SetConfig
// 0x0010 (0x0010 - 0x0000)
struct EpicMediaVideoWidgetBase_SetConfig final
{
public:
	class UEpicMediaVideoWidgetConfig*            InConfig;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function EpicMediaVideoWidgetBase.EpicMediaVideoWidgetBase.TerminalError
// 0x0001 (0x0001 - 0x0000)
struct EpicMediaVideoWidgetBase_TerminalError final
{
public:
	EBaseMediaTerminalErrorReason                 Reason;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

