#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventScreenBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_classes.hpp"
#include "EventScreenBase_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class EventScreenBase.FortEventScreenData
// 0x0298 (0x02C8 - 0x0030)
class UFortEventScreenData final : public UDataAsset
{
public:
	class FString                                 EventCMSId;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AccountResourceName;                               // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AccountResourceNameGranter;                        // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelOfferId;                                      // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PremiumTrackOfferId;                               // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTokenType*                         PremiumTrackPurchasedToken;                        // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VaultWorldTag;                                     // 0x0088(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVaultWorldBackgroundData              PreviewScreenBackgroundData;                       // 0x0090(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFortChallengeBundleItemDefinition> QuestBundle;                            // 0x00E8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFortItemDefinition>     SpecialRewardItem;                                 // 0x0108(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFortItemDefinition>     SpecialPremiumRewardItem;                          // 0x0128(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEventItemOverride>             ItemOverrides;                                     // 0x0148(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FEventScreenTrackData                  FreeTrackData;                                     // 0x0158(0x0030)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FEventScreenTrackData                  PremiumTrackData;                                  // 0x0188(0x0030)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           QuestCategoryTag;                                  // 0x01B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class URichTextBlockDecorator>> RichTextDecorators;                           // 0x01C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, struct FLinearColor>        RewardTileBackgroundColors;                        // 0x01D0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   TimeRemainingFormat;                               // 0x0220(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   CurrencyFormat;                                    // 0x0230(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FEventScreenMoreInfoGroup>      MoreInfoGroups;                                    // 0x0240(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         RewardPreviewZoomLevel;                            // 0x0250(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseWidgetCameraFraming;                           // 0x0254(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   MoreInfoModalClass;                                // 0x0258(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PurchaseLevelsModalClass;                          // 0x0278(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   PurchasePremiumTrackModalClass;                    // 0x0298(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         CalendarEvents;                                    // 0x02B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventScreenData">();
	}
	static class UFortEventScreenData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventScreenData>();
	}
};

// Class EventScreenBase.FortEventModalBase
// 0x0010 (0x0408 - 0x03F8)
class UFortEventModalBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x10];                                     // 0x03F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseModal();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventModalBase">();
	}
	static class UFortEventModalBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventModalBase>();
	}
};

// Class EventScreenBase.FortEventMoreInfoGroup
// 0x0000 (0x02B8 - 0x02B8)
class UFortEventMoreInfoGroup final : public UUserWidget
{
public:
	void OnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void OnIconLoaded(const class UObject* Icon);
	void OnSetGroupText(const class FText& Header, const class FText& Body);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventMoreInfoGroup">();
	}
	static class UFortEventMoreInfoGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventMoreInfoGroup>();
	}
};

// Class EventScreenBase.FortEventMoreInfoModal
// 0x0028 (0x0430 - 0x0408)
class UFortEventMoreInfoModal final : public UFortEventModalBase
{
public:
	class UDynamicEntryBox*                       DynamicEntryBox_Groups;                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             SB_Vertical;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void OnModalBackout();
	void SetModalText(const class FText& Header, const class FText& SubHeader, const class FText& Legal);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventMoreInfoModal">();
	}
	static class UFortEventMoreInfoModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventMoreInfoModal>();
	}
};

// Class EventScreenBase.FortEventPurchaseLevelsModal
// 0x0070 (0x0478 - 0x0408)
class UFortEventPurchaseLevelsModal final : public UFortEventModalBase
{
public:
	class UCommonButtonBase*                      Button_Addition;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Subtraction;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Purchase;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_GetVBucks;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEventScreenListView*                   ListView_RewardPreview;                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentResourceValue;                              // 0x0440(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxResourceValue;                                  // 0x0444(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentVBucks;                                     // 0x0448(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OfferResourceQuantity;                             // 0x044C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAnimateListViewFromEmpty;                         // 0x0450(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_451[0x27];                                     // 0x0451(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAmountChangeButtonClicked();
	void OnCMSTextApplied(const class FText& LegalText);
	void OnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void OnPurchaseAmountChanged(const int32 TotalPrice, const int32 LevelQuantity, const int32 PurchaseQuantity, const int32 ResourceQuantity);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventPurchaseLevelsModal">();
	}
	static class UFortEventPurchaseLevelsModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventPurchaseLevelsModal>();
	}
};

// Class EventScreenBase.FortPurchasePremiumTrackBody
// 0x0000 (0x02B8 - 0x02B8)
class UFortPurchasePremiumTrackBody final : public UUserWidget
{
public:
	void OnPopulate(const int32 BodyIndex, const class FText& BodyText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPurchasePremiumTrackBody">();
	}
	static class UFortPurchasePremiumTrackBody* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPurchasePremiumTrackBody>();
	}
};

// Class EventScreenBase.FortEventPurchasePremiumTrackModal
// 0x0070 (0x0478 - 0x0408)
class UFortEventPurchasePremiumTrackModal final : public UFortEventModalBase
{
public:
	class UDynamicEntryBox*                       DynamicEntryBox_Body;                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                             ScrollBox_Body;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCTAButton*                         Button_Purchase;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_GetVBucks;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_PreviewReward;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentVBucks;                                     // 0x0440(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_444[0x34];                                     // 0x0444(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCMSTextApplied(const class FText& HeaderText, const class FText& LegalText);
	void OnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void OnPriceSet(const int32 Price);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventPurchasePremiumTrackModal">();
	}
	static class UFortEventPurchasePremiumTrackModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventPurchasePremiumTrackModal>();
	}
};

// Class EventScreenBase.FortEventListViewWidgetBase
// 0x0008 (0x02C0 - 0x02B8)
class UFortEventListViewWidgetBase : public UUserWidget
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventListViewWidgetBase">();
	}
	static class UFortEventListViewWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventListViewWidgetBase>();
	}
};

// Class EventScreenBase.FortEventRewardTracksWidget
// 0x0050 (0x0310 - 0x02C0)
class UFortEventRewardTracksWidget final : public UFortEventListViewWidgetBase
{
public:
	class UDynamicEntryBox*                       DynamicEntryBox_RewardTracks;                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPreviewMode;                                      // 0x02C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C9[0x47];                                     // 0x02C9(0x0047)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPOnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void BPOnSetRewardItem(const int32 RequiredProgress, const int32 RemainingProgress, const float RewardProgressPercent, const float PreviewProgressPercent, const float OverallProgressPercent, const bool bInPreviewMode);
	void BPSetAllRewardsCollected(const bool bAllCollected);
	void BPSetProgressPercent(const float Percent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventRewardTracksWidget">();
	}
	static class UFortEventRewardTracksWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventRewardTracksWidget>();
	}
};

// Class EventScreenBase.FortEventSpacerWidget
// 0x0000 (0x02C0 - 0x02C0)
class UFortEventSpacerWidget final : public UFortEventListViewWidgetBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventSpacerWidget">();
	}
	static class UFortEventSpacerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventSpacerWidget>();
	}
};

// Class EventScreenBase.FortEventRewardWidget
// 0x0090 (0x0348 - 0x02B8)
class UFortEventRewardWidget final : public UUserWidget
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_RewardPreview;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCosmeticItemCard*                  UserWidget_ItemCard;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsTrackOwned;                                     // 0x02D0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPreviewMode;                                      // 0x02D1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInPreviewSelectedState;                           // 0x02D2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInPremiumUpgradeState;                            // 0x02D3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D4[0x74];                                     // 0x02D4(0x0074)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEventScreenDataSet(const class UFortEventScreenData* InEventScreenData);
	void OnInputMethodChanged(const ECommonInputType NewInputType);
	void OnRewardWidgetReset();
	void OnSetRewardItem(const int32 RequiredProgress, const int32 RemainingProgress, const float RewardProgressPercent, const float PreviewProgressPercent, const float OverallProgressPercent, const bool bInPreviewMode);
	void SetAllRewardsCollected(const bool bAllCollected);
	void SetCustomItemIcon(const class UTexture2D* CustomItemIcon);
	void SetDoubleWidth(const bool bDoubleWidth);
	void SetInPremiumUpgradeState(const bool bHighlighted);
	void SetInPreviewedState(const bool bPreviewed);
	void SetInPreviewSelectedState(const bool bSelected);
	void SetInSelectedState(const bool bSelected);
	void SetIsBannerItem(const bool bIsBanner);
	void SetProgressPercent(const float Percent);
	void SetTrackData(const struct FEventScreenTrackData& TrackData, const bool bIsOwned);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventRewardWidget">();
	}
	static class UFortEventRewardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventRewardWidget>();
	}
};

// Class EventScreenBase.FortEventScreenBase
// 0x0370 (0x0A90 - 0x0720)
class UFortEventScreenBase final : public UFortItemPreviewScreen
{
public:
	uint8                                         Pad_720[0x28];                                     // 0x0720(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNamedSlot*>                     LayoutTemplateSlots;                               // 0x0748(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UFortLazyImage*                         LazyImage_KeyArt;                                  // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ViewQuests;                                 // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_MoreInfo;                                   // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_PurchaseLevels;                             // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Preview;                                    // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ShowInItemShop;                             // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Previous;                                   // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Next;                                       // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortEventTrackerModule_CustomText*     CustomText_InspectItem;                            // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           Panel_LoadError;                                   // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Close;                                      // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseTouch;                                 // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortEventScreenData*                   EventScreenData;                                   // 0x07B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EEventScreenRewardPreviewType                 ActiveRewardPreviewType;                           // 0x07C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortChallengeBundleItemDefinition*     LoadedQuestBundle;                                 // 0x07C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortItemPreviewWorld*                  CachedVaultWorld;                                  // 0x07D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemVM*                            CachedItemVM;                                      // 0x07D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEventScreenVariantManager*             VariantManager;                                    // 0x07E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7E8[0x2A8];                                    // 0x07E8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleActiveSeasonDataChanged(const TArray<class FString>& ActiveEventFlags);
	void HandleGiftBoxClosed();
	class UWidget* HandleRewardListNavigateRightEvent(EUINavigation InNavigation);
	class UWidget* HandleRewardListNavigateUpEvent(EUINavigation InNavigation);
	void HandleToggleFullscreenMap(bool bVisible);
	class UWidget* HandleUpsellPromptNavigateUpEvent(EUINavigation InNavigation);
	void OnCalendarEventEnded(const class FString& EventName);
	void OnCalendarEventStarted(const class FString& EventName);
	void OnFirstViewAfterCompletion();
	void OnRewardPreviewItemChanged(const class UFortAccountItemDefinition* Item, const bool bFreeTrack);
	void OnRewardTrackReady();
	void OnScreenViewChanged(const EEventScreenView PrevScreenView, const EEventScreenView NewScreenView);
	void OnSetBonusInfo(const struct FBonusInfoMiniTagData& BonusInfo);
	void RegisterLayoutSlots();
	void SetItemShopCallout(const class FText& ItemShopCalloutText);
	void SetItemShopOfferInfoVisibility(bool bIsVisible);
	void SetRewardTrackLegal(const class FText& LegalText);
	void UpdateVariantCounter(int32 CurrentVariantIndex, int32 TotalNumVariants);

	class UFortEventModalBase* GetActiveModal() const;
	struct FTimespan GetEventTimeRemaining() const;
	class UMaterialInstanceDynamic* GetVaultWorldBackgroundMID() const;
	class UMaterialInstanceDynamic* GetVaultWorldFloorMID() const;
	bool HasAllRewardsCollected() const;
	bool HasPurchasedPremiumTrack() const;
	bool IsCalendarEventActive(const class FString& EventName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventScreenBase">();
	}
	static class UFortEventScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventScreenBase>();
	}
};

// Class EventScreenBase.EventScreenListView
// 0x01E8 (0x0468 - 0x0280)
class UEventScreenListView final : public UListViewBase
{
public:
	uint8                                         Pad_280[0xE8];                                     // 0x0280(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnProgressBarAnimationStartedEvent;                // 0x0368(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnProgressBarAnimationCompletedEvent;              // 0x0378(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnProgressBarAnimationInterruptedEvent;            // 0x0388(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMargin& Margin)> OnResourcePreviewOffsetAnimationEvent; // 0x0398(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A8[0x20];                                     // 0x03A8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortEventRewardTracksWidget> RewardTrackWidgetClass;                          // 0x03C8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortEventSpacerWidget>     SpacerWidgetClass;                                 // 0x03D0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EntrySpacing;                                      // 0x03D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCenterSelection;                                  // 0x03DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxItemsInView;                                    // 0x03E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPreviewMode;                                      // 0x03E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E5[0x3];                                      // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            ProgressAnimationCurve;                            // 0x03E8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanAnimateOnceComplete;                           // 0x03F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F1[0x77];                                     // 0x03F1(0x0077)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetNativeTickAllowed(const bool bAllowed);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventScreenListView">();
	}
	static class UEventScreenListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventScreenListView>();
	}
};

// Class EventScreenBase.FortEventScreenTeaser
// 0x0040 (0x05A8 - 0x0568)
class UFortEventScreenTeaser final : public UFortActivatablePanel
{
public:
	class FString                                 CountdownCalendarEventFlag;                        // 0x0568(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         CalendarEvents;                                    // 0x0578(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           QuestCategoryTag;                                  // 0x0588(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_ViewQuests;                                 // 0x0590(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_598[0x10];                                     // 0x0598(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_SetCountdownTimeRemaining(const struct FTimespan& TimeRemaining);
	void HandleActiveSeasonDataChanged(const TArray<class FString>& ActiveEventFlags);
	void OnCalendarEventEnded(const class FString& EventName);
	void OnCalendarEventStarted(const class FString& EventName);

	bool IsCalendarEventActive(const class FString& EventName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventScreenTeaser">();
	}
	static class UFortEventScreenTeaser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventScreenTeaser>();
	}
};

// Class EventScreenBase.EventScreenVariantManager
// 0x0048 (0x0070 - 0x0028)
class UEventScreenVariantManager final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventScreenVariantManager">();
	}
	static class UEventScreenVariantManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventScreenVariantManager>();
	}
};

// Class EventScreenBase.FortEventTokenCollectionWidget
// 0x0060 (0x0318 - 0x02B8)
class UFortEventTokenCollectionWidget final : public UUserWidget
{
public:
	class UCommonLazyImage*                       LazyImage_GhostIcon;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                       LazyImage_CompletedIcon;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_Glow;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>              FallbackBrush;                                     // 0x02D0(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortTokenType>          TokenDefinition;                                   // 0x02F0(0x0020)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x8];                                      // 0x0310(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRefreshIcon(const bool IsCollected, const bool bIsFirstViewAfterCollection);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTokenCollectionWidget">();
	}
	static class UFortEventTokenCollectionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTokenCollectionWidget>();
	}
};

// Class EventScreenBase.FortEventTrackerModule
// 0x0008 (0x02C0 - 0x02B8)
class UFortEventTrackerModule : public UUserWidget
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnModuleInitialized(const class UFortEventScreenData* InEventScreenData);

	const class UFortEventScreenData* GetEventScreenData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTrackerModule">();
	}
	static class UFortEventTrackerModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule>();
	}
};

// Class EventScreenBase.FortEventTrackerModule_EventDetails
// 0x0000 (0x02C0 - 0x02C0)
class UFortEventTrackerModule_EventDetails final : public UFortEventTrackerModule
{
public:
	void OnPopulateEventDetailsText(const class FText& OutEventName, const class FText& OutEventDescription);
	void UpdateEventTimeRemaining(const class FText& EventTimeRemainingText, const struct FTimespan& TimeRemaining);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTrackerModule_EventDetails">();
	}
	static class UFortEventTrackerModule_EventDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_EventDetails>();
	}
};

// Class EventScreenBase.FortEventTrackerModule_Header
// 0x0000 (0x02C0 - 0x02C0)
class UFortEventTrackerModule_Header final : public UFortEventTrackerModule
{
public:
	void OnPopulateEventResourceHeader(const class FText& Header, const int32 ResourceValue);
	void OnPopulateEventResourceStarterHeader(const class FText& Header);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTrackerModule_Header">();
	}
	static class UFortEventTrackerModule_Header* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_Header>();
	}
};

// Class EventScreenBase.FortEventTrackerModule_RewardDetails
// 0x0008 (0x02C8 - 0x02C0)
class UFortEventTrackerModule_RewardDetails final : public UFortEventTrackerModule
{
public:
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPopulateCompletedReward(const TArray<class FText>& RewardNames);
	void OnPopulateNextRewardDetails(const TArray<class FText>& RewardNames, const int32 ResourceNeeded);

	bool IsPremiumTrackOwned() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTrackerModule_RewardDetails">();
	}
	static class UFortEventTrackerModule_RewardDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_RewardDetails>();
	}
};

// Class EventScreenBase.FortEventTrackerModule_RewardRemaining
// 0x0020 (0x02E0 - 0x02C0)
class UFortEventTrackerModule_RewardRemaining final : public UFortEventTrackerModule
{
public:
	class UCommonButtonBase*                      Button_PurchasePremium;                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C8[0x18];                                     // 0x02C8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPopulateRemaining(const int32 ResourceNeeded, const int32 TotalResourceRequired, const bool bRequiresPremiumTrackPurchase);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTrackerModule_RewardRemaining">();
	}
	static class UFortEventTrackerModule_RewardRemaining* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_RewardRemaining>();
	}
};

// Class EventScreenBase.FortEventTrackerModule_ProgressiveRewards
// 0x0008 (0x02C8 - 0x02C0)
class UFortEventTrackerModule_ProgressiveRewards final : public UFortEventTrackerModule
{
public:
	class UEventScreenListView*                   ListView_Rewards;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnPopulateCompletionMessage(const bool bIsComplete, const class FText& CompletionText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTrackerModule_ProgressiveRewards">();
	}
	static class UFortEventTrackerModule_ProgressiveRewards* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_ProgressiveRewards>();
	}
};

// Class EventScreenBase.FortEventTrackerModule_Collection
// 0x0000 (0x02C0 - 0x02C0)
class UFortEventTrackerModule_Collection final : public UFortEventTrackerModule
{
public:
	void OnGatherTokenCollectionWidgets(TArray<class UFortEventTokenCollectionWidget*>* OutCollectionWidgets) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTrackerModule_Collection">();
	}
	static class UFortEventTrackerModule_Collection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_Collection>();
	}
};

// Class EventScreenBase.FortEventTrackerModule_Banner
// 0x0008 (0x02C8 - 0x02C0)
class UFortEventTrackerModule_Banner final : public UFortEventTrackerModule
{
public:
	class UFortLazyImage*                         LazyImage_BannerArt;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnCTACompleted(const bool bIsComplete);
	void OnPopulateBannerText(const class FText& BannerText);
	void OnPopulateHeaderCTAText(const class FText& HeaderCTAText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTrackerModule_Banner">();
	}
	static class UFortEventTrackerModule_Banner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_Banner>();
	}
};

// Class EventScreenBase.FortEventTrackerModule_PremiumUpsell
// 0x0060 (0x0320 - 0x02C0)
class UFortEventTrackerModule_PremiumUpsell final : public UFortEventTrackerModule
{
public:
	class UFortCTAButton*                         Button_Prompt;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   PromptTextUnowned;                                 // 0x02C8(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   PromptTextOwned;                                   // 0x02D8(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E8[0x38];                                     // 0x02E8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIconLoaded(const class UTexture* LoadedTexture);
	void OnPopulateText(const class FText& HeaderText, const class FText& BodyText);

	bool IsPremiumTrackOwned() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTrackerModule_PremiumUpsell">();
	}
	static class UFortEventTrackerModule_PremiumUpsell* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortEventTrackerModule_PremiumUpsell>();
	}
};

// Class EventScreenBase.FortEventTrackerModule_CustomText
// 0x0000 (0x02C0 - 0x02C0)
class UFortEventTrackerModule_CustomText final : public UFortEventTrackerModule
{
public:
	void OnPopulateText(const class FText& CustomText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortEventTrackerModule_CustomText">();
	}
	static class UFortEventTrackerModule_CustomText* GetDefaultObj()
	{
