#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventScreenBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum EventScreenBase.EEventScreenView
// NumValues: 0x0008
enum class EEventScreenView : uint8
{
	None                                     = 0,
	LandingPage                              = 1,
	RewardPreview                            = 2,
	MoreInfo                                 = 3,
	PurchaseLevels                           = 4,
	PurchasePremiumTrack                     = 5,
	LoadError                                = 6,
	EEventScreenView_MAX                     = 7,
};

// Enum EventScreenBase.EEventScreenRewardPreviewType
// NumValues: 0x0005
enum class EEventScreenRewardPreviewType : uint8
{
	None                                     = 0,
	RewardTrack                              = 1,
	SpecialItem                              = 2,
	SpecialPremiumItem                       = 3,
	EEventScreenRewardPreviewType_MAX        = 4,
};

// ScriptStruct EventScreenBase.EventItemOverride
// 0x0068 (0x0068 - 0x0000)
struct FEventItemOverride final
{
public:
	TSoftObjectPtr<class UFortItemDefinition>     ItemDefinition;                                    // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              CustomItemTexture;                                 // 0x0020(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              CustomItemTextureMobile;                           // 0x0040(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsDoubleWidth;                                    // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct EventScreenBase.EventScreenTrackData
// 0x0030 (0x0030 - 0x0000)
struct FEventScreenTrackData final
{
public:
	struct FLinearColor                           TrackColorPrimary;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TrackColorSecondary;                               // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TrackColorTertiary;                                // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EventScreenBase.EventScreenMoreInfoGroup
// 0x0040 (0x0040 - 0x0000)
struct FEventScreenMoreInfoGroup final
{
public:
	class FText                                   Header;                                            // 0x0000(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   Body;                                              // 0x0010(0x0010)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 Icon;                                              // 0x0020(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EventScreenBase.EventScreenCMSMoreInfoGroup
// 0x0030 (0x0030 - 0x0000)
struct FEventScreenCMSMoreInfoGroup final
{
public:
	class FText                                   Header;                                            // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   Body;                                              // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 IconURL;                                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EventScreenBase.EventScreenCMSResourceGroupOverride
// 0x0018 (0x0018 - 0x0000)
struct FEventScreenCMSResourceGroupOverride final
{
public:
	int32                                         ResourceValue;                                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 KeyArtOverrideURL;                                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct EventScreenBase.EventScreenCMSData
// 0x01F0 (0x01F0 - 0x0000)
struct FEventScreenCMSData final
{
public:
	class FString                                 EventCMSId;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   EventName;                                         // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   EventDescription;                                  // 0x0020(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   ResourceHeader;                                    // 0x0030(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   StarterHeader;                                     // 0x0040(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   CompletionHeader;                                  // 0x0050(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   EventCTA;                                          // 0x0060(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   EventCTACompleted;                                 // 0x0070(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   HeaderCTA;                                         // 0x0080(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   ItemShopCallout;                                   // 0x0090(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 CTAIconURL;                                        // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 KeyArtURL;                                         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   MoreInfoHeader;                                    // 0x00C0(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   MoreInfoSubHeader;                                 // 0x00D0(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   MoreInfoLegal;                                     // 0x00E0(0x0010)(NativeAccessSpecifierPublic)
	TArray<struct FEventScreenCMSMoreInfoGroup>   MoreInfoGroups;                                    // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   PurchaseLegal;                                     // 0x0100(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   RewardTrackLegal;                                  // 0x0110(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 ItemShopOfferId;                                   // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   PremiumUpsellUnownedHeader;                        // 0x0130(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   PremiumUpsellUnownedBody;                          // 0x0140(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   PremiumUpsellOwnedHeader;                          // 0x0150(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   PremiumUpsellOwnedBody;                            // 0x0160(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 PremiumUpsellIconURL;                              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   PurchasePremiumTrackHeader;                        // 0x0180(0x0010)(NativeAccessSpecifierPublic)
	TArray<class FText>                           PurchasePremiumTrackBodyList;                      // 0x0190(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   InspectSpecialItemUnowned;                         // 0x01A0(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   InspectSpecialItemOwned;                           // 0x01B0(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   InspectSpecialPremiumItemUnowned;                  // 0x01C0(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   InspectSpecialPremiumItemOwned;                    // 0x01D0(0x0010)(NativeAccessSpecifierPublic)
	TArray<struct FEventScreenCMSResourceGroupOverride> ResourceGroupOverrides;                      // 0x01E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct EventScreenBase.EventScreenCMSGroup
// 0x0050 (0x0050 - 0x0000)
struct FEventScreenCMSGroup final
{
public:
	TMap<class FString, struct FEventScreenCMSData> EventScreens;                                    // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};

}

