#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Execution_0

#include "Basic.hpp"

#include "Execution_0_structs.hpp"


namespace SDK::Params
{

// Function Execution.execution_subscribable._L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R
// 0x0018 (0x0018 - 0x0000)
struct execution_subscribable__L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R final
{
public:
	FVerseFunctionProperty_                       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, HasGetValueTypeHash)
	class UObject*                                RetVal;                                            // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function Execution.execution_subscription._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fexecution__subscription_N_RRunAfter_L_Nexecution__subscription_R
// 0x0008 (0x0008 - 0x0000)
struct execution_subscription__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fexecution__subscription_N_RRunAfter_L_Nexecution__subscription_R final
{
public:
	class Uexecution_subscription*                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function Execution.execution_subscription._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fexecution__subscription_N_RRunBefore_L_Nexecution__subscription_R
// 0x0008 (0x0008 - 0x0000)
struct execution_subscription__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fexecution__subscription_N_RRunBefore_L_Nexecution__subscription_R final
{
public:
	class Uexecution_subscription*                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function Execution.execution_subscription._L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel
// 0x0001 (0x0001 - 0x0000)
struct execution_subscription__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel final
{
public:
	struct Execution_0::Ftuple_L_R                __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

