#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FabricUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "ModelViewViewModel_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FabricUI.FabricInteractableViewModel
// 0x0028 (0x0090 - 0x0068)
class UFabricInteractableViewModel : public UMVVMViewModelBase
{
public:
	class FText                                   Label;                                             // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                   Value;                                             // 0x0078(0x0010)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x0088(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bVisible;                                          // 0x0089(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricInteractableViewModel">();
	}
	static class UFabricInteractableViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricInteractableViewModel>();
	}
};

// Class FabricUI.FabricButtonBaseViewModel
// 0x0008 (0x0098 - 0x0090)
class UFabricButtonBaseViewModel final : public UFabricInteractableViewModel
{
public:
	ECheckBoxState                                ToggleState;                                       // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricButtonBaseViewModel">();
	}
	static class UFabricButtonBaseViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricButtonBaseViewModel>();
	}
};

// Class FabricUI.FabricCarouselViewModel
// 0x0008 (0x0098 - 0x0090)
class UFabricCarouselViewModel final : public UFabricInteractableViewModel
{
public:
	bool                                          bPresetEnabled;                                    // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowBorder;                                       // 0x0091(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricCarouselViewModel">();
	}
	static class UFabricCarouselViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricCarouselViewModel>();
	}
};

// Class FabricUI.FabricGridStyle
// 0x0020 (0x0048 - 0x0028)
class UFabricGridStyle final : public UObject
{
public:
	struct FMargin                                Padding;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RowSpan;                                           // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColumnSpan;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricGridStyle">();
	}
	static class UFabricGridStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricGridStyle>();
	}
};

// Class FabricUI.FabricKnobViewModel
// 0x0008 (0x0098 - 0x0090)
class UFabricKnobViewModel final : public UFabricInteractableViewModel
{
public:
	bool                                          bValueVisible;                                     // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricKnobViewModel">();
	}
	static class UFabricKnobViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricKnobViewModel>();
	}
};

// Class FabricUI.FabricPageInfoViewModel
// 0x0008 (0x0070 - 0x0068)
class UFabricPageInfoViewModel final : public UMVVMViewModelBase
{
public:
	bool                                          bHasContent;                                       // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bActivePage;                                       // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricPageInfoViewModel">();
	}
	static class UFabricPageInfoViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricPageInfoViewModel>();
	}
};

// Class FabricUI.FabricScreenWidget
// 0x0030 (0x0310 - 0x02E0)
class UFabricScreenWidget final : public UCommonUserWidget
{
public:
	class UInvalidationBox*                       InvalidationBox_RootBox;                           // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScaleBox*                              ScaleBox_ScreenScale;                              // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGridPanel*                             GridPanel_ScreenGrid;                              // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpacer*                                Spacer_ElementSpacer;                              // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x10];                                     // 0x0300(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFabricWidget* AttachFabricWidget(const TSubclassOf<class UFabricWidget>& FabricWidgetClass, const struct FVector2D& GridPosition);
	void SetScreenGridDimensions(const struct FVector2D& InNewDimensions);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricScreenWidget">();
	}
	static class UFabricScreenWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricScreenWidget>();
	}
};

// Class FabricUI.FabricWidget
// 0x0010 (0x02F0 - 0x02E0)
class UFabricWidget final : public UCommonUserWidget
{
public:
	TSubclassOf<class UFabricGridStyle>           GridStyle;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFabricInteractableViewModel> ViewModelClass;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class UFabricInteractableViewModel* GetFabricViewModel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricWidget">();
	}
	static class UFabricWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricWidget>();
	}
};

// Class FabricUI.FabricWidgetComponent
// 0x0010 (0x0690 - 0x0680)
class UFabricWidgetComponent final : public UWidgetComponent
{
public:
	bool                                          bShouldSuscribeToSignificanceSubsystem;            // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_681[0xF];                                      // 0x0681(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetShouldSuscribeToSignificanceSubsystem(bool ShouldSuscribe);

	ETickMode GetTickMode() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricWidgetComponent">();
	}
	static class UFabricWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricWidgetComponent>();
	}
};

// Class FabricUI.FabricWidgetTickControlSubsystem
// 0x0018 (0x0058 - 0x0040)
class UFabricWidgetTickControlSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RegisterFabricWidgetComponent(class UFabricWidgetComponent* WidgetComponent);
	void UnregisterFabricWidgetComponent(class UFabricWidgetComponent* WidgetComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FabricWidgetTickControlSubsystem">();
	}
	static class UFabricWidgetTickControlSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFabricWidgetTickControlSubsystem>();
	}
};

}

