#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FabricMetasoundDataTypes

#include "Basic.hpp"


namespace SDK
{

// Enum FabricMetasoundDataTypes.EFabricUserOptionConversionType
// NumValues: 0x0004
enum class EFabricUserOptionConversionType : uint8
{
	Linear                                   = 0,
	Exponential                              = 1,
	Lookup                                   = 2,
	EFabricUserOptionConversionType_MAX      = 3,
};

// ScriptStruct FabricMetasoundDataTypes.FabricMetasoundDrumPlayerSampleData
// 0x0018 (0x0018 - 0x0000)
struct FFabricMetasoundDrumPlayerSampleData final
{
public:
	class FText                                   SampleLabel;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class USoundWave*                             WaveAsset;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct FabricMetasoundDataTypes.FabricUserOption
// 0x0020 (0x0020 - 0x0000)
struct FFabricUserOption final
{
public:
	EFabricUserOptionConversionType               ConversionType;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Min;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max;                                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValueCurve;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 LookupTable;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

}

