#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlyingCodeRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class FlyingCodeRuntime.FortCameraMode_Flying
// 0x0010 (0x1CE0 - 0x1CD0)
class UFortCameraMode_Flying final : public UFortCameraMode_ThirdPerson
{
public:
	float                                         LastActiveTimeSeconds;                             // 0x1CD0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1CD4[0xC];                                     // 0x1CD4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_ProcessViewRotation(const struct FRotator& InViewRotation, const struct FRotator& InDeltaRot, float DeltaTime, bool* bOutShouldOverride, struct FRotator* OutViewRotation, struct FRotator* OutDeltaRot) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCameraMode_Flying">();
	}
	static class UFortCameraMode_Flying* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCameraMode_Flying>();
	}
};

// Class FlyingCodeRuntime.FortMovementMode_FlyingRuntimeData
// 0x0038 (0x0070 - 0x0038)
class UFortMovementMode_FlyingRuntimeData : public UFortMovementMode_BaseExtRuntimeData
{
public:
	struct FVector2D                              MovementInput;                                     // 0x0038(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CeilingHeight;                                     // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               MoveOrientation;                                   // 0x0050(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_FlyingRuntimeData">();
	}
	static class UFortMovementMode_FlyingRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_FlyingRuntimeData>();
	}
};

// Class FlyingCodeRuntime.FortMovementMode_ExtLogicFlying
// 0x0000 (0x0110 - 0x0110)
class UFortMovementMode_ExtLogicFlying : public UFortMovementMode_BaseExtLogic
{
public:
	bool CanBeginFlying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicFlying">();
	}
	static class UFortMovementMode_ExtLogicFlying* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicFlying>();
	}
};

}

