#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMCalibrationRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "FMCalibrationRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// Class FMCalibrationRuntime.BeatmatchCalibrationHelper
// 0x0018 (0x00B8 - 0x00A0)
class UBeatmatchCalibrationHelper final : public UActorComponent
{
public:
	float                                         TightCalWindowMs;                                  // 0x00A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinTightCalSamples;                                // 0x00A4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LooseCalWindowMs;                                  // 0x00A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinLooseCalSamples;                                // 0x00AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSamplesBeforeFail;                              // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CalcCalibrationResult(const TArray<float>& Samples, const TArray<float>& SamplesDeltaTimes, float BPS, ECalibrationState* ResultingState, float* ResultMs);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BeatmatchCalibrationHelper">();
	}
	static class UBeatmatchCalibrationHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBeatmatchCalibrationHelper>();
	}
};

// Class FMCalibrationRuntime.FMCalibrationControllerComponent
// 0x00E8 (0x0188 - 0x00A0)
class UFMCalibrationControllerComponent final : public UControllerComponent
{
public:
	TMulticastInlineDelegate<void()>              OnCalibrationDataLoaded;                           // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCalibrationDataSaved;                            // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMCalibrationControllerComponent* CalibrationControllerComponent, float LatencyMs)> OnAudioLatencyMsUpdated; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMCalibrationControllerComponent* CalibrationControllerComponent, float LatencyMs)> OnVideoLatencyMsUpdated; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMCalibrationControllerComponent* CalibrationControllerComponent, bool IsCalibrated)> OnIsCalibratedUpdated; // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMCalibrationControllerComponent* CalibrationControllerComponent, bool IsPreambleDisabled)> OnIsPreambleDisabledUpdated; // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMCalibrationControllerComponent* CalibrationControllerComponent, bool IsAutolaunchDisabled)> OnIsAutolaunchDisabledUpdated; // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMCalibrationControllerComponent* CalibrationControllerComponent, bool IsCalibrationDebugEnabled)> OnIsCalibrationDebugEnabled; // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMCalibrationControllerComponent* CalibrationControllerComponent, bool IsCalibrationDebugEnabled)> OnHasTalkedWithRoadie; // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMCalibrationControllerComponent* CalibrationControllerComponent, bool UsePreamble)> OnCalibrationRequestOpenModal; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UFMCalibrationControllerComponent* CalibrationControllerComponent, const struct FGameplayTag& PreambleGameplayTag)> OnCalibrationRegisterPreamble; // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FVector2D                              AudioLatencyMsMinMax;                              // 0x0150(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              VideoLatencyMsMinMax;                              // 0x0160(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x10];                                     // 0x0170(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMCalibrationSaveData*                 CalibrationSaveData;                               // 0x0180(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void DisplayCalibrationWidget();
	void LoadCalibrationLocalToDevice();
	void SaveCalibrationLocalToDevice();
	void SendToggleModalMessage(class AActor* ContextActor, bool UsePreamble, bool bIsAutoLaunch);
	void SetAudioLatencyMs(float LatencyMs);
	void SetHasTalkedWithRoadie(bool bHasTalkedWithRoadie);
	void SetIsAutolaunchDisabled(bool bAutolaunchDisabled);
	void SetIsCalibrated(bool bCalibrated);
	void SetIsCalibrationDebugEnabled(bool bCalibrationDebugEnabled);
	void SetIsPreambleDisabled(bool bPreambleDisabled);
	void SetVideoLatencyMs(float LatencyMs);

	float GetAudioLatencyMs() const;
	bool GetHasTalkedWithRoadie() const;
	bool GetIsAutolaunchDisabled() const;
	bool GetIsCalibrated() const;
	bool GetIsCalibrationDebugEnabled() const;
	bool GetIsPreambleDisabled() const;
	float GetVideoLatencyMs() const;
	bool IsCalibrationDataLoaded() const;
	bool IsCalibrationDataOnLatestVersion() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMCalibrationControllerComponent">();
	}
	static class UFMCalibrationControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMCalibrationControllerComponent>();
	}
};

// Class FMCalibrationRuntime.FMCalibrationSaveData
// 0x0018 (0x0040 - 0x0028)
class UFMCalibrationSaveData final : public UObject
{
public:
	float                                         AudioLatencyMs;                                    // 0x0028(0x0004)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VideoLatencyMs;                                    // 0x002C(0x0004)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCalibrated;                                      // 0x0030(0x0001)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPreambleDisabled;                                // 0x0031(0x0001)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAutolaunchDisabled;                              // 0x0032(0x0001)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCalibrationDebugEnabled;                         // 0x0033(0x0001)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasTalkedWithRoadie;                               // 0x0034(0x0001)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SaveVersion;                                       // 0x0038(0x0004)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FMCalibrationSaveData">();
	}
	static class UFMCalibrationSaveData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFMCalibrationSaveData>();
	}
};

}

