#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMJamPlayspaceRuntime

#include "Basic.hpp"

#include "FMJamCoreRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FMCoreRuntime_structs.hpp"
#include "FMJamPlayspaceRuntime_structs.hpp"
#include "PlayspaceSystem_structs.hpp"
#include "SparksMusicPlayspaceRuntime_structs.hpp"


namespace SDK::Params
{

// Function FMJamPlayspaceRuntime.JamPlayspace.ConvertPlayerToAutoJammer
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspace_ConvertPlayerToAutoJammer final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.GetJamAudioSource
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspace_GetJamAudioSource final
{
public:
	class UAudioComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.PlayLoop
// 0x0018 (0x0018 - 0x0000)
struct JamPlayspace_PlayLoop final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SongShortName;                                     // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMJamLoopType                                LoopType;                                          // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceAudioState;                                  // 0x000D(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoJammer;                                     // 0x000E(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UJamMusicSlot*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.StopAllLoops
// 0x0001 (0x0001 - 0x0000)
struct JamPlayspace_StopAllLoops final
{
public:
	bool                                          bStopAutoJammers;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.StopAllLoopsForLoopType
// 0x0001 (0x0001 - 0x0000)
struct JamPlayspace_StopAllLoopsForLoopType final
{
public:
	EFMJamLoopType                                LoopType;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.StopAllLoopsWithTag
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspace_StopAllLoopsWithTag final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspace.StopAutoJammersForPlayer
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspace_StopAutoJammersForPlayer final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.StopLoopByInstanceId
// 0x0004 (0x0004 - 0x0000)
struct JamPlayspace_StopLoopByInstanceId final
{
public:
	int32                                         LoopInstanceId;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.StopLoopForPlayer
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspace_StopLoopForPlayer final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopAutoJammers;                                  // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspace.CountActiveLoops
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspace_CountActiveLoops final
{
public:
	bool                                          bCountAutoJammers;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.DoAnyOtherJammersHaveGameplayTag
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspace_DoAnyOtherJammersHaveGameplayTag final
{
public:
	const class APlayerState*                     LocalPlayerState;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GlobalControlsTag;                                 // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspace.GetAllowGlobalControlAccess
// 0x0028 (0x0028 - 0x0000)
struct JamPlayspace_GetAllowGlobalControlAccess final
{
public:
	bool                                          OutAllowGlobalControlAccess;                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  OutRestrictionReason;                              // 0x0008(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.GetAutoJammerProfilPic
// 0x0020 (0x0020 - 0x0000)
struct JamPlayspace_GetAutoJammerProfilPic final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.GetJammers
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspace_GetJammers final
{
public:
	TArray<class APlayerState*>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.GetMusicSlotForPlayer
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspace_GetMusicSlotForPlayer final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJamMusicSlot*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.GetMusicSlots
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspace_GetMusicSlots final
{
public:
	TArray<class UJamMusicSlot*>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.GetMusicSlotsForLoopType
// 0x0018 (0x0018 - 0x0000)
struct JamPlayspace_GetMusicSlotsForLoopType final
{
public:
	EFMJamLoopType                                LoopType;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJamMusicSlot*>                  ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.GetMusicSlotsInUse
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspace_GetMusicSlotsInUse final
{
public:
	TArray<class UJamMusicSlot*>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.GetMusicSlotsSortedByLoopType
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspace_GetMusicSlotsSortedByLoopType final
{
public:
	TArray<class UJamMusicSlot*>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspace.IsJamFull
// 0x0002 (0x0002 - 0x0000)
struct JamPlayspace_IsJamFull final
{
public:
	bool                                          bCountAutoJammers;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_JamCompanion.GetJamCompanionSlotTag
// 0x0004 (0x0004 - 0x0000)
struct JamPlayspaceComponent_JamCompanion_GetJamCompanionSlotTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_JamCompanion.BP_OnJamLoopStarted
// 0x0040 (0x0040 - 0x0000)
struct JamPlayspaceComponent_JamCompanion_BP_OnJamLoopStarted final
{
public:
	struct FJamEvent_JamLoopStarted               Payload;                                           // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_JamCompanion.BP_OnJamLoopStopped
// 0x0040 (0x0040 - 0x0000)
struct JamPlayspaceComponent_JamCompanion_BP_OnJamLoopStopped final
{
public:
	struct FJamEvent_JamLoopStopped               Payload;                                           // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_JamCompanion.GetEventRouter
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_JamCompanion_GetEventRouter final
{
public:
	class UGameplayEventRouterComponent*          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_JamCompanion.GetJamPlayspace
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_JamCompanion_GetJamPlayspace final
{
public:
	class AJamPlayspace*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_JamCompanion.GetMusicManager
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_JamCompanion_GetMusicManager final
{
public:
	class UJamPlayspaceComponent_MusicManager*    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.AddGameplayTag
// 0x0004 (0x0004 - 0x0000)
struct JamMusicSlot_AddGameplayTag final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.OnCMSCatalogRequestFinished
// 0x0010 (0x0010 - 0x0000)
struct JamMusicSlot_OnCMSCatalogRequestFinished final
{
public:
	class UFMJamSongCatalog*                      Sender;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.OnJamLoadRequestComplete
// 0x0038 (0x0038 - 0x0000)
struct JamMusicSlot_OnJamLoadRequestComplete final
{
public:
	struct FJamLoadResult                         LoadResult;                                        // 0x0000(0x0038)(ConstParm, Parm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.OnJamResolverComplete
// 0x0020 (0x0020 - 0x0000)
struct JamMusicSlot_OnJamResolverComplete final
{
public:
	class UJamContentResolver*                    Sender;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LinkCode;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasAlreadyLoaded;                                 // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.OnRep_CurrentPlayParams
// 0x0028 (0x0028 - 0x0000)
struct JamMusicSlot_OnRep_CurrentPlayParams final
{
public:
	struct FJamPlayParams                         OldPlayParams;                                     // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.OnScanForSongsCompleted
// 0x0018 (0x0018 - 0x0000)
struct JamMusicSlot_OnScanForSongsCompleted final
{
public:
	class UFMJamSongCatalog*                      Sender;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFMJamSong*>                     AddedSongs;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.OnTerminatingLinkCode
// 0x0018 (0x0018 - 0x0000)
struct JamMusicSlot_OnTerminatingLinkCode final
{
public:
	class UJamContentResolver*                    Sender;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LinkCode;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.RemoveGameplayTag
// 0x0008 (0x0008 - 0x0000)
struct JamMusicSlot_RemoveGameplayTag final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentCatalogEntry
// 0x0008 (0x0008 - 0x0000)
struct JamMusicSlot_GetCurrentCatalogEntry final
{
public:
	const class UCatalogData*                     ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentKey
// 0x0001 (0x0001 - 0x0000)
struct JamMusicSlot_GetCurrentKey final
{
public:
	EMusicKey                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentLoop
// 0x0008 (0x0008 - 0x0000)
struct JamMusicSlot_GetCurrentLoop final
{
public:
	const class UFMJamLoop*                       ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentLoopInstanceId
// 0x0004 (0x0004 - 0x0000)
struct JamMusicSlot_GetCurrentLoopInstanceId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentLoopType
// 0x0001 (0x0001 - 0x0000)
struct JamMusicSlot_GetCurrentLoopType final
{
public:
	EFMJamLoopType                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentMode
// 0x0001 (0x0001 - 0x0000)
struct JamMusicSlot_GetCurrentMode final
{
public:
	EMusicKeyMode                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentPlayerState
// 0x0008 (0x0008 - 0x0000)
struct JamMusicSlot_GetCurrentPlayerState final
{
public:
	class APlayerState*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentSong
// 0x0008 (0x0008 - 0x0000)
struct JamMusicSlot_GetCurrentSong final
{
public:
	const class UFMJamSong*                       ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentSongLinkCode
// 0x0010 (0x0010 - 0x0000)
struct JamMusicSlot_GetCurrentSongLinkCode final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentSongShortName
// 0x0004 (0x0004 - 0x0000)
struct JamMusicSlot_GetCurrentSongShortName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetCurrentTempo
// 0x0004 (0x0004 - 0x0000)
struct JamMusicSlot_GetCurrentTempo final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetIsAutoJammer
// 0x0001 (0x0001 - 0x0000)
struct JamMusicSlot_GetIsAutoJammer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetMusicManager
// 0x0008 (0x0008 - 0x0000)
struct JamMusicSlot_GetMusicManager final
{
public:
	class UJamPlayspaceComponent_MusicManager*    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetParamsAsJamEvent
// 0x0040 (0x0040 - 0x0000)
struct JamMusicSlot_GetParamsAsJamEvent final
{
public:
	struct FJamEvent_JamLoopStarted               ReturnValue;                                       // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.GetPlayParams
// 0x0028 (0x0028 - 0x0000)
struct JamMusicSlot_GetPlayParams final
{
public:
	struct FJamPlayParams                         ReturnValue;                                       // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.HasGameplayTag
// 0x0008 (0x0008 - 0x0000)
struct JamMusicSlot_HasGameplayTag final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamMusicSlot.IsInUse
// 0x0001 (0x0001 - 0x0000)
struct JamMusicSlot_IsInUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.IsAllowedToJamInSplitscreen
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_IsAllowedToJamInSplitscreen final
{
public:
	class APlayerState*                           PlayerStateToCheck;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.FireGlobalControlsAnalytics
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_MusicManager_FireGlobalControlsAnalytics final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.HandleKeyChangedEvent
// 0x0001 (0x0001 - 0x0000)
struct JamPlayspaceComponent_MusicManager_HandleKeyChangedEvent final
{
public:
	struct FSparksPlayspaceEvent_KeyChanged       Payload;                                           // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.HandleModeChangedEvent
// 0x0001 (0x0001 - 0x0000)
struct JamPlayspaceComponent_MusicManager_HandleModeChangedEvent final
{
public:
	struct FSparksPlayspaceEvent_KeyModeChanged   Payload;                                           // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.HandleOnLoopStarted
// 0x002C (0x002C - 0x0000)
struct JamPlayspaceComponent_MusicManager_HandleOnLoopStarted final
{
public:
	struct FJamPlayParams                         PlayParams;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bChangedLoop;                                      // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.HandleOnLoopStopped
// 0x002C (0x002C - 0x0000)
struct JamPlayspaceComponent_MusicManager_HandleOnLoopStopped final
{
public:
	struct FJamPlayParams                         PlayParams;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bChangedLoop;                                      // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.HandleTempoChangedEvent
// 0x0004 (0x0004 - 0x0000)
struct JamPlayspaceComponent_MusicManager_HandleTempoChangedEvent final
{
public:
	struct FSparksPlayspaceEvent_TempoChanged     Payload;                                           // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.OnPlayspaceUserAdded
// 0x0058 (0x0058 - 0x0000)
struct JamPlayspaceComponent_MusicManager_OnPlayspaceUserAdded final
{
public:
	struct FPlayspaceUser                         AddedUser;                                         // 0x0000(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.OnPlayspaceUserRemoved
// 0x0058 (0x0058 - 0x0000)
struct JamPlayspaceComponent_MusicManager_OnPlayspaceUserRemoved final
{
public:
	struct FPlayspaceUser                         RemovedUser;                                       // 0x0000(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.OnRep_MusicSlots
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_OnRep_MusicSlots final
{
public:
	TArray<class UJamMusicSlot*>                  PreviousMusicSlots;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.UpdateAllMetasounds
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_MusicManager_UpdateAllMetasounds final
{
public:
	const class APlayerState*                     PlayerToIgnore;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.CountActiveSlots
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_MusicManager_CountActiveSlots final
{
public:
	bool                                          bCountAutoJammers;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetAllJammers
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetAllJammers final
{
public:
	TArray<class APlayerState*>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetAllMusicSlots
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetAllMusicSlots final
{
public:
	TArray<class UJamMusicSlot*>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetAllSlotsWithTag
// 0x0018 (0x0018 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetAllSlotsWithTag final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJamMusicSlot*>                  ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetAutoJammersForPlayer
// 0x0018 (0x0018 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetAutoJammersForPlayer final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UJamMusicSlot*>                  ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetCurrentKey
// 0x0001 (0x0001 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetCurrentKey final
{
public:
	EMusicKey                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetCurrentMidiSeconds
// 0x0004 (0x0004 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetCurrentMidiSeconds final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetCurrentMidiTick
// 0x0004 (0x0004 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetCurrentMidiTick final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetCurrentMode
// 0x0001 (0x0001 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetCurrentMode final
{
public:
	EMusicKeyMode                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetCurrentTempo
// 0x0004 (0x0004 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetCurrentTempo final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetDesiredGain
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetDesiredGain final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetJamPlayspace
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetJamPlayspace final
{
public:
	class AJamPlayspace*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetLoadedAnimations
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetLoadedAnimations final
{
public:
	class USparksInstrumentAnimations*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetLocalPlayerGainValue
// 0x0004 (0x0004 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetLocalPlayerGainValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetMetasoundPlayer
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetMetasoundPlayer final
{
public:
	class UAudioComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetMusicSlotByLoopInstanceId
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetMusicSlotByLoopInstanceId final
{
public:
	int32                                         LoopInstanceId;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJamMusicSlot*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetMusicSlotBySlotIndex
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetMusicSlotBySlotIndex final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJamMusicSlot*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetMusicSlotForPlayer
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetMusicSlotForPlayer final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJamMusicSlot*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetMusicSlotIndexForLoopInstanceId
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetMusicSlotIndexForLoopInstanceId final
{
public:
	int32                                         LoopInstanceId;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetMusicSlotIndexForPlayer
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetMusicSlotIndexForPlayer final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetMusicSlotsForLoopType
// 0x0018 (0x0018 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetMusicSlotsForLoopType final
{
public:
	EFMJamLoopType                                LoopType;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJamMusicSlot*>                  ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetMusicSlotsInUse
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetMusicSlotsInUse final
{
public:
	TArray<class UJamMusicSlot*>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.GetStandardGainValue
// 0x0004 (0x0004 - 0x0000)
struct JamPlayspaceComponent_MusicManager_GetStandardGainValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.SecondsToTick
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_MusicManager_SecondsToTick final
{
public:
	float                                         Seconds;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.ShouldPlayLocalSound
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_MusicManager_ShouldPlayLocalSound final
{
public:
	const class APlayerState*                     PlayerToIgnore;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_MusicManager.TickToSeconds
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_MusicManager_TickToSeconds final
{
public:
	int32                                         Tick;                                              // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_ReactiveFX.AddReactiveNiagaraEffect
// 0x0010 (0x0010 - 0x0000)
struct JamPlayspaceComponent_ReactiveFX_AddReactiveNiagaraEffect final
{
public:
	int32                                         LoopInstanceId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_ReactiveFX.ClearReactiveEffects
// 0x0001 (0x0001 - 0x0000)
struct JamPlayspaceComponent_ReactiveFX_ClearReactiveEffects final
{
public:
	bool                                          bStopEffectsImmediately;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_ReactiveFX.ClearReactiveEffectsForLoop
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_ReactiveFX_ClearReactiveEffectsForLoop final
{
public:
	int32                                         LoopInstanceId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopEffectsImmediately;                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_ReactiveFX.HasReactiveEffectsForLoop
// 0x0008 (0x0008 - 0x0000)
struct JamPlayspaceComponent_ReactiveFX_HasReactiveEffectsForLoop final
{
public:
	int32                                         LoopInstanceId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_ReactiveFX.RemoveReactiveNiagaraEffect
// 0x0018 (0x0018 - 0x0000)
struct JamPlayspaceComponent_ReactiveFX_RemoveReactiveNiagaraEffect final
{
public:
	int32                                         LoopInstanceId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamPlayspaceRuntime.JamPlayspaceComponent_ReactiveFX.GetReactiveNiagaraEffects
// 0x0018 (0x0018 - 0x0000)
struct JamPlayspaceComponent_ReactiveFX_GetReactiveNiagaraEffects final
{
public:
	int32                                         LoopInstanceId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              ReturnValue;                                       // 0x0008(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FMJamPlayspaceRuntime.JamPlayspaceVolume.BP_UpdateReactiveFX
// 0x0004 (0x0004 - 0x0000)
struct JamPlayspaceVolume_BP_UpdateReactiveFX final
{
public:
	float                                         JamAmplitude;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

