#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FMJamCatalogRuntime

#include "Basic.hpp"

#include "FMCoreRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FMJamCoreRuntime_structs.hpp"


namespace SDK::Params
{

// Function FMJamCatalogRuntime.FMJamLoop.GetKey
// 0x0001 (0x0001 - 0x0000)
struct FMJamLoop_GetKey final
{
public:
	EMusicKey                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamLoop.GetLoopType
// 0x0001 (0x0001 - 0x0000)
struct FMJamLoop_GetLoopType final
{
public:
	EFMJamLoopType                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamLoop.GetMajorMidi
// 0x0040 (0x0040 - 0x0000)
struct FMJamLoop_GetMajorMidi final
{
public:
	TSoftObjectPtr<class UMidiFile>               OutMetasoundMidi;                                  // 0x0000(0x0020)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFusionPatch>            OutMetasoundFusion;                                // 0x0020(0x0020)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamLoop.GetMidi
// 0x0048 (0x0048 - 0x0000)
struct FMJamLoop_GetMidi final
{
public:
	EMusicKeyMode                                 Mode;                                              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMidiFile>               OutMetasoundMidi;                                  // 0x0008(0x0020)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFusionPatch>            OutMetasoundFusion;                                // 0x0028(0x0020)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamLoop.GetMinorMidi
// 0x0040 (0x0040 - 0x0000)
struct FMJamLoop_GetMinorMidi final
{
public:
	TSoftObjectPtr<class UMidiFile>               OutMetasoundMidi;                                  // 0x0000(0x0020)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFusionPatch>            OutMetasoundFusion;                                // 0x0020(0x0020)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamLoop.GetSemitoneTranspose
// 0x0008 (0x0008 - 0x0000)
struct FMJamLoop_GetSemitoneTranspose final
{
public:
	EMusicKey                                     ToKey;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamLoop.GetSong
// 0x0008 (0x0008 - 0x0000)
struct FMJamLoop_GetSong final
{
public:
	class UFMJamSong*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamLoop.HasPitch
// 0x0001 (0x0001 - 0x0000)
struct FMJamLoop_HasPitch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSong.GetAdditionalTags
// 0x0020 (0x0020 - 0x0000)
struct FMJamSong_GetAdditionalTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSong.GetArtist
// 0x0010 (0x0010 - 0x0000)
struct FMJamSong_GetArtist final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSong.GetKey
// 0x0001 (0x0001 - 0x0000)
struct FMJamSong_GetKey final
{
public:
	EMusicKey                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSong.GetLipSyncAnimAsset
// 0x0020 (0x0020 - 0x0000)
struct FMJamSong_GetLipSyncAnimAsset final
{
public:
	TSoftObjectPtr<class UAnimSequence>           ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSong.GetLoop
// 0x0010 (0x0010 - 0x0000)
struct FMJamSong_GetLoop final
{
public:
	EFMJamLoopType                                LoopType;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMJamLoop*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSong.GetLoopTypeForLoop
// 0x0010 (0x0010 - 0x0000)
struct FMJamSong_GetLoopTypeForLoop final
{
public:
	const class UFMJamLoop*                       Loop;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMJamLoopType                                ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamCatalogRuntime.FMJamSong.GetMode
// 0x0001 (0x0001 - 0x0000)
struct FMJamSong_GetMode final
{
public:
	EMusicKeyMode                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSong.GetSongShortName
// 0x0004 (0x0004 - 0x0000)
struct FMJamSong_GetSongShortName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSong.GetTempo
// 0x0004 (0x0004 - 0x0000)
struct FMJamSong_GetTempo final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSong.GetTitle
// 0x0010 (0x0010 - 0x0000)
struct FMJamSong_GetTitle final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSongCatalog.GetFMJamSongCatalog
// 0x0010 (0x0010 - 0x0000)
struct FMJamSongCatalog_GetFMJamSongCatalog final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMJamSongCatalog*                      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSongCatalog.GetLoopTypeByTag
// 0x0008 (0x0008 - 0x0000)
struct FMJamSongCatalog_GetLoopTypeByTag final
{
public:
	struct FGameplayTag                           LoopTag;                                           // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMJamLoopType                                ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamCatalogRuntime.FMJamSongCatalog.GetLoopTypeText
// 0x0018 (0x0018 - 0x0000)
struct FMJamSongCatalog_GetLoopTypeText final
{
public:
	EFMJamLoopType                                LoopType;                                          // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSongCatalog.TryGetFMJamSongCatalog
// 0x0010 (0x0010 - 0x0000)
struct FMJamSongCatalog_TryGetFMJamSongCatalog final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMJamSongCatalog*                      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSongCatalog.OnSongCatalogRetrieved
// 0x0001 (0x0001 - 0x0000)
struct FMJamSongCatalog_OnSongCatalogRetrieved final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSongCatalog.GetSongByShortName
// 0x0010 (0x0010 - 0x0000)
struct FMJamSongCatalog_GetSongByShortName final
{
public:
	class FName                                   ShortName;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMJamSong*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSongCatalog.GetSongCatalogEntryByShortName
// 0x0010 (0x0010 - 0x0000)
struct FMJamSongCatalog_GetSongCatalogEntryByShortName final
{
public:
	class FName                                   ShortName;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCatalogData*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FMJamSongCatalog.HaveCMSSongCatalog
// 0x0001 (0x0001 - 0x0000)
struct FMJamSongCatalog_HaveCMSSongCatalog final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FMJamCatalogRuntime.FortJamEmoteItemDefinition.GetJamSongShortNameForPlayer
// 0x0010 (0x0010 - 0x0000)
struct FortJamEmoteItemDefinition_GetJamSongShortNameForPlayer final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FMJamCatalogRuntime.FortJamEmoteItemDefinition.IsJamLoopEnabled
// 0x0010 (0x0010 - 0x0000)
struct FortJamEmoteItemDefinition_IsJamLoopEnabled final
{
public:
	const class AFortPlayerController*            PlayerController;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

