#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortVehicleSimulationStepsRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum FortVehicleSimulationStepsRuntime.EVehicleSimStep
// NumValues: 0x0035
enum class EVehicleSimStep : uint8
{
	None                                     = 0,
	Update                                   = 1,
	UpdateSleepType                          = 2,
	UpdatePlatform                           = 3,
	UpdateBoundarySpline                     = 4,
	UpdateIgnoredPawnsForDamage              = 5,
	UpdatePredictedDestroyedBuildings        = 6,
	UpdateForcedDebugInput                   = 7,
	UpdateAutoCameraTimer                    = 8,
	UpdateCameraOffset                       = 9,
	UpdateLocalPlayerInVehicle               = 10,
	UpdateOverlappingWaterBodies             = 11,
	UpdateIgnoredBuildingActors              = 12,
	UpdateFOV                                = 13,
	UpdateAutoEject                          = 14,
	UpdateHonk                               = 15,
	UpdateOnFire                             = 16,
	UpdateExplodeDelay                       = 17,
	UpdateWaterIdle                          = 18,
	UpdateFX                                 = 19,
	UpdateAutoRun                            = 20,
	UpdateWorldMovementDir                   = 21,
	UpdatePlayerGravityScales                = 22,
	UpdateSafeTeleport                       = 23,
	UpdateWaterLevel                         = 24,
	UpdateWaterTest                          = 25,
	UpdatePontoons                           = 26,
	UpdateOrientationCorrection              = 27,
	UpdateReplicatedAttributes               = 28,
	UpdateImpactBuckets                      = 29,
	UpdateCameraShakeTick                    = 30,
	UpdateForceFeedbackTick                  = 31,
	UpdateAudioTick                          = 32,
	UpdateFXTick                             = 33,
	UpdatePhysicsSimulation                  = 34,
	UpdateSurfaceTypeVehicleIsOn             = 35,
	UpdateRimScraping                        = 36,
	UpdateInterfaceFrameUpdate               = 37,
	AsyncTick                                = 38,
	SKVehicleUpdateWheels                    = 39,
	SKMotorUpdateCosmeticEffectParams        = 40,
	DagwoodUpdateAsyncDriverIO               = 41,
	DagwoodUpdatePushDriveMode               = 42,
	DagwoodUpdateBoost                       = 43,
	DagwoodUpdateCameraAssist                = 44,
	DagwoodUpdatePassengersLeaning           = 45,
	DagwoodUpdateDestroyInitiallyOverlappingActors = 46,
	DagwoodUpdatePlayersBasedOnVehicle       = 47,
	DagwoodUpdateSelfDestruct                = 48,
	MotorcycleUpdatePassengerAnimations      = 49,
	MotorcycleUpdateCameraAssist             = 50,
	MotorcycleUpdateDoorBash                 = 51,
	MAX                                      = 52,
};

// Enum FortVehicleSimulationStepsRuntime.EVehicleSimStepFlags
// NumValues: 0x0007
enum class EVehicleSimStepFlags : uint8
{
	None                                     = 0,
	ServerEnabled                            = 1,
	LocalClientEnabled                       = 2,
	RemoteClientEnabled                      = 4,
	RemoteDisabled                           = 3,
	AllEnabled                               = 7,
	EVehicleSimStepFlags_MAX                 = 8,
};

// ScriptStruct FortVehicleSimulationStepsRuntime.FortVehicleSimulationStepOverrideTableRow
// 0x0008 (0x0010 - 0x0008)
struct FFortVehicleSimulationStepOverrideTableRow final : public FTableRowBase
{
public:
	EVehicleSimStep                               SimulationStep;                                    // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVehicleSimStepFlags                          SimulationStepFlags;                               // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct FortVehicleSimulationStepsRuntime.FortVehicleSimulationConfigTableRow
// 0x0008 (0x0010 - 0x0008)
struct FFortVehicleSimulationConfigTableRow final : public FTableRowBase
{
public:
	bool                                          bIsSimulationManagerEnabled;                       // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVehicleSimStepFlags                          DefaultSimulationStepFlags;                        // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

