#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortOvershieldHelpers

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// ScriptStruct FortOvershieldHelpers.FortOvershieldDelegateContainer
// 0x0048 (0x0048 - 0x0000)
struct FFortOvershieldDelegateContainer final
{
public:
	TDelegate<void()>                             OnOvershieldChanged;                               // 0x0000(0x000C)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnShieldedDamage;                                  // 0x000C(0x000C)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnOvershieldedDamage;                              // 0x0018(0x000C)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class AActor* Instigator)> OnShieldDestroyed;                               // 0x0024(0x000C)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class AActor* Instigator)> OnOvershieldDestroyed;                           // 0x0030(0x000C)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGameplayEventData& Payload)> OnDamageReceived;                      // 0x003C(0x000C)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

