#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortVehicleSimulationStepsRuntime

#include "Basic.hpp"

#include "FortVehicleSimulationStepsRuntime_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class FortVehicleSimulationStepsRuntime.FortVehicleSimulationStepsManager
// 0x00F8 (0x0120 - 0x0028)
class UFortVehicleSimulationStepsManager final : public UObject
{
public:
	bool                                          bEnabled;                                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EVehicleSimStepFlags                          DefaultSimulationStepFlags;                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataRegistryType                      DataRegistryType_VehicleSimulationStepsPermissions; // 0x002C(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataRegistryType                      DataRegistryType_VehicleSimulationStepsConfig;     // 0x0030(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0xEC];                                      // 0x0034(0x00EC)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSimulationStepsManager">();
	}
	static class UFortVehicleSimulationStepsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSimulationStepsManager>();
	}
};

}

