#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteConversationRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonConversationRuntime_structs.hpp"
#include "CommonConversationRuntime_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FortniteConversationRuntime.FortConversationGetGraphInterface
// 0x0000 (0x0000 - 0x0000)
class IFortConversationGetGraphInterface final
{
public:
	const class UConversationDatabase* GetConversationGraph();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationGetGraphInterface">();
	}
	static class IFortConversationGetGraphInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortConversationGetGraphInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FortniteConversationRuntime.FortConversationMarkerInterface
// 0x0000 (0x0000 - 0x0000)
class IFortConversationMarkerInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationMarkerInterface">();
	}
	static class IFortConversationMarkerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortConversationMarkerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class FortniteConversationRuntime.FortConversationParticipantComponent
// 0x0000 (0x0190 - 0x0190)
class UFortConversationParticipantComponent : public UConversationParticipantComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationParticipantComponent">();
	}
	static class UFortConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationParticipantComponent>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextCondition
// 0x0000 (0x0028 - 0x0028)
class UFortConversationContextCondition : public UObject
{
public:
	bool DoesContextPass(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextCondition">();
	}
	static class UFortConversationContextCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextCondition>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextCondition_ParticipantHasCID
// 0x0018 (0x0040 - 0x0028)
class UFortConversationContextCondition_ParticipantHasCID final : public UFortConversationContextCondition
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0028(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                AllowedCIDs;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextCondition_ParticipantHasCID">();
	}
	static class UFortConversationContextCondition_ParticipantHasCID* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextCondition_ParticipantHasCID>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextCondition_ParticipantHasMetaTag
// 0x0008 (0x0030 - 0x0028)
class UFortConversationContextCondition_ParticipantHasMetaTag final : public UFortConversationContextCondition
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0028(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           MetaTag;                                           // 0x002C(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextCondition_ParticipantHasMetaTag">();
	}
	static class UFortConversationContextCondition_ParticipantHasMetaTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextCondition_ParticipantHasMetaTag>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextCondition_ParticipantHasOwnedTag
// 0x0008 (0x0030 - 0x0028)
class UFortConversationContextCondition_ParticipantHasOwnedTag final : public UFortConversationContextCondition
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0028(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           OwnedTag;                                          // 0x002C(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextCondition_ParticipantHasOwnedTag">();
	}
	static class UFortConversationContextCondition_ParticipantHasOwnedTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextCondition_ParticipantHasOwnedTag>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextCondition_ParticipantControllerMeetsRequirement
// 0x0010 (0x0038 - 0x0028)
class UFortConversationContextCondition_ParticipantControllerMeetsRequirement final : public UFortConversationContextCondition
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0028(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortControllerRequirement*             Requirement;                                       // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextCondition_ParticipantControllerMeetsRequirement">();
	}
	static class UFortConversationContextCondition_ParticipantControllerMeetsRequirement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextCondition_ParticipantControllerMeetsRequirement>();
	}
};

// Class FortniteConversationRuntime.FortConversationContextConditionHelpers
// 0x0000 (0x0028 - 0x0028)
class UFortConversationContextConditionHelpers final : public UBlueprintFunctionLibrary
{
public:
	static bool GetMessageForContext(const struct FFortConversationNodeConditionalMessages& Messages, const struct FConversationContext& Context, class FText* OutText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationContextConditionHelpers">();
	}
	static class UFortConversationContextConditionHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationContextConditionHelpers>();
	}
};

// Class FortniteConversationRuntime.FortConversationParamLibrary
// 0x0000 (0x0028 - 0x0028)
class UFortConversationParamLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool ExtractConversationParameterValue(const TArray<struct FConversationNodeParameterPair>& ConversationParameters, const class FString& DesiredParameterName, class FString* ParameterValueOut);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortConversationParamLibrary">();
	}
	static class UFortConversationParamLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationParamLibrary>();
	}
};

// Class FortniteConversationRuntime.FortniteConversationGlobals
// 0x0000 (0x0028 - 0x0028)
class UFortniteConversationGlobals final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortniteConversationGlobals">();
	}
	static class UFortniteConversationGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortniteConversationGlobals>();
	}
};

// Class FortniteConversationRuntime.FortPlayerConversationComponent
// 0x0248 (0x03D8 - 0x0190)
class UFortPlayerConversationComponent final : public UFortConversationParticipantComponent
{
public:
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortNonPlayerConversationParticipantComponent*> ConversationParticipantsInRange;   // 0x0198(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	float                                         GreetSphereRadius;                                 // 0x01A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         IconVisibilityRadius;                              // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AbortConversationRange;                            // 0x01B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           RidingOnActorTag;                                  // 0x01B4(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RidingOnActorRangeMultiplierSquared;               // 0x01B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1BC[0x3C];                                     // 0x01BC(0x003C)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UFortNonPlayerConversationParticipantComponent*> IndicatedNPCConversationComponents;  // 0x01F8(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bMoveShouldAbortConversation;                      // 0x0250(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCachedDefaultMoveShouldAbortConverationValue;     // 0x0251(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_252[0x11E];                                    // 0x0252(0x011E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientConversationMessagePayload      LastSanitizationMessage;                           // 0x0370(0x0068)(NativeAccessSpecifierPrivate)

public:
	void ClientReceiveConversationGiftUINotification(const struct FGiftUINotificationInfo& ConversationGiftUINotification);
	void ClientSpectatorCloseUI();
	void ClientSpectatorEnterConversationState();
	void ClientSpectatorLeaveConversationState();
	void ClientSpectatorOpenUI();
	void HandleDBNOChanged(class AFortPawn* Pawn, bool bIsDBNO);
	void HandleFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* FollowedPlayerState);
	void HandlePossessedPawnChangedWhileRefreshTriggersBound(class APawn* OldPawn, class APawn* NewPawn);
	void HandleViewTargetChanged();
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void RequestServerAbortConversation();
	void RequestServerAbortConversationWithParticipant(const class UFortNonPlayerConversationParticipantComponent* Participant);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerConversationComponent">();
	}
	static class UFortPlayerConversationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerConversationComponent>();
	}
};

}

