#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteGameFramework

#include "Basic.hpp"

#include "FortniteGameFramework_structs.hpp"
#include "Engine_classes.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// Class FortniteGameFramework.FGF_Character
// 0x0060 (0x06C0 - 0x0660)
class AFGF_Character : public ACharacter
{
public:
	uint8                                         Pad_660[0x60];                                     // 0x0660(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_Character">();
	}
	static class AFGF_Character* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_Character>();
	}
};

// Class FortniteGameFramework.FGF_GameMode
// 0x0058 (0x03C8 - 0x0370)
class AFGF_GameMode : public AGameMode
{
public:
	uint8                                         Pad_370[0x58];                                     // 0x0370(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_GameMode">();
	}
	static class AFGF_GameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_GameMode>();
	}
};

// Class FortniteGameFramework.FGF_GameState
// 0x0060 (0x0360 - 0x0300)
class AFGF_GameState : public AGameState
{
public:
	uint8                                         Pad_300[0x60];                                     // 0x0300(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_GameState">();
	}
	static class AFGF_GameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_GameState>();
	}
};

// Class FortniteGameFramework.FGF_PlayerController
// 0x0058 (0x08B0 - 0x0858)
class AFGF_PlayerController : public APlayerController
{
public:
	uint8                                         Pad_858[0x58];                                     // 0x0858(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_PlayerController">();
	}
	static class AFGF_PlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_PlayerController>();
	}
};

// Class FortniteGameFramework.FGF_PlayerState
// 0x0058 (0x03A0 - 0x0348)
class AFGF_PlayerState : public APlayerState
{
public:
	uint8                                         Pad_348[0x58];                                     // 0x0348(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FGF_PlayerState">();
	}
	static class AFGF_PlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFGF_PlayerState>();
	}
};

// Class FortniteGameFramework.ObjectBasedStateTreeSchema
// 0x0000 (0x0028 - 0x0028)
class UObjectBasedStateTreeSchema final : public UStateTreeSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectBasedStateTreeSchema">();
	}
	static class UObjectBasedStateTreeSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectBasedStateTreeSchema>();
	}
};

// Class FortniteGameFramework.StateTreeManagerComponent
// 0x0140 (0x01E0 - 0x00A0)
class UStateTreeManagerComponent final : public UActorComponent
{
public:
	TArray<struct FStateTreeRuntimeData>          StateTreeRuntimeDataList;                          // 0x00A0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FStateTreeClientSimulationData> SimulatedDataList;                                 // 0x00B0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FStateChangeDataArray                  ReplicatedStateChanges;                            // 0x00C0(0x0120)(Net, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeManagerComponent">();
	}
	static class UStateTreeManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeManagerComponent>();
	}
};

// Class FortniteGameFramework.StateTreeTaskObject
// 0x0008 (0x0060 - 0x0058)
class UStateTreeTaskObject final : public UStateTreeTaskBlueprintBase
{
public:
	bool                                          bReplicates;                                       // 0x0058(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeTaskObject">();
	}
	static class UStateTreeTaskObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeTaskObject>();
	}
};

}

