#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortCreativeStreamingComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EpicMediaBasePlayer_structs.hpp"
#include "FortCreativeStreamingComponent_structs.hpp"


namespace SDK::Params
{

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.CMSEventEnded
// 0x0008 (0x0008 - 0x0000)
struct FortCreativeStreamingComponent_CMSEventEnded final
{
public:
	const class UMediaCMSEvent*                   Event;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.CMSEventStarted
// 0x0008 (0x0008 - 0x0000)
struct FortCreativeStreamingComponent_CMSEventStarted final
{
public:
	const class UMediaCMSEvent*                   Event;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.DisableScreenAndAudio
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeStreamingComponent_DisableScreenAndAudio final
{
public:
	bool                                          bDisabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.HandleCMSEvents
// 0x0040 (0x0040 - 0x0000)
struct FortCreativeStreamingComponent_HandleCMSEvents final
{
public:
	struct FVideoPlayerDeviceCMSEventData         EventData;                                         // 0x0000(0x0038)(Parm, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.HandleVideoStreamingTerminalError
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeStreamingComponent_HandleVideoStreamingTerminalError final
{
public:
	EBaseMediaTerminalErrorReason                 ErrorReason;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.Init
// 0x0010 (0x0010 - 0x0000)
struct FortCreativeStreamingComponent_Init final
{
public:
	bool                                          InUsesAudio;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InUsesVideo;                                       // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   ScreenMesh;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.OnAudioAnalysisSpectrumUpdated
// 0x0010 (0x0010 - 0x0000)
struct FortCreativeStreamingComponent_OnAudioAnalysisSpectrumUpdated final
{
public:
	TArray<float>                                 MagnitudeArray;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.OnMediaSoundComponentActivated
// 0x0010 (0x0010 - 0x0000)
struct FortCreativeStreamingComponent_OnMediaSoundComponentActivated final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReset;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.Seek
// 0x0008 (0x0008 - 0x0000)
struct FortCreativeStreamingComponent_Seek final
{
public:
	struct FTimespan                              SeekTime;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.SetFullScreenComponents
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeStreamingComponent_SetFullScreenComponents final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.SetRestartStreamWhenPlaying
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeStreamingComponent_SetRestartStreamWhenPlaying final
{
public:
	bool                                          bNewRestartStreamWhenPlaying;                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.UpdateStaticMesh
// 0x0008 (0x0008 - 0x0000)
struct FortCreativeStreamingComponent_UpdateStaticMesh final
{
public:
	class UStaticMeshComponent*                   ScreenMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.UseMirrorMode
// 0x0008 (0x0008 - 0x0000)
struct FortCreativeStreamingComponent_UseMirrorMode final
{
public:
	class AActor*                                 NewMirrorDevice;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.UseMirrorModeByName
// 0x0010 (0x0010 - 0x0000)
struct FortCreativeStreamingComponent_UseMirrorModeByName final
{
public:
	class FString                                 DeviceName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.GetDeviceComponents
// 0x0030 (0x0030 - 0x0000)
struct FortCreativeStreamingComponent_GetDeviceComponents final
{
public:
	struct FVideoPlayerDeviceComponents           ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.GetDeviceState
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeStreamingComponent_GetDeviceState final
{
public:
	EFortStreamingVideoDeviceState                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.GetFortBaseStreamingVideo
// 0x0008 (0x0008 - 0x0000)
struct FortCreativeStreamingComponent_GetFortBaseStreamingVideo final
{
public:
	class UFortBaseStreamingVideo*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.GetStreamingComponents
// 0x0030 (0x0030 - 0x0000)
struct FortCreativeStreamingComponent_GetStreamingComponents final
{
public:
	struct FVideoPlayerDeviceComponents           ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.GetStreamingController
// 0x0008 (0x0008 - 0x0000)
struct FortCreativeStreamingComponent_GetStreamingController final
{
public:
	class AFortCreativeStreamingController*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.GetStreamingDevice
// 0x0008 (0x0008 - 0x0000)
struct FortCreativeStreamingComponent_GetStreamingDevice final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.GetStreamingVideoSelectionMode
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeStreamingComponent_GetStreamingVideoSelectionMode final
{
public:
	EFortStreamingVideoSelectionMode              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.IsComponentInitialized
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeStreamingComponent_IsComponentInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.IsDevicePlaying
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeStreamingComponent_IsDevicePlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortCreativeStreamingComponent.FortCreativeStreamingComponent.IsRestartStreamWhenPlaying
// 0x0001 (0x0001 - 0x0000)
struct FortCreativeStreamingComponent_IsRestartStreamWhenPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

