#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortRadioButtonGroup

#include "Basic.hpp"

#include "FortRadioButtonItemStruct_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortRadioButtonGroup.FortRadioButtonGroup_C
// 0x0068 (0x0320 - 0x02B8)
class UFortRadioButtonGroup_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_Buttons;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Buttons;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FFortRadioButtonItemStruct>     Buttons;                                           // 0x02D0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UIconTextButton_C*>              CreatedButtons;                                    // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void(int32 SelectedIndex)> RadioButtonClicked_Event;                    // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        WidthOverride;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonGroupLegacy*               CreatedButtonsGroup;                               // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CommonButtonGroup;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        HeightOverride;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CenterOnWidget();
	void Destruct();
	void ExecuteUbergraph_FortRadioButtonGroup(int32 EntryPoint);
	void OnButtonClicked_Bind(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex);
	void UpdateButtons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortRadioButtonGroup_C">();
	}
	static class UFortRadioButtonGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRadioButtonGroup_C>();
	}
};

}

