#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Creative_OnKillSiphon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GAT_Creative_TriggeredAbility_Pawn_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Creative_OnKillSiphon.GA_Creative_OnKillSiphon_C
// 0x0048 (0x0BC0 - 0x0B78)
class UGA_Creative_OnKillSiphon_C final : public UGAT_Creative_TriggeredAbility_Pawn_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Creative_OnKillSiphon_C;         // 0x0B78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortGameStateAthena*                   GameState;                                         // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCreativeOrPlayground;                            // 0x0B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B89[0x7];                                      // 0x0B89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_HealPlayer;                                     // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldConvertExcessHealthToShields;               // 0x0B98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B99[0x7];                                      // 0x0B99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ShieldGE;                                          // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ConsumedCue;                                       // 0x0BA8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugBypasLocalMapEnable;                         // 0x0BAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAttemptHealthRestore;                             // 0x0BAD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAttemptMatsRestore;                               // 0x0BAE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAF[0x1];                                      // 0x0BAF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameGrantWood;                                     // 0x0BB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameGrantStone;                                    // 0x0BB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameGrantMetal;                                    // 0x0BB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddShields(bool bShouldConvertExcessHealthToShields_0, double ShieldToAdd, bool* bAddedShields, double* ShieldAdded);
	void AttemptHeal();
	void AttemptMats();
	void CalculateResources(EFortResourceType ResourceGrantType, bool* bSuccess, int32* ResourceToGive, EFortResourceType* ResourceType);
	void DetermineHealthDelta(double HealingAmount, double* MaxHealth, double* CurrentHealth, double* HealthDelta, double* ExcessHealh);
	void ExecuteUbergraph_GA_Creative_OnKillSiphon(int32 EntryPoint);
	void GiveResourcesToPlayer(bool bShouldGrant, int32 GiveAmount, EFortResourceType GiveType, bool* Success);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void RestoreHealth(bool* Success, double* InitialHealAmount, double* ActualAppliedHeal, double* ExcessHealing);
	void SetupRestoreModes(bool* ShouldContinue);

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Creative_OnKillSiphon_C">();
	}
	static class UGA_Creative_OnKillSiphon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Creative_OnKillSiphon_C>();
	}
};

}

