#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NPC_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Enum_NPC_AlertLevel_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Enum_NPC_ModifyAlertLevelReason_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_NPC_Parent.GA_NPC_Parent_C
// 0x0390 (0x0ED0 - 0x0B40)
class UGA_NPC_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortAIPawn*                            NPC_ActivatingFortAIPawn;                          // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EFortMovementUrgency                          NPC_InitialMovementUrgency;                        // 0x0B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_DebugAbility;                                  // 0x0B51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B52[0x6];                                      // 0x0B52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  NPC_IgnoreDamageAndOnlyDoKnockbackIfTheseAbilitiesAreActive; // 0x0B58(0x0020)(Edit, BlueprintVisible)
	bool                                          NPC_DebugFreezeFrameEnabled;                       // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_DebugFreezeFrameOnlyWhenAbilityTargetHit;      // 0x0B79(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_DebugFreezeFrameOnlyWhenWeHaveSomeTarget;      // 0x0B7A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_DamageHitAbilityTargetDuringThisAbilityActivation; // 0x0B7B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B7C[0x4];                                      // 0x0B7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         NPC_DamageActorsWeHaveHitDuringThisAbilityActivation; // 0x0B80(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          NPC_CanActivateAbility_AbilityTargetTeamAffiliationCanBeNeutral; // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_CanActivateAbility_AbilityTargetTeamAffiliationCanBeFriendly; // 0x0B91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_CanActivateAbility_AbilityTargetTeamAffiliationCanBeHostile; // 0x0B92(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B93[0x5];                                      // 0x0B93(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NPC_CanActivateAbility_MaxTargetZDistanceBelow;    // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NPC_CanActivateAbility_MaxTargetZDistanceAbove;    // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NPC_CanActivateAbility_MaxTargetZDistanceAbove_ForIntentionalFailedAttack; // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         BuildingTargetingHitActors;                        // 0x0BB0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FScalableFloat                         NPC_CanBuildMovementFrustrationAtAllHF;            // 0x0BC0(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_CanBuildGoalFrustrationAtAllHF;                // 0x0BE8(0x0028)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  TC_NPC_FrustrationTagsToClearForGoals;             // 0x0C10(0x0020)(Edit, BlueprintVisible)
	Enum_NPC_AlertLevel                           NPC_AlertLevelGoalIsFortPawn;                      // 0x0C30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_NPC_AlertLevel                           NPC_AlertLevelGoalIsOther;                         // 0x0C31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_NPC_AlertLevel                           NPC_AlertLevelGoalIsNotValid;                      // 0x0C32(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C33[0x5];                                      // 0x0C33(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         NPC_DamageKnockbackVelocityHF;                     // 0x0C38(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageKnockbackVerticalAngleHF;                // 0x0C60(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageKnockbackMinimumYawValueHF;              // 0x0C88(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageCanAttackDBNOPlayersHF;                  // 0x0CB0(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageKnockbackVelocityVehicleHF;              // 0x0CD8(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageKnockbackVerticalAngleVehicleHF;         // 0x0D00(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageKnockbackMinimumYawValueVehicleHF;       // 0x0D28(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_DamageChanceToEjectFromVehicleHF;              // 0x0D50(0x0028)(Edit, BlueprintVisible)
	struct FGameplayTag                           DestroyBuildingGC;                                 // 0x0D78(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D7C[0x4];                                      // 0x0D7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DestroyBuildingGE;                                 // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_NPC_FrustrationTagsToClearForMovement;          // 0x0D88(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTag                           TC_NPC_FrustrationBuildDueToGoal;                  // 0x0DA8(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TC_NPC_FrustrationBuildDueToMovement;              // 0x0DAC(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      TQ_NPC_RequirementsToBuildFrustrationDueToGoal;    // 0x0DB0(0x0048)(Edit, BlueprintVisible)
	struct FGameplayTagQuery                      TQ_NPC_RequirementsToBuildFrustrationDueToMovement; // 0x0DF8(0x0048)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_BodyBumpBuildingsWhenBuildingMovementFrustrationHF; // 0x0E40(0x0028)(Edit, BlueprintVisible)
	struct FScalableFloat                         NPC_FrustrationBodyBumpOnlyDestroyPlayerBuildingsHF; // 0x0E68(0x0028)(Edit, BlueprintVisible)
	struct FGameplayTag                           TC_NPC_EffectContainer_BodyBumpBuildingsWhenBuildingMovementFrustration; // 0x0E90(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E94[0x4];                                      // 0x0E94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       BuildingTargetingTargetData;                       // 0x0E98(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           BuildingTargetingApplicationTag;                   // 0x0EC0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TC_BuildingTypePlayer;                             // 0x0EC4(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_NPC_MMR_Scaling_AbilityCooldown;                // 0x0EC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BeginDestroyBuildings(const struct FGameplayTag& TargetSelectionApplicationTag, bool DoContinuousTargetSelection);
	void Cancelled_13B12ED64A3570FC1E117FAC4E3F7961(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_4BB5000E4F2C1DAB20E4FFAAA97E1368(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void DestroyBuilding(class AActor* BuildingActor);
	void ExecuteUbergraph_GA_NPC_Parent(int32 EntryPoint);
	void FilterHitActors(TArray<class AActor*>& HitActors);
	void NPC_AbilityDebugMessage(const class FString& String, bool OnlyWhenDebug);
	void NPC_AbilityTargetIsBuildingWeAreDestroyingToNavigate(bool* IsNavigationBuildingWeAreDestroying, class ABuildingActor** BuildingWeAreDestroying, double* HealthOfBuildingWeAreDestroying);
	void NPC_AbilityTargetIsWithinAngleThreshold(double AngleThreshold, bool* IsWithinAngle);
	void NPC_ApplyGameplayAbilityCooldownWithMMRScaling();
	void NPC_ApplyGameplayEffectContainerAndLaunchTargets(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag, int32 GameplayEffectLevel, bool AbilityTargetCanBeHitMultipleTimesByThisSelection, bool ForceDebugFreezeFrameForThisSpecificTargeting, bool* HitAbilityTargetRightNow, bool* HitAbilityTargetDuringThisAbilityActivation, TArray<class AActor*>* ActorsWeHaveHitDuringThisAbilityActivation, TArray<class AActor*>* ActorsHitWithThisSpecificTargetSelection);
	void NPC_ApplyGameplayEffectWithMMRScaling(class UClass* GameplayEffectClass, class AActor* Actor);
	void NPC_AttemptBuildFrustrationDueToGoal(const class FString& Reason);
	void NPC_AttemptBuildFrustrationDueToMovement(const class FString& Reason);
	void NPC_ClearFrustrationTagsForGoals(const class FString& Reason);
	void NPC_ClearFrustrationTagsForMovement(const class FString& Reason);
	void NPC_DebugFreezeFrame(bool ForceDebugFreezeFrame, bool HitAbilityTargetRightNow, bool HitAbilityTargetDuringThisAbilityActivation, TArray<class AActor*>& ActorsWeHaveHitDuringThisAbilityActivation, TArray<class AActor*>& ActorsHitWithThisSpecificTargetSelection);
	void NPC_DoIntentionalFailedAttack(bool* DoIntentionalFailedAttack);
	void NPC_EQS_Results(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus, EEnvQueryRunMode EQS_RunMode, bool NumReturnedItemsIsImportant, TArray<class AActor*>* ResultActors, int32* NumValidActorsGenerated, bool* ResultActorsSuccess, TArray<struct FVector>* ResultLocations, int32* NumValidLocationsGenerated, bool* ResultLocationsSuccess, class UEnvQueryInstanceBlueprintWrapper** QueryInstanceOut, EEnvQueryStatus* QueryStatusOut);
	void NPC_GenerateLaunchVelocityWithMinimumAngle(class AActor* ActorWeWantToLaunch, bool Vehicle, struct FVector* LaunchVelocity, class AActor** LaunchActor, bool* LaunchingVehicle);
	class UObject* NPC_GetGoalActor();
	void NPC_GetScalableFloatHotfixValue(const struct FScalableFloat& ScalableFloatHotfix, double AtLevel, bool* AsBool, int32* AsIntRounded, double* AsFloat);
	void NPC_IsMontageInfoValid(const struct FFortGameplayAbilityMontageInfo& MontageInfo_0, bool* IsValid_);
	void NPC_OverrideRotationRate(const struct FScalableFloat& RotationRate);
	void NPC_ResetRotationRate();
	void NPC_ScalableFloatIsValid(const struct FScalableFloat& ScalableFloat, bool* Valid);
	void NPC_SetAlertLevel(Enum_NPC_AlertLevel NPC_AlertLevel, Enum_NPC_ModifyAlertLevelReason Reason);
	void NPC_SetAlertLevelByAIAbilityTargetType();
	void NPC_SetupAbility();
	void NPC_TryResetMovementUrgency();
	void NPC_TrySetMovementUrgency(EFortMovementUrgency MovementUrgency, bool TryResetUrgencyIfInvalid);
	bool NPC_Validate_Can_Knockback_Pawn(bool HitWasVehicle);
	void Targeted_13B12ED64A3570FC1E117FAC4E3F7961(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Targeted_4BB5000E4F2C1DAB20E4FFAAA97E1368(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_NPC_Parent_C">();
	}
	static class UGA_NPC_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_NPC_Parent_C>();
	}
};

}

