#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_Spray_Generic

#include "Basic.hpp"

#include "GAB_Emote_Generic_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_Spray_Generic.GAB_Spray_Generic_C
// 0x0060 (0x0C00 - 0x0BA0)
class UGAB_Spray_Generic_C final : public UGAB_Emote_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAB_Spray_Generic_C;                // 0x0BA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DecalSize;                                         // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSprayItemDefinition*             MySpray;                                           // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DecalTraceDistance;                                // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            DefaultSprayMontage_M;                             // 0x0BC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            DefaultSprayMontage_F;                             // 0x0BE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_Spray_Generic(int32 EntryPoint);
	TSoftObjectPtr<class UAnimMontage> GetMontageToPlay(class UFortMontageItemDefinitionBase* EmoteAsset, EFortCustomBodyType BodyType, EFortCustomGender Gender);
	void OnMontageStartedPlaying();
	void TargetLineTrace(class AFortPawn* ActivatingPawn, bool* HitSomething, struct FVector* Location, struct FVector* Normal);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_Spray_Generic_C">();
	}
	static class UGAB_Spray_Generic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_Spray_Generic_C>();
	}
};

}

