#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GameplayCameras.GameplayCameraEvaluationResultBlueprintInterop
// 0x0008 (0x0030 - 0x0028)
class UGameplayCameraEvaluationResultBlueprintInterop final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBooleanCameraVariable(class UBooleanCameraVariable* InVariableAsset, bool InValue);
	void SetCameraPose(const struct FCameraPose& InCameraPose);
	void SetDoubleCameraVariable(class UDoubleCameraVariable* InVariableAsset, double InValue);
	void SetFloatCameraVariable(class UFloatCameraVariable* InVariableAsset, float InValue);
	void SetInteger32CameraVariable(class UInteger32CameraVariable* InVariableAsset, int32 InValue);
	void SetRotatorCameraVariable(class URotator3dCameraVariable* InVariableAsset, const struct FRotator& InValue);
	void SetTransformCameraVariable(class UTransform3dCameraVariable* InVariableAsset, const struct FTransform& InValue);
	void SetVector2CameraVariable(class UVector2dCameraVariable* InVariableAsset, const struct FVector2D& InValue);
	void SetVector3CameraVariable(class UVector3dCameraVariable* InVariableAsset, const struct FVector& InValue);
	void SetVector4CameraVariable(class UVector4dCameraVariable* InVariableAsset, const struct FVector4& InValue);

	bool GetBooleanCameraVariable(class UBooleanCameraVariable* InVariableAsset) const;
	const struct FCameraPose GetCameraPose() const;
	double GetDoubleCameraVariable(class UDoubleCameraVariable* InVariableAsset) const;
	float GetFloatCameraVariable(class UFloatCameraVariable* InVariableAsset) const;
	int32 GetInteger32CameraVariable(class UInteger32CameraVariable* InVariableAsset) const;
	struct FRotator GetRotatorCameraVariable(class URotator3dCameraVariable* InVariableAsset) const;
	struct FTransform GetTransformCameraVariable(class UTransform3dCameraVariable* InVariableAsset) const;
	struct FVector2D GetVector2CameraVariable(class UVector2dCameraVariable* InVariableAsset) const;
	struct FVector GetVector3CameraVariable(class UVector3dCameraVariable* InVariableAsset) const;
	struct FVector4 GetVector4CameraVariable(class UVector4dCameraVariable* InVariableAsset) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraEvaluationResultBlueprintInterop">();
	}
	static class UGameplayCameraEvaluationResultBlueprintInterop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraEvaluationResultBlueprintInterop>();
	}
};

// Class GameplayCameras.LegacyCameraShake
// 0x0110 (0x01F0 - 0x00E0)
class ULegacyCameraShake : public UCameraShakeBase
{
public:
	float                                         OscillationDuration;                               // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OscillationBlendInTime;                            // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OscillationBlendOutTime;                           // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FROscillator                           RotOscillation;                                    // 0x00E4(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVOscillator                           LocOscillation;                                    // 0x0108(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FFOscillator                           FOVOscillation;                                    // 0x012C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         AnimPlayRate;                                      // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimScale;                                         // 0x013C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimBlendInTime;                                   // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimBlendOutTime;                                  // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomAnimSegmentDuration;                         // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraAnimationSequence*               AnimSequence;                                      // 0x0150(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRandomAnimSegment : 1;                            // 0x0158(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OscillatorTimeRemaining;                           // 0x015C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_160[0x78];                                     // 0x0160(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class USequenceCameraShakePattern*            SequenceShakePattern;                              // 0x01D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E0[0x10];                                     // 0x01E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULegacyCameraShake* StartLegacyCameraShake(class APlayerCameraManager* PlayerCameraManager, TSubclassOf<class ULegacyCameraShake> ShakeClass, float Scale, ECameraShakePlaySpace Playspace, const struct FRotator& UserPlaySpaceRot);
	static class ULegacyCameraShake* StartLegacyCameraShakeFromSource(class APlayerCameraManager* PlayerCameraManager, TSubclassOf<class ULegacyCameraShake> ShakeClass, class UCameraShakeSourceComponent* SourceComponent, float Scale, ECameraShakePlaySpace Playspace, const struct FRotator& UserPlaySpaceRot);

	void BlueprintUpdateCameraShake(float DeltaTime, float Alpha, const struct FMinimalViewInfo& POV, struct FMinimalViewInfo* ModifiedPOV);
	void ReceivePlayShake(float Scale);
	void ReceiveStopShake(bool bImmediately);

	bool ReceiveIsFinished() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LegacyCameraShake">();
	}
	static class ULegacyCameraShake* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyCameraShake>();
	}
};

// Class GameplayCameras.LegacyCameraShakePattern
// 0x0000 (0x0028 - 0x0028)
class ULegacyCameraShakePattern final : public UCameraShakePattern
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LegacyCameraShakePattern">();
	}
	static class ULegacyCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyCameraShakePattern>();
	}
};

// Class GameplayCameras.LegacyCameraShakeFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class ULegacyCameraShakeFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class ULegacyCameraShake* Conv_LegacyCameraShake(class UCameraShakeBase* CameraShake);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LegacyCameraShakeFunctionLibrary">();
	}
	static class ULegacyCameraShakeFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyCameraShakeFunctionLibrary>();
	}
};

// Class GameplayCameras.ObjectTreeGraphObject
// 0x0000 (0x0000 - 0x0000)
class IObjectTreeGraphObject final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectTreeGraphObject">();
	}
	static class IObjectTreeGraphObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectTreeGraphObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GameplayCameras.CameraAnimationCameraModifier
// 0x0018 (0x0060 - 0x0048)
class UCameraAnimationCameraModifier final : public UCameraModifier
{
public:
	TArray<struct FActiveCameraAnimationInfo>     ActiveAnimations;                                  // 0x0048(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint16                                        NextInstanceSerialNumber;                          // 0x0058(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCameraAnimationCameraModifier* GetCameraAnimationCameraModifier(const class UObject* WorldContextObject, int32 PlayerIndex);
	static class UCameraAnimationCameraModifier* GetCameraAnimationCameraModifierFromID(const class UObject* WorldContextObject, int32 ControllerId);
	static class UCameraAnimationCameraModifier* GetCameraAnimationCameraModifierFromPlayerController(const class APlayerController* PlayerController);

	struct FCameraAnimationHandle PlayCameraAnimation(class UCameraAnimationSequence* Sequence, const struct FCameraAnimationParams& Params_0);
	void StopAllCameraAnimations(bool bImmediate);
	void StopAllCameraAnimationsOf(class UCameraAnimationSequence* Sequence, bool bImmediate);
	void StopCameraAnimation(const struct FCameraAnimationHandle& Handle, bool bImmediate);

	bool IsCameraAnimationActive(const struct FCameraAnimationHandle& Handle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraAnimationCameraModifier">();
	}
	static class UCameraAnimationCameraModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraAnimationCameraModifier>();
	}
};

// Class GameplayCameras.GameplayCamerasFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UGameplayCamerasFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UCameraAnimationCameraModifier* Conv_CameraAnimationCameraModifier(class APlayerCameraManager* PlayerCameraManager);
	static ECameraAnimationPlaySpace Conv_CameraAnimationPlaySpace(ECameraShakePlaySpace CameraShakePlaySpace);
	static ECameraShakePlaySpace Conv_CameraShakePlaySpace(ECameraAnimationPlaySpace CameraAnimationPlaySpace);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCamerasFunctionLibrary">();
	}
	static class UGameplayCamerasFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCamerasFunctionLibrary>();
	}
};

// Class GameplayCameras.CameraNode
// 0x0010 (0x0038 - 0x0028)
class UCameraNode : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEnabled;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraNode">();
	}
	static class UCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraNode>();
	}
};

// Class GameplayCameras.BlendCameraNode
// 0x0000 (0x0038 - 0x0038)
class UBlendCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendCameraNode">();
	}
	static class UBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendCameraNode>();
	}
};

// Class GameplayCameras.BlendStackCameraNode
// 0x0008 (0x0040 - 0x0038)
class UBlendStackCameraNode final : public UCameraNode
{
public:
	bool                                          bAutoPop;                                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlendFirstCameraRig;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendStackCameraNode">();
	}
	static class UBlendStackCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackCameraNode>();
	}
};

// Class GameplayCameras.BlendStackRootCameraNode
// 0x0010 (0x0048 - 0x0038)
class UBlendStackRootCameraNode final : public UCameraNode
{
public:
	class UBlendCameraNode*                       Blend;                                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraNode*                            RootNode;                                          // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlendStackRootCameraNode">();
	}
	static class UBlendStackRootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackRootCameraNode>();
	}
};

// Class GameplayCameras.CameraAsset
// 0x0028 (0x0050 - 0x0028)
class UCameraAsset final : public UObject
{
public:
	class UCameraDirector*                        CameraDirector;                                    // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UCameraRigTransition*>           EnterTransitions;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UCameraRigTransition*>           ExitTransitions;                                   // 0x0040(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraAsset">();
	}
	static class UCameraAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraAsset>();
	}
};

// Class GameplayCameras.CameraDirector
// 0x0000 (0x0028 - 0x0028)
class UCameraDirector : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraDirector">();
	}
	static class UCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraDirector>();
	}
};

// Class GameplayCameras.CameraRigAsset
// 0x0050 (0x0078 - 0x0028)
class UCameraRigAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraNode*                            RootNode;                                          // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UCameraRigTransition*>           EnterTransitions;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UCameraRigTransition*>           ExitTransitions;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FCameraRigAllocationInfo               AllocationInfo;                                    // 0x0058(0x0018)(NativeAccessSpecifierPublic)
	ECameraRigBuildStatus                         BuildStatus;                                       // 0x0070(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigAsset">();
	}
	static class UCameraRigAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigAsset>();
	}
};

// Class GameplayCameras.CameraRigTransitionCondition
// 0x0008 (0x0030 - 0x0028)
class UCameraRigTransitionCondition final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigTransitionCondition">();
	}
	static class UCameraRigTransitionCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigTransitionCondition>();
	}
};

// Class GameplayCameras.CameraRigTransition
// 0x0020 (0x0048 - 0x0028)
class UCameraRigTransition final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCameraRigTransitionCondition*>  Conditions;                                        // 0x0030(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class UBlendCameraNode*                       Blend;                                             // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraRigTransition">();
	}
	static class UCameraRigTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigTransition>();
	}
};

// Class GameplayCameras.CameraVariableAsset
// 0x0010 (0x0040 - 0x0030)
class UCameraVariableAsset : public UDataAsset
{
public:
	bool                                          bAutoReset;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        VariableId;                                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsLocal;                                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraVariableAsset">();
	}
	static class UCameraVariableAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraVariableAsset>();
	}
};

// Class GameplayCameras.BooleanCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UBooleanCameraVariable final : public UCameraVariableAsset
{
public:
	bool                                          bDefaultValue;                                     // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BooleanCameraVariable">();
	}
	static class UBooleanCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBooleanCameraVariable>();
	}
};

// Class GameplayCameras.Integer32CameraVariable
// 0x0008 (0x0048 - 0x0040)
class UInteger32CameraVariable final : public UCameraVariableAsset
{
public:
	int32                                         DefaultValue;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Integer32CameraVariable">();
	}
	static class UInteger32CameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteger32CameraVariable>();
	}
};

// Class GameplayCameras.FloatCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UFloatCameraVariable final : public UCameraVariableAsset
{
public:
	float                                         DefaultValue;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FloatCameraVariable">();
	}
	static class UFloatCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatCameraVariable>();
	}
};

// Class GameplayCameras.DoubleCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UDoubleCameraVariable final : public UCameraVariableAsset
{
public:
	double                                        DefaultValue;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DoubleCameraVariable">();
	}
	static class UDoubleCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDoubleCameraVariable>();
	}
};

// Class GameplayCameras.Vector2fCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UVector2fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector2f                              DefaultValue;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector2fCameraVariable">();
	}
	static class UVector2fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector2fCameraVariable>();
	}
};

// Class GameplayCameras.Vector2dCameraVariable
// 0x0010 (0x0050 - 0x0040)
class UVector2dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector2D                              DefaultValue;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector2dCameraVariable">();
	}
	static class UVector2dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector2dCameraVariable>();
	}
};

// Class GameplayCameras.Vector3fCameraVariable
// 0x0010 (0x0050 - 0x0040)
class UVector3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector3f                              DefaultValue;                                      // 0x0040(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector3fCameraVariable">();
	}
	static class UVector3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector3fCameraVariable>();
	}
};

// Class GameplayCameras.Vector3dCameraVariable
// 0x0018 (0x0058 - 0x0040)
class UVector3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector3d                              DefaultValue;                                      // 0x0040(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector3dCameraVariable">();
	}
	static class UVector3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector3dCameraVariable>();
	}
};

// Class GameplayCameras.Vector4fCameraVariable
// 0x0010 (0x0050 - 0x0040)
class UVector4fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector4f                              DefaultValue;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector4fCameraVariable">();
	}
	static class UVector4fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector4fCameraVariable>();
	}
};

// Class GameplayCameras.Vector4dCameraVariable
// 0x0020 (0x0060 - 0x0040)
class UVector4dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector4d                              DefaultValue;                                      // 0x0040(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Vector4dCameraVariable">();
	}
	static class UVector4dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector4dCameraVariable>();
	}
};

// Class GameplayCameras.Rotator3fCameraVariable
// 0x0010 (0x0050 - 0x0040)
class URotator3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FRotator3f                             DefaultValue;                                      // 0x0040(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Rotator3fCameraVariable">();
	}
	static class URotator3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<URotator3fCameraVariable>();
	}
};

// Class GameplayCameras.Rotator3dCameraVariable
// 0x0018 (0x0058 - 0x0040)
class URotator3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FRotator3d                             DefaultValue;                                      // 0x0040(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Rotator3dCameraVariable">();
	}
	static class URotator3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<URotator3dCameraVariable>();
	}
};

// Class GameplayCameras.Transform3fCameraVariable
// 0x0030 (0x0070 - 0x0040)
class UTransform3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FTransform3f                           DefaultValue;                                      // 0x0040(0x0030)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Transform3fCameraVariable">();
	}
	static class UTransform3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransform3fCameraVariable>();
	}
};

// Class GameplayCameras.Transform3dCameraVariable
// 0x0060 (0x00A0 - 0x0040)
class UTransform3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FTransform3d                           DefaultValue;                                      // 0x0040(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Transform3dCameraVariable">();
	}
	static class UTransform3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransform3dCameraVariable>();
	}
};

// Class GameplayCameras.RootCameraNode
// 0x0000 (0x0038 - 0x0038)
class URootCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RootCameraNode">();
	}
	static class URootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootCameraNode>();
	}
};

// Class GameplayCameras.DefaultRootCameraNode
// 0x0020 (0x0058 - 0x0038)
class UDefaultRootCameraNode final : public URootCameraNode
{
public:
	class UBlendStackCameraNode*                  BaseLayer;                                         // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendStackCameraNode*                  MainLayer;                                         // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendStackCameraNode*                  GlobalLayer;                                       // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendStackCameraNode*                  VisualLayer;                                       // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultRootCameraNode">();
	}
	static class UDefaultRootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultRootCameraNode>();
	}
};

// Class GameplayCameras.SingleCameraDirector
// 0x0008 (0x0030 - 0x0028)
class USingleCameraDirector final : public UCameraDirector
{
public:
	class UCameraRigAsset*                        CameraRig;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SingleCameraDirector">();
	}
	static class USingleCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleCameraDirector>();
	}
};

// Class GameplayCameras.GameplayCameraActor
// 0x0010 (0x02A0 - 0x0290)
class AGameplayCameraActor final : public AActor
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameplayCameraComponent*               CameraComponent;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UGameplayCameraComponent* GetCameraComponent() const;
	class USceneComponent* GetSceneComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraActor">();
	}
	static class AGameplayCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayCameraActor>();
	}
};

// Class GameplayCameras.GameplayCameraComponent
// 0x0030 (0x0250 - 0x0220)
class UGameplayCameraComponent final : public USceneComponent
{
public:
	class UCameraAsset*                           Camera;                                            // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0x10];                                     // 0x0228(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayCameraEvaluationResultBlueprintInterop* InitialResultInterop;                     // 0x0238(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_240[0x10];                                     // 0x0240(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateCamera(int32 PlayerIndex);
	void DeactivateCamera();

	class UGameplayCameraEvaluationResultBlueprintInterop* GetInitialResult() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraComponent">();
	}
	static class UGameplayCameraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraComponent>();
	}
};

// Class GameplayCameras.GameplayCameraSystemActor
// 0x0010 (0x02A0 - 0x0290)
class AGameplayCameraSystemActor final : public AActor
{
public:
	class UGameplayCameraSystemComponent*         CameraSystemComponent;                             // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAutoReceiveInput                             AutoActivateForPlayer;                             // 0x0298(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateForPlayer(int32 PlayerIndex);

	class UGameplayCameraSystemComponent* GetCameraSystemComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraSystemActor">();
	}
	static class AGameplayCameraSystemActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayCameraSystemActor>();
	}
};

// Class GameplayCameras.GameplayCameraSystemComponent
// 0x0010 (0x0230 - 0x0220)
class UGameplayCameraSystemComponent final : public USceneComponent
{
public:
	uint8                                         Pad_220[0x10];                                     // 0x0220(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCameraSystemComponent">();
	}
	static class UGameplayCameraSystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraSystemComponent>();
	}
};

// Class GameplayCameras.GameplayCamerasSubsystem
// 0x0000 (0x0030 - 0x0030)
class UGameplayCamerasSubsystem final : public UWorldSubsystem
{
public:
	struct FCameraAnimationHandle PlayCameraAnimation(class APlayerController* PlayerController, class UCameraAnimationSequence* Sequence, const struct FCameraAnimationParams& Params_0);
	void StopAllCameraAnimations(class APlayerController* PlayerController, bool bImmediate);
	void StopAllCameraAnimationsOf(class APlayerController* PlayerController, class UCameraAnimationSequence* Sequence, bool bImmediate);
	void StopCameraAnimation(class APlayerController* PlayerController, const struct FCameraAnimationHandle& Handle, bool bImmediate);

	bool IsCameraAnimationActive(class APlayerController* PlayerController, const struct FCameraAnimationHandle& Handle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayCamerasSubsystem">();
	}
	static class UGameplayCamerasSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCamerasSubsystem>();
	}
};

// Class GameplayCameras.SimpleBlendCameraNode
// 0x0000 (0x0038 - 0x0038)
class USimpleBlendCameraNode : public UBlendCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleBlendCameraNode">();
	}
	static class USimpleBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleBlendCameraNode>();
	}
};

// Class GameplayCameras.SimpleFixedTimeBlendCameraNode
// 0x0008 (0x0040 - 0x0038)
class USimpleFixedTimeBlendCameraNode : public USimpleBlendCameraNode
{
public:
	float                                         BlendTime;                                         // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleFixedTimeBlendCameraNode">();
	}
	static class USimpleFixedTimeBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleFixedTimeBlendCameraNode>();
	}
};

// Class GameplayCameras.LinearBlendCameraNode
// 0x0000 (0x0040 - 0x0040)
class ULinearBlendCameraNode final : public USimpleFixedTimeBlendCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LinearBlendCameraNode">();
	}
	static class ULinearBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULinearBlendCameraNode>();
	}
};

// Class GameplayCameras.PopBlendCameraNode
// 0x0000 (0x0038 - 0x0038)
class UPopBlendCameraNode final : public UBlendCameraNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PopBlendCameraNode">();
	}
	static class UPopBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopBlendCameraNode>();
	}
};

// Class GameplayCameras.SmoothBlendCameraNode
// 0x0008 (0x0048 - 0x0040)
class USmoothBlendCameraNode final : public USimpleFixedTimeBlendCameraNode
{
public:
	ESmoothCameraBlendType                        BlendType;                                         // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmoothBlendCameraNode">();
	}
	static class USmoothBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmoothBlendCameraNode>();
	}
};

// Class GameplayCameras.ArrayCameraNode
// 0x0010 (0x0048 - 0x0038)
class UArrayCameraNode final : public UCameraNode
{
public:
	TArray<class UCameraNode*>                    Children;                                          // 0x0038(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ArrayCameraNode">();
	}
	static class UArrayCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArrayCameraNode>();
	}
};

// Class GameplayCameras.BoomArmCameraNode
// 0x0018 (0x0050 - 0x0038)
class UBoomArmCameraNode final : public UCameraNode
{
public:
	struct FVector3d                              BoomOffset;                                        // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BoomArmCameraNode">();
	}
	static class UBoomArmCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoomArmCameraNode>();
	}
};

// Class GameplayCameras.DampenPositionCameraNode
// 0x0010 (0x0048 - 0x0038)
class UDampenPositionCameraNode final : public UCameraNode
{
public:
	float                                         ForwardDampingFactor;                              // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LateralDampingFactor;                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalDampingFactor;                             // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DampenPositionCameraNode">();
	}
	static class UDampenPositionCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDampenPositionCameraNode>();
	}
};

// Class GameplayCameras.LensParametersCameraNode
// 0x0050 (0x0088 - 0x0038)
class ULensParametersCameraNode final : public UCameraNode
{
public:
	struct FFloatCameraParameter                  SensorWidth;                                       // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  SensorHeight;                                      // 0x0048(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  FocusDistance;                                     // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  FocalLength;                                       // 0x0068(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFloatCameraParameter                  Aperture;                                          // 0x0078(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LensParametersCameraNode">();
	}
	static class ULensParametersCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULensParametersCameraNode>();
	}
};

// Class GameplayCameras.OffsetCameraNode
// 0x0028 (0x0060 - 0x0038)
class UOffsetCameraNode final : public UCameraNode
{
public:
	struct FVector3dCameraParameter               Offset;                                            // 0x0038(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	ECameraNodeSpace                              OffsetSpace;                                       // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OffsetCameraNode">();
	}
	static class UOffsetCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOffsetCameraNode>();
	}
};

// Class GameplayCameras.CompositeCameraShakePattern
// 0x0010 (0x0038 - 0x0028)
class UCompositeCameraShakePattern final : public UCameraShakePattern
{
public:
	TArray<class UCameraShakePattern*>            ChildPatterns;                                     // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CompositeCameraShakePattern">();
	}
	static class UCompositeCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompositeCameraShakePattern>();
	}
};

// Class GameplayCameras.DefaultCameraShakeBase
// 0x0000 (0x00E0 - 0x00E0)
class UDefaultCameraShakeBase final : public UCameraShakeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DefaultCameraShakeBase">();
	}
	static class UDefaultCameraShakeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultCameraShakeBase>();
	}
};

// Class GameplayCameras.SimpleCameraShakePattern
// 0x0030 (0x0058 - 0x0028)
class USimpleCameraShakePattern : public UCameraShakePattern
{
public:
	float                                         duration;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x24];                                      // 0x0034(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleCameraShakePattern">();
	}
	static class USimpleCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleCameraShakePattern>();
	}
};

// Class GameplayCameras.PerlinNoiseCameraShakePattern
// 0x0080 (0x00D8 - 0x0058)
class UPerlinNoiseCameraShakePattern final : public USimpleCameraShakePattern
{
public:
	float                                         LocationAmplitudeMultiplier;                       // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocationFrequencyMultiplier;                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     X;                                                 // 0x0060(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     Y;                                                 // 0x0068(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     Z;                                                 // 0x0070(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         RotationAmplitudeMultiplier;                       // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationFrequencyMultiplier;                       // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     pitch;                                             // 0x0080(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     Yaw;                                               // 0x0088(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     Roll;                                              // 0x0090(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerlinNoiseShaker                     FOV;                                               // 0x0098(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x38];                                      // 0x00A0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PerlinNoiseCameraShakePattern">();
	}
	static class UPerlinNoiseCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerlinNoiseCameraShakePattern>();
	}
};

// Class GameplayCameras.WaveOscillatorCameraShakePattern
// 0x00A0 (0x00F8 - 0x0058)
class UWaveOscillatorCameraShakePattern final : public USimpleCameraShakePattern
{
public:
	float                                         LocationAmplitudeMultiplier;                       // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocationFrequencyMultiplier;                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        X;                                                 // 0x0060(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        Y;                                                 // 0x006C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        Z;                                                 // 0x0078(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         RotationAmplitudeMultiplier;                       // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationFrequencyMultiplier;                       // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        pitch;                                             // 0x008C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        Yaw;                                               // 0x0098(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        Roll;                                              // 0x00A4(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaveOscillator                        FOV;                                               // 0x00B0(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x3C];                                      // 0x00BC(0x003C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaveOscillatorCameraShakePattern">();
	}
	static class UWaveOscillatorCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaveOscillatorCameraShakePattern>();
	}
};

// Class GameplayCameras.TestCameraShake
// 0x0000 (0x00E0 - 0x00E0)
class UTestCameraShake final : public UCameraShakeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestCameraShake">();
	}
	static class UTestCameraShake* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestCameraShake>();
	}
};

// Class GameplayCameras.ConstantCameraShakePattern
// 0x0030 (0x0088 - 0x0058)
class UConstantCameraShakePattern final : public USimpleCameraShakePattern
{
public:
	struct FVector                                LocationOffset;                                    // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConstantCameraShakePattern">();
	}
	static class UConstantCameraShakePattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConstantCameraShakePattern>();
	}
};

}

