#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStateTreeModule

#include "Basic.hpp"

#include "AIModule_classes.hpp"
#include "StateTreeModule_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class GameplayStateTreeModule.BTTask_RunDynamicStateTree
// 0x0058 (0x00C8 - 0x0070)
class UBTTask_RunDynamicStateTree : public UBTTaskNode
{
public:
	struct FStateTreeReference                    StateTreeRef;                                      // 0x0070(0x0028)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FStateTreeInstanceData                 InstanceData;                                      // 0x0098(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           InjectionTag;                                      // 0x00A8(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0x1C];                                      // 0x00AC(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTTask_RunDynamicStateTree">();
	}
	static class UBTTask_RunDynamicStateTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_RunDynamicStateTree>();
	}
};

// Class GameplayStateTreeModule.BTTask_RunStateTree
// 0x0048 (0x00B8 - 0x0070)
class UBTTask_RunStateTree final : public UBTTaskNode
{
public:
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeReference                    StateTreeRef;                                      // 0x0078(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FStateTreeInstanceData                 InstanceData;                                      // 0x00A0(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	float                                         Interval;                                          // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RandomDeviation;                                   // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTTask_RunStateTree">();
	}
	static class UBTTask_RunStateTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_RunStateTree>();
	}
};

// Class GameplayStateTreeModule.StateTreeComponent
// 0x0078 (0x0170 - 0x00F8)
class UStateTreeComponent : public UBrainComponent
{
public:
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EStateTreeRunStatus StateTreeRunStatus)> OnStateTreeRunStatusChanged; // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FStateTreeReference                    StateTreeRef;                                      // 0x0118(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FStateTreeReferenceOverrides           LinkedStateTreeOverrides;                          // 0x0140(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bStartLogicAutomatically;                          // 0x0150(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeInstanceData                 InstanceData;                                      // 0x0158(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SendStateTreeEvent(const struct FStateTreeEvent& Event);
	void SetStartLogicAutomatically(const bool bInStartLogicAutomatically);

	EStateTreeRunStatus GetStateTreeRunStatus() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeComponent">();
	}
	static class UStateTreeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeComponent>();
	}
};

// Class GameplayStateTreeModule.StateTreeAIComponent
// 0x0000 (0x0170 - 0x0170)
class UStateTreeAIComponent final : public UStateTreeComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeAIComponent">();
	}
	static class UStateTreeAIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeAIComponent>();
	}
};

// Class GameplayStateTreeModule.StateTreeComponentSchema
// 0x0030 (0x0058 - 0x0028)
class UStateTreeComponentSchema : public UStateTreeSchema
{
public:
	TSubclassOf<class AActor>                     ContextActorClass;                                 // 0x0028(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FStateTreeExternalDataDesc             ContextActorDataDesc;                              // 0x0030(0x0018)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FStateTreeExternalDataDesc>     ContextDataDescs;                                  // 0x0048(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeComponentSchema">();
	}
	static class UStateTreeComponentSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeComponentSchema>();
	}
};

// Class GameplayStateTreeModule.StateTreeAIComponentSchema
// 0x0008 (0x0060 - 0x0058)
class UStateTreeAIComponentSchema final : public UStateTreeComponentSchema
{
public:
	TSubclassOf<class AAIController>              AIControllerClass;                                 // 0x0058(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateTreeAIComponentSchema">();
	}
	static class UStateTreeAIComponentSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeAIComponentSchema>();
	}
};

}

