#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameFeatureDataTables

#include "Basic.hpp"

#include "GameFeatureDataTables_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GameFeatureDataTables.GameFeatureAction_GameFeatureDataTables
// 0x0028 (0x0050 - 0x0028)
class UGameFeatureAction_GameFeatureDataTables final : public UGameFeatureAction
{
public:
	struct FGameplayTag                           GameFeatureDataTableID;                            // 0x0028(0x0004)(Edit, DisableEditOnInstance, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        DataTable;                                         // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsParentDataTable;                                // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_GameFeatureDataTables">();
	}
	static class UGameFeatureAction_GameFeatureDataTables* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_GameFeatureDataTables>();
	}
};

// Class GameFeatureDataTables.GameFeatureDataTablesSubsystem
// 0x0050 (0x0080 - 0x0030)
class UGameFeatureDataTablesSubsystem final : public UEngineSubsystem
{
public:
	TMap<struct FGameplayTag, struct FGameFeatureDataTableEntry> DataTableEntryMap;                  // 0x0030(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureDataTablesSubsystem">();
	}
	static class UGameFeatureDataTablesSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureDataTablesSubsystem>();
	}
};

}

