#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_ActiveAbility_Hero

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GAT_ActiveAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAT_ActiveAbility_Hero.GAT_ActiveAbility_Hero_C
// 0x0030 (0x0B98 - 0x0B68)
class UGAT_ActiveAbility_Hero_C : public UGAT_ActiveAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_ActiveAbility_Hero_C;           // 0x0B68(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          UseHeroLoadoutSystem;                              // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseMidAbilityCosts;                               // 0x0B71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTriggerCooldownOnAbilityEnd;                      // 0x0B72(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B73[0x5];                                      // 0x0B73(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                Owner_ASC;                                         // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_CooldownModifier;                               // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    Active_Cooldown_Modifiers;                         // 0x0B88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CommitAbilityWithEvent(bool* Passed);
	void ExecuteUbergraph_GAT_ActiveAbility_Hero(int32 EntryPoint);
	void IncrementAbilityCostAndCooldown(double Energy_Cost, bool Adjust_Cooldown, double Cooldown_Increment, TArray<struct FActiveGameplayEffectHandle>* Active_Cooldown_Modifiers_0);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_ActiveAbility_Hero_C">();
	}
	static class UGAT_ActiveAbility_Hero_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_ActiveAbility_Hero_C>();
	}
};

}

