#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrappleWeaponRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_classes.hpp"
#include "MantisRuntime_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GrappleWeaponRuntime.CustomCharacterPartAnimInstance_GrappleHook
// 0x0020 (0x0740 - 0x0720)
class UCustomCharacterPartAnimInstance_GrappleHook final : public UCustomCharacterPartAnimInstance
{
public:
	bool                                          IsFired;                                           // 0x0720(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DistanceBucket;                                    // 0x0724(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MantisAttackAir;                                   // 0x0728(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MantisAttack_1;                                    // 0x0729(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MantisAttack_2;                                    // 0x072A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MantisAttack_3;                                    // 0x072B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MantisAttack_4;                                    // 0x072C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAttackFromCast;                                  // 0x072D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHookFireShort;                                   // 0x072E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHookFireMid;                                     // 0x072F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHookFireLong;                                    // 0x0730(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_731[0xF];                                      // 0x0731(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomCharacterPartAnimInstance_GrappleHook">();
	}
	static class UCustomCharacterPartAnimInstance_GrappleHook* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomCharacterPartAnimInstance_GrappleHook>();
	}
};

// Class GrappleWeaponRuntime.GrappleKnifeLayerAnimInstance
// 0x0020 (0x1400 - 0x13E0)
class UGrappleKnifeLayerAnimInstance final : public UFortMantisLayerAnimInstance
{
public:
	bool                                          bIsAttached;                                       // 0x13D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFired;                                          // 0x13D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimStartWallBounce;                              // 0x13DA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13DB[0x1];                                     // 0x13DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PawnRotationRateYaw;                               // 0x13DC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimBounceAngle;                                   // 0x13E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFireOnMotorBike;                                // 0x13E4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsExitUnexpectedly;                               // 0x13E5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCastInAir;                                      // 0x13E6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCastUpperbody;                                  // 0x13E7(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCastGroundIdle;                                 // 0x13E8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCastGroundLoco;                                 // 0x13E9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDistanceBucketIs0;                                // 0x13EA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDistanceBucketIs2;                                // 0x13EB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsExitGround;                                     // 0x13EC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsExitWallBounce;                                 // 0x13ED(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsExitZipAirStart;                                // 0x13EE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13EF[0x11];                                    // 0x13EF(0x0011)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GrappleKnifeLayerAnimInstance">();
	}
	static class UGrappleKnifeLayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGrappleKnifeLayerAnimInstance>();
	}
};

// Class GrappleWeaponRuntime.GrappleKnifeWeaponAnimInstance
// 0x0000 (0x0470 - 0x0470)
class UGrappleKnifeWeaponAnimInstance final : public UFortMantisAnimInstance
{
public:
	bool                                          MantisAttackAir;                                   // 0x0468(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MantisAttack_1;                                    // 0x0469(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MantisAttack_2;                                    // 0x046A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MantisAttack_3;                                    // 0x046B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MantisAttack_4;                                    // 0x046C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GrappleKnifeWeaponAnimInstance">();
	}
	static class UGrappleKnifeWeaponAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGrappleKnifeWeaponAnimInstance>();
	}
};

// Class GrappleWeaponRuntime.GrappleKnifeWeaponInterface
// 0x0000 (0x0000 - 0x0000)
class IGrappleKnifeWeaponInterface final
{
public:
	void GetGrappleKnifeData(bool* bIsAttached, bool* bIsFired, int32* DistanceBucket, bool* bAnimStartWallBounce, float* AnimBounceAngle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GrappleKnifeWeaponInterface">();
	}
	static class IGrappleKnifeWeaponInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGrappleKnifeWeaponInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class GrappleWeaponRuntime.GrappleWeaponLibrary
// 0x0000 (0x0028 - 0x0028)
class UGrappleWeaponLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FVector CalculateDirectionalTargetOffset(const struct FVector& DirToTarget, const struct FVector& MovementOffset, const struct FVector& LedgeOffset);
	static void DidHitResultImpactLedge(class ACharacter* SourceCharacter, const struct FHitResult& HitResult, const struct FGrappleWeaponLedgeConfig& Config, bool* OutDidImpactWalkableSurface, bool* OutTargetingLedge, struct FVector* OutLedgeLocation, bool bDrawDebug);
	static struct FGrappleWeaponTargetInfo GetGrappleWeaponTargetInfo(class AFortPlayerPawn* SourcePlayerPawn, const struct FGrappleWeaponTargetingConfig& Config, float DrawDebugDuration);
	static void IsTargetingLedge(class ACharacter* SourceCharacter, const class AActor* TargetActor, const struct FVector& TargetLocation, const struct FVector& TargetNormal, const struct FGrappleWeaponLedgeConfig& Config, bool* OutDidImpactWalkableSurface, bool* OutTargetingLedge, struct FVector* OutLedgeLocation, bool bDrawDebug);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GrappleWeaponLibrary">();
	}
	static class UGrappleWeaponLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGrappleWeaponLibrary>();
	}
};

}

