#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrindRailRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GrindRailRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GrindRailRuntime.FortGrindRail.ConnectToRailAtTailUnchecked
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRail_ConnectToRailAtTailUnchecked final
{
public:
	class AFortGrindRail*                         RailToConnectTo;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.IsTipCapped
// 0x0002 (0x0002 - 0x0000)
struct FortGrindRail_IsTipCapped final
{
public:
	bool                                          bStartTip;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.NativeGetNextPositionToGrind
// 0x0048 (0x0048 - 0x0000)
struct FortGrindRail_NativeGetNextPositionToGrind final
{
public:
	float                                         DistanceToTravel;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentDistanceAlongSpline;                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightLeanValue;                                    // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutNextLocation;                                   // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGotToEnd;                                         // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NextLocationOnRail;                                // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGrindRailBoosterMode                         BoosterMode;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitObstacle;                                      // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewRail;                                          // 0x0032(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceAlongNewRail;                              // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortGrindRail*                         TheNewRail;                                        // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewRailReverseDirection;                          // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GrindRailRuntime.FortGrindRail.OnPlayerBeganGrinding
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRail_OnPlayerBeganGrinding final
{
public:
	class AFortPlayerPawn*                        GrindingPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.OnPlayerEndedGrinding
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRail_OnPlayerEndedGrinding final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.OnPlaylistDataReady
// 0x0030 (0x0030 - 0x0000)
struct FortGrindRail_OnPlaylistDataReady final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.SetupMeshInfo
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRail_SetupMeshInfo final
{
public:
	class USplineMeshComponent*                   SplineMeshComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.UpdateTransientComponentTransforms
// 0x0010 (0x0010 - 0x0000)
struct FortGrindRail_UpdateTransientComponentTransforms final
{
public:
	TArray<class USceneComponent*>                TransientSceneComponents;                          // 0x0000(0x0010)(Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.AllowSprinting
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_AllowSprinting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.GetSpeedSettingsOverride
// 0x001C (0x001C - 0x0000)
struct FortGrindRail_GetSpeedSettingsOverride final
{
public:
	struct FGrindRailSpeedSettings                SpeedSettingsOverride;                             // 0x0000(0x0018)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GrindRailRuntime.FortGrindRail.HasHeadConnection
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_HasHeadConnection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.HasTailConnection
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_HasTailConnection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.IsGrindRailEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_IsGrindRailEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.ShouldApplyFallDamageImmunity
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_ShouldApplyFallDamageImmunity final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRail.ShouldSoftCapMaxSpeeds
// 0x0001 (0x0001 - 0x0000)
struct FortGrindRail_ShouldSoftCapMaxSpeeds final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRailLayerAnimInstance.AnimNotify_EntryEnter
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRailLayerAnimInstance_AnimNotify_EntryEnter final
{
public:
	const class UAnimNotify*                      Notify;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRailLayerAnimInstance.AnimNotify_EntryExit
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRailLayerAnimInstance_AnimNotify_EntryExit final
{
public:
	const class UAnimNotify*                      Notify;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRailLayerAnimInstance.AnimNotify_IdleEnter
// 0x0008 (0x0008 - 0x0000)
struct FortGrindRailLayerAnimInstance_AnimNotify_IdleEnter final
{
public:
	const class UAnimNotify*                      Notify;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGrindRailLayerAnimInstance.HandleBegunGrinding
// 0x0020 (0x0020 - 0x0000)
struct FortGrindRailLayerAnimInstance_HandleBegunGrinding final
{
public:
	bool                                          bWasAlreadyGrinding;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasJumpingFromRail;                               // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromInteraction;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PreviousPlayerLocation;                            // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.AddTemporaryMoveIgnoreActor
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_AddTemporaryMoveIgnoreActor final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IgnoreDuration;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.ApplyDamageToDevice
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_ApplyDamageToDevice final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnApplyDamageToDevice
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnApplyDamageToDevice final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnBaseMeshReady
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnBaseMeshReady final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 MeshComponent;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnEnergyCompletelyDrained
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnEnergyCompletelyDrained final
{
public:
	class UFortComponent_Energy*                  EnergyComponentDrained;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnJumpInput
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnJumpInput final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnPawnLanded
// 0x00F0 (0x00F0 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnPawnLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnSprintInputPressed
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnSprintInputPressed final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.EventCallback_OnTeleport
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_EventCallback_OnTeleport final
{
public:
	class AFortPawn*                              TeleportedPawn;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.GameplayTagCallback_BlockSprinting
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprinting final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.GameplayTagCallback_BlockSprintingAndHolstering
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_GameplayTagCallback_BlockSprintingAndHolstering final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.GetGrindInAirGameplayEffectClass
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_GetGrindInAirGameplayEffectClass final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleFallDamageImmunityOnGrindingEnd
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleFallDamageImmunityOnGrindingEnd final
{
public:
	bool                                          bShouldApplyFallDamageImmunityOnEnd;               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayCuesOnBoosterModeChange
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnBoosterModeChange final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGrindRailBoosterMode                         OldBoosterMode;                                    // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGrindRailBoosterMode                         NewBoosterMode;                                    // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayCuesOnFeetLanding
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnFeetLanding final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayCuesOnHit
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnHit final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayCuesOnRailJump
// 0x0001 (0x0001 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnRailJump final
{
public:
	bool                                          bIsAnchorJumpActive;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayCuesOnSprinting
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayCuesOnSprinting final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWantsToGrindSprint;                               // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGameplayEffectsOnVehicleHit
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGameplayEffectsOnVehicleHit final
{
public:
	class AFortAthenaVehicle*                     AthenaVehicle;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.HandleGrindingBegun
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_HandleGrindingBegun final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.IsDamageableDevice
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_IsDamageableDevice final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.IsThrowableItem
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_IsThrowableItem final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.OnIgnoredBuildingEndPlay
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_OnIgnoredBuildingEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.RemoveGrindRailInitiatedEffects
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_RemoveGrindRailInitiatedEffects final
{
public:
	const class AFortGrindRail*                   GrindRail;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.DrawDebugHUD
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_DrawDebugHUD final
{
public:
	class AHUD*                                   HUD;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvas*                                Canvas;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.GameplayTagCallback_CancelGrinding
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_GameplayTagCallback_CancelGrinding final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortMovementMode_ExtLogicGrinding.GameplayTagCallback_StartDashMME
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicGrinding_GameplayTagCallback_StartDashMME final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewCount;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.BP_HandleGameplayEffectsOnPlayerJumpOff
// 0x0018 (0x0018 - 0x0000)
struct FortPawnComponent_GrindingProvider_BP_HandleGameplayEffectsOnPlayerJumpOff final
{
public:
	struct FVector                                PlayerPosition;                                    // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.BP_OnApplyDamageToDevice
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_GrindingProvider_BP_OnApplyDamageToDevice final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.Broadcast_ApplyDamageToBuildingActorEvent
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_GrindingProvider_Broadcast_ApplyDamageToBuildingActorEvent final
{
public:
	class ABuildingActor*                         BuildingActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.EventCallback_OnBegunGrinding
// 0x0020 (0x0020 - 0x0000)
struct FortPawnComponent_GrindingProvider_EventCallback_OnBegunGrinding final
{
public:
	bool                                          bWasAlreadyGrinding;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasJumpingFromRail;                               // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnteredFromInteraction;                           // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PreviousPlayerLocation;                            // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.OnMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct FortPawnComponent_GrindingProvider_OnMovementModeChanged final
{
public:
	class ACharacter*                             InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PrevMovementMode;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.OnPawnLandedCallback
// 0x00F0 (0x00F0 - 0x0000)
struct FortPawnComponent_GrindingProvider_OnPawnLandedCallback final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.OnWalkingBaseChanged
// 0x0010 (0x0010 - 0x0000)
struct FortPawnComponent_GrindingProvider_OnWalkingBaseChanged final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewBase;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.RequestGrindingOnRail
// 0x0010 (0x0010 - 0x0000)
struct FortPawnComponent_GrindingProvider_RequestGrindingOnRail final
{
public:
	class AFortGrindRail*                         GrindRail;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OptionalStartDistance;                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromInteraction;                                  // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.BP_CanBeginGrinding
// 0x0001 (0x0001 - 0x0000)
struct FortPawnComponent_GrindingProvider_BP_CanBeginGrinding final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.GetCurrentBoosterMode
// 0x0001 (0x0001 - 0x0000)
struct FortPawnComponent_GrindingProvider_GetCurrentBoosterMode final
{
public:
	EGrindRailBoosterMode                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.GetCurrentGrindingRailActor
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_GrindingProvider_GetCurrentGrindingRailActor final
{
public:
	class AFortGrindRail*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.GetStartedGrindingFromLand
// 0x0001 (0x0001 - 0x0000)
struct FortPawnComponent_GrindingProvider_GetStartedGrindingFromLand final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.IsGrinding
// 0x0001 (0x0001 - 0x0000)
struct FortPawnComponent_GrindingProvider_IsGrinding final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.IsGrindingDisabledForPlayers
// 0x0001 (0x0001 - 0x0000)
struct FortPawnComponent_GrindingProvider_IsGrindingDisabledForPlayers final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortPawnComponent_GrindingProvider.IsSprinting
// 0x0001 (0x0001 - 0x0000)
struct FortPawnComponent_GrindingProvider_IsSprinting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.StructurallySupportedSplineComponent.OnDestroyFromStructuralSupport
// 0x0008 (0x0008 - 0x0000)
struct StructurallySupportedSplineComponent_OnDestroyFromStructuralSupport final
{
public:
	class AActor*                                 SupportActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.StructurallySupportedSplineComponent.OnStructuralSupportDied
// 0x0060 (0x0060 - 0x0000)
struct StructurallySupportedSplineComponent_OnStructuralSupportDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGameplayCueNotifyLoop_Grinding.CacheReferences
// 0x0020 (0x0020 - 0x0000)
struct FortGameplayCueNotifyLoop_Grinding_CacheReferences final
{
public:
	class UAudioComponent*                        InAudioComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFXSystemComponent*                     InEffectsComponent;                                // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                        InPlayerPawn;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortPawnComponent_GrindingProvider*    InGrindingProvider;                                // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function GrindRailRuntime.FortGameplayCueNotifyLoop_Grinding.OnForwardChanged
// 0x0001 (0x0001 - 0x0000)
struct FortGameplayCueNotifyLoop_Grinding_OnForwardChanged final
{
public:
	bool                                          bNewState;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

