#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsDeformer

#include "Basic.hpp"

#include "OptimusCore_classes.hpp"
#include "HairStrandsDeformer_structs.hpp"
#include "ComputeFramework_classes.hpp"


namespace SDK
{

// Class HairStrandsDeformer.OptimusGroomDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomDataInterface">();
	}
	static class UOptimusGroomDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomDataProvider final : public UComputeDataProvider
{
public:
	class UGroomComponent*                        Groom;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomDataProvider">();
	}
	static class UOptimusGroomDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomExecDataInterface
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomExecDataInterface final : public UOptimusComputeDataInterface
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EOptimusGroomExecDomain                       Domain;                                            // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomExecDataInterface">();
	}
	static class UOptimusGroomExecDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomExecDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomExecDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomExecDataProvider final : public UComputeDataProvider
{
public:
	class UGroomComponent*                        GroomComponent;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOptimusGroomExecDomain                       Domain;                                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomExecDataProvider">();
	}
	static class UOptimusGroomExecDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomExecDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomGuideDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomGuideDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomGuideDataInterface">();
	}
	static class UOptimusGroomGuideDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuideDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomGuideDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomGuideDataProvider final : public UComputeDataProvider
{
public:
	class UGroomComponent*                        Groom;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomGuideDataProvider">();
	}
	static class UOptimusGroomGuideDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuideDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomWriteDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomWriteDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomWriteDataInterface">();
	}
	static class UOptimusGroomWriteDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomWriteDataInterface>();
	}
};

// Class HairStrandsDeformer.OptimusGroomWriteDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomWriteDataProvider final : public UComputeDataProvider
{
public:
	class UGroomComponent*                        GroomComponent;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomWriteDataProvider">();
	}
	static class UOptimusGroomWriteDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomWriteDataProvider>();
	}
};

// Class HairStrandsDeformer.OptimusGroomComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomComponentSource">();
	}
	static class UOptimusGroomComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomComponentSource>();
	}
};

}

