#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InstancedActors

#include "Basic.hpp"

#include "NetCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "MassEntity_structs.hpp"
#include "MassRepresentation_structs.hpp"


namespace SDK
{

// Enum InstancedActors.EInstancedActorsVolumeShape
// NumValues: 0x0003
enum class EInstancedActorsVolumeShape : uint8
{
	Box                                      = 0,
	Sphere                                   = 1,
	EInstancedActorsVolumeShape_MAX          = 2,
};

// ScriptStruct InstancedActors.InstancedActorsInstanceIndex
// 0x0002 (0x0002 - 0x0000)
struct FInstancedActorsInstanceIndex final
{
public:
	uint16                                        Index;                                             // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct InstancedActors.InstancedActorsInstanceHandle
// 0x0010 (0x0010 - 0x0000)
struct FInstancedActorsInstanceHandle final
{
public:
	class UInstancedActorsData*                   InstancedActorData;                                // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FInstancedActorsInstanceIndex          Index;                                             // 0x0008(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct InstancedActors.InstancedActorsMassSpawnData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FInstancedActorsMassSpawnData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct InstancedActors.InstancedActorsIterationContext
// 0x0070 (0x0070 - 0x0000)
struct alignas(0x08) FInstancedActorsIterationContext final
{
public:
	uint8                                         Pad_0[0x70];                                       // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct InstancedActors.InstancedActorsDelta
// 0x0004 (0x0010 - 0x000C)
struct FInstancedActorsDelta final : public FFastArraySerializerItem
{
public:
	struct FInstancedActorsInstanceIndex          InstanceIndex;                                     // 0x000C(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bDestroyed : 1;                                    // 0x000E(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         CurrentLifecyclePhaseIndex;                        // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct InstancedActors.InstancedActorsDeltaList
// 0x0070 (0x0178 - 0x0108)
struct FInstancedActorsDeltaList final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x58];                                     // 0x0108(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedActorsDelta>          InstanceDeltas;                                    // 0x0160(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct InstancedActors.InstancedActorsConfig
// 0x0020 (0x0020 - 0x0000)
struct FInstancedActorsConfig final
{
public:
	TSubclassOf<class UMassActorSpawnerSubsystem> ServerActorSpawnerSubsystemClass;                  // 0x0000(0x0008)(Edit, ZeroConstructor, Config, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMassActorSpawnerSubsystem> ClientActorSpawnerSubsystemClass;                  // 0x0008(0x0008)(Edit, ZeroConstructor, Config, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UInstancedActorsSubsystem>  InstancedActorsSubsystemClass;                     // 0x0010(0x0008)(Edit, ZeroConstructor, Config, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMassStationaryDistanceVisualizationTrait> StationaryVisualizationTraitClass;  // 0x0018(0x0008)(Edit, ZeroConstructor, Config, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct InstancedActors.ClassConfigOverrideEntry
// 0x0028 (0x0028 - 0x0000)
struct FClassConfigOverrideEntry final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedActorsConfig                 ConfigOverride;                                    // 0x0008(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct InstancedActors.InstancedActorsSettings
// 0x0098 (0x00A0 - 0x0008)
struct FInstancedActorsSettings : public FTableRowBase
{
public:
	uint8                                         bOverride_bInstancesCastShadows : 1;               // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MaxActorDistance : 1;                    // 0x0008(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bDisableAutoDistanceCulling : 1;         // 0x0008(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MaxInstanceDistance : 1;                 // 0x0008(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MaxInstanceDistances : 1;                // 0x0008(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LODDistanceScales : 1;                   // 0x0008(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AffectDistanceFieldLighting : 1;         // 0x0008(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_DetailedRepresentationLODDistance : 1;   // 0x0008(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ForceLowRepresentationLODDistance : 1;   // 0x0009(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_WorldPositionOffsetDisableDistance : 1;  // 0x0009(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bEjectOnActorMoved : 1;                  // 0x0009(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ActorEjectionMovementThreshold : 1;      // 0x0009(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bCanEverAffectNavigation : 1;            // 0x0009(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OverrideWorldPartitionGrid : 1;          // 0x0009(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ScaleEntityCount : 1;                    // 0x0009(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ActorClass : 1;                          // 0x0009(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bCanBeDamaged : 1;                       // 0x000A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bIgnoreModifierVolumes : 1;              // 0x000A(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bControlPhysicsState : 1;                // 0x000A(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bInstancesCastShadows;                             // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxActorDistance;                                  // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableAutoDistanceCulling;                       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bControlPhysicsState;                              // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxInstanceDistance;                               // 0x0020(0x0008)(ZeroConstructor, Transient, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<double>                                MaxInstanceDistances;                              // 0x0028(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 LODDistanceScales;                                 // 0x0038(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<bool>                                  AffectDistanceFieldLighting;                       // 0x0048(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	double                                        DetailedRepresentationLODDistance;                 // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ForceLowRepresentationLODDistance;                 // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WorldPositionOffsetDisableDistance;                // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEjectOnActorMoved;                                // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActorEjectionMovementThreshold;                    // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEverAffectNavigation;                          // 0x0074(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OverrideWorldPartitionGrid;                        // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleEntityCount;                                  // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanBeDamaged;                                     // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreModifierVolumes;                            // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           AppliedSettingsOverrides;                          // 0x0090(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct InstancedActors.InstancedActorsClassSettingsBase
// 0x0010 (0x0018 - 0x0008)
struct FInstancedActorsClassSettingsBase : public FTableRowBase
{
public:
	TArray<class FName>                           BaseSettings;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct InstancedActors.InstancedActorsClassSettings
// 0x00A0 (0x00B8 - 0x0018)
struct FInstancedActorsClassSettings final : public FInstancedActorsClassSettingsBase
{
public:
	struct FInstancedActorsSettings               OverrideSettings;                                  // 0x0018(0x00A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct InstancedActors.InstancedActorsTagSet
// 0x0028 (0x0028 - 0x0000)
struct FInstancedActorsTagSet final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(Edit, EditConst, NativeAccessSpecifierPrivate)
	uint32                                        Hash;                                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct InstancedActors.InstancedActorsVisualizationDesc
// 0x0010 (0x0010 - 0x0000)
struct FInstancedActorsVisualizationDesc final
{
public:
	TArray<struct FISMComponentDescriptor>        ISMComponentDescriptors;                           // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct InstancedActors.InstancedActorsSoftVisualizationDesc
// 0x0010 (0x0010 - 0x0000)
struct FInstancedActorsSoftVisualizationDesc final
{
public:
	TArray<struct FSoftISMComponentDescriptor>    ISMComponentDescriptors;                           // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct InstancedActors.InstancedActorsVisualizationInfo
// 0x0050 (0x0050 - 0x0000)
struct FInstancedActorsVisualizationInfo final
{
public:
	struct FInstancedActorsVisualizationDesc      VisualizationDesc;                                 // 0x0000(0x0010)(Edit, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInstancedStaticMeshComponent*>  ISMComponents;                                     // 0x0010(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FStaticMeshInstanceVisualizationDescHandle MassStaticMeshDescHandle;                      // 0x0020(0x0002)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2E];                                      // 0x0022(0x002E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct InstancedActors.InstancedActorsMeshSwitchFragment
// 0x0002 (0x0002 - 0x0000)
struct FInstancedActorsMeshSwitchFragment final : public FMassFragment
{
public:
	struct FStaticMeshInstanceVisualizationDescHandle NewStaticMeshDescHandle;                       // 0x0000(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct InstancedActors.InstancedActorsManagerHandle
// 0x0004 (0x0004 - 0x0000)
struct FInstancedActorsManagerHandle final
{
public:
	int32                                         ManagerID;                                         // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct InstancedActors.InstancedActorsModifierVolumeHandle
// 0x0004 (0x0004 - 0x0000)
struct FInstancedActorsModifierVolumeHandle final
{
public:
	int32                                         ModifierVolumeID;                                  // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct InstancedActors.InstancedActorsDataSharedFragment
// 0x000C (0x000C - 0x0000)
struct FInstancedActorsDataSharedFragment final : public FMassSharedFragment
{
public:
	TWeakObjectPtr<class UInstancedActorsData>    InstanceData;                                      // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x4];                                        // 0x0008(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct InstancedActors.InstancedActorsFragment
// 0x000C (0x000C - 0x0000)
struct FInstancedActorsFragment final : public FMassFragment
{
public:
	TWeakObjectPtr<class UInstancedActorsData>    InstanceData;                                      // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedActorsInstanceIndex          InstanceIndex;                                     // 0x0008(0x0002)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

