#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeEngine

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InterchangeCore_structs.hpp"
#include "InterchangeCore_classes.hpp"
#include "InterchangeEngine_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class InterchangeEngine.InterchangeBlueprintPipelineBase
// 0x0000 (0x00A8 - 0x00A8)
class UInterchangeBlueprintPipelineBase final : public UBlueprint
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeBlueprintPipelineBase">();
	}
	static class UInterchangeBlueprintPipelineBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeBlueprintPipelineBase>();
	}
};

// Class InterchangeEngine.InterchangeFilePickerBase
// 0x0000 (0x0028 - 0x0028)
class UInterchangeFilePickerBase final : public UObject
{
public:
	bool ScriptedFilePickerForTranslatorAssetType(const EInterchangeTranslatorAssetType TranslatorAssetType, struct FInterchangeFilePickerParameters* Parameters, TArray<class FString>* OutFilenames);
	bool ScriptedFilePickerForTranslatorType(const EInterchangeTranslatorType TranslatorType, struct FInterchangeFilePickerParameters* Parameters, TArray<class FString>* OutFilenames);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeFilePickerBase">();
	}
	static class UInterchangeFilePickerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeFilePickerBase>();
	}
};

// Class InterchangeEngine.InterchangePipelineConfigurationBase
// 0x0000 (0x0028 - 0x0028)
class UInterchangePipelineConfigurationBase final : public UObject
{
public:
	EInterchangePipelineConfigurationDialogResult ScriptedShowPipelineConfigurationDialog(TArray<struct FInterchangeStackInfo>* PipelineStacks, TArray<class UInterchangePipelineBase*>* OutPipelines, class UInterchangeSourceData* SourceData, class UInterchangeTranslatorBase* Translator, class UInterchangeBaseNodeContainer* BaseNodeContainer);
	EInterchangePipelineConfigurationDialogResult ScriptedShowReimportPipelineConfigurationDialog(TArray<struct FInterchangeStackInfo>* PipelineStacks, TArray<class UInterchangePipelineBase*>* OutPipelines, class UInterchangeSourceData* SourceData, class UInterchangeTranslatorBase* Translator, class UInterchangeBaseNodeContainer* BaseNodeContainer, class UObject* ReimportAsset);
	EInterchangePipelineConfigurationDialogResult ScriptedShowScenePipelineConfigurationDialog(TArray<struct FInterchangeStackInfo>* PipelineStacks, TArray<class UInterchangePipelineBase*>* OutPipelines, class UInterchangeSourceData* SourceData, class UInterchangeTranslatorBase* Translator, class UInterchangeBaseNodeContainer* BaseNodeContainer);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangePipelineConfigurationBase">();
	}
	static class UInterchangePipelineConfigurationBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangePipelineConfigurationBase>();
	}
};

// Class InterchangeEngine.InterchangeProjectSettings
// 0x0200 (0x0230 - 0x0030)
class UInterchangeProjectSettings final : public UDeveloperSettings
{
public:
	struct FInterchangeContentImportSettings      ContentImportSettings;                             // 0x0030(0x0120)(Edit, Config, NativeAccessSpecifierPublic)
	struct FInterchangeImportSettings             SceneImportSettings;                               // 0x0150(0x0080)(Edit, Config, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   FilePickerClass;                                   // 0x01D0(0x0020)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStaticMeshUseSmoothEdgesIfSmoothingInformationIsMissing; // 0x01F0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   GenericPipelineClass;                              // 0x01F8(0x0020)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ConverterDefaultPipeline;                          // 0x0218(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeProjectSettings">();
	}
	static class UInterchangeProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeProjectSettings>();
	}
};

// Class InterchangeEngine.InterchangeEditorSettings
// 0x0008 (0x0038 - 0x0030)
class UInterchangeEditorSettings final : public UDeveloperSettings
{
public:
	bool                                          bShowImportDialogAtReimport;                       // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeEditorSettings">();
	}
	static class UInterchangeEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeEditorSettings>();
	}
};

// Class InterchangeEngine.InterchangePythonPipelineBase
// 0x0000 (0x0118 - 0x0118)
class UInterchangePythonPipelineBase final : public UInterchangePipelineBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangePythonPipelineBase">();
	}
	static class UInterchangePythonPipelineBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangePythonPipelineBase>();
	}
};

// Class InterchangeEngine.InterchangePythonPipelineAsset
// 0x0038 (0x0060 - 0x0028)
class UInterchangePythonPipelineAsset final : public UObject
{
public:
	TSoftClassPtr<class UClass>                   PythonClass;                                       // 0x0028(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangePythonPipelineBase*         GeneratedPipeline;                                 // 0x0048(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JsonDefaultProperties;                             // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangePythonPipelineAsset">();
	}
	static class UInterchangePythonPipelineAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangePythonPipelineAsset>();
	}
};

// Class InterchangeEngine.InterchangeSceneImportAsset
// 0x0008 (0x0030 - 0x0028)
class UInterchangeSceneImportAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeSceneImportAsset">();
	}
	static class UInterchangeSceneImportAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeSceneImportAsset>();
	}
};

// Class InterchangeEngine.InterchangeAssetImportData
// 0x00A8 (0x00D0 - 0x0028)
class UInterchangeAssetImportData final : public UAssetImportData
{
public:
	struct FSoftObjectPath                        SceneImportAsset;                                  // 0x0028(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NodeUniqueID;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeBaseNodeContainer*          NodeContainer;                                     // 0x0050(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        Pipelines;                                         // 0x0058(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UInterchangeBaseNodeContainer*          TransientNodeContainer;                            // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        TransientPipelines;                                // 0x0070(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UInterchangeTranslatorSettings*         TransientTranslatorSettings;                       // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x48];                                      // 0x0088(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UInterchangeBaseNodeContainer* GetNodeContainer() const;
	int32 GetNumberOfPipelines() const;
	TArray<class UObject*> GetPipelines() const;
	class UInterchangeFactoryBaseNode* GetStoredFactoryNode(const class FString& InNodeUniqueId) const;
	const class UInterchangeBaseNode* GetStoredNode(const class FString& InNodeUniqueId) const;
	const class UInterchangeTranslatorSettings* GetTranslatorSettings() const;
	TArray<class FString> ScriptExtractDisplayLabels() const;
	TArray<class FString> ScriptExtractFilenames() const;
	class FString ScriptGetFirstFilename() const;
	void SetNodeContainer(class UInterchangeBaseNodeContainer* InNodeContainer) const;
	void SetPipelines(const TArray<class UObject*>& InPipelines) const;
	void SetTranslatorSettings(class UInterchangeTranslatorSettings* TranslatorSettings) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeAssetImportData">();
	}
	static class UInterchangeAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeAssetImportData>();
	}
};

// Class InterchangeEngine.InterchangeAssetImportDataConverterBase
// 0x0000 (0x0028 - 0x0028)
class UInterchangeAssetImportDataConverterBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeAssetImportDataConverterBase">();
	}
	static class UInterchangeAssetImportDataConverterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeAssetImportDataConverterBase>();
	}
};

// Class InterchangeEngine.InterchangePipelineStackOverride
// 0x0010 (0x0038 - 0x0028)
class UInterchangePipelineStackOverride final : public UObject
{
public:
	TArray<struct FSoftObjectPath>                OverridePipelines;                                 // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void AddBlueprintPipeline(class UInterchangeBlueprintPipelineBase* PipelineBase);
	void AddPipeline(class UInterchangePipelineBase* PipelineBase);
	void AddPythonPipeline(class UInterchangePythonPipelineBase* PipelineBase);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangePipelineStackOverride">();
	}
	static class UInterchangePipelineStackOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangePipelineStackOverride>();
	}
};

// Class InterchangeEngine.InterchangeManager
// 0x0368 (0x0390 - 0x0028)
class alignas(0x10) UInterchangeManager final : public UObject
{
public:
	uint8                                         Pad_28[0x1A8];                                     // 0x0028(0x01A8)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TSubclassOf<class UObject>>              RegisteredTranslatorsClass;                        // 0x01D0(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UObject>, TSubclassOf<class UObject>> RegisteredFactoryClasses;           // 0x0220(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UObject>, class UInterchangeWriterBase*> RegisteredWriters;               // 0x0270(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UObject>, class UInterchangeAssetImportDataConverterBase*> RegisteredConverters; // 0x02C0(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_310[0x80];                                     // 0x0310(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UInterchangeSourceData* CreateSourceData(const class FString& InFilename);
	static class UInterchangeManager* GetInterchangeManagerScripted();

	bool ExportAsset(const class UObject* Asset, bool bIsAutomated);
	bool ExportScene(const class UObject* World, bool bIsAutomated);
	bool ImportAsset(const class FString& ContentPath, const class UInterchangeSourceData* SourceData, const struct FImportAssetParameters& ImportAssetParameters, TArray<class UObject*>* OutImportedObjects);
	bool ImportScene(const class FString& ContentPath, const class UInterchangeSourceData* SourceData, const struct FImportAssetParameters& ImportAssetParameters);
	bool ScriptedImportAssetAsync(const class FString& ContentPath, const class UInterchangeSourceData* SourceData, const struct FImportAssetParameters& ImportAssetParameters);
	bool ScriptedImportSceneAsync(const class FString& ContentPath, const class UInterchangeSourceData* SourceData, const struct FImportAssetParameters& ImportAssetParameters);

	const class UClass* GetRegisteredFactoryClass(const class UClass* ClassToMake) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeManager">();
	}
	static class UInterchangeManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeManager>();
	}
};

// Class InterchangeEngine.InterchangeMeshUtilities
// 0x0000 (0x0028 - 0x0028)
class UInterchangeMeshUtilities final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterchangeMeshUtilities">();
	}
	static class UInterchangeMeshUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeMeshUtilities>();
	}
};

}

