#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemizedPropSpawnerParentRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ItemizedPropSpawnerParentRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function ItemizedPropSpawnerParentRuntime.FortGameplayAbility_RangedPropSpawner.HandleAbilityRejectedOnClient
// 0x0008 (0x0008 - 0x0000)
struct FortGameplayAbility_RangedPropSpawner_HandleAbilityRejectedOnClient final
{
public:
	class AFortWeapon*                            SourceWeapon;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizedPropSpawnerParentRuntime.EmeraldGlassIceWallChunk.AttachActors
// 0x0028 (0x0028 - 0x0000)
struct EmeraldGlassIceWallChunk_AttachActors final
{
public:
	TArray<class AEmeraldGlassIceWallChunk*>      ChunksInMyWall;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         SupportingActors;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 DirectBase;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizedPropSpawnerParentRuntime.EmeraldGlassIceWallChunk.FindSupportingActors
// 0x0028 (0x0028 - 0x0000)
struct EmeraldGlassIceWallChunk_FindSupportingActors final
{
public:
	TArray<class AActor*>                         InOutSupportingActors;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bAllowIceWallsAsSupportingActors;                  // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEmeraldGlassIceWallChunk*>      ChunksInMyWall;                                    // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function ItemizedPropSpawnerParentRuntime.EmeraldGlassIceWallChunk.GetComponentsForOverlapCheck
// 0x0010 (0x0010 - 0x0000)
struct EmeraldGlassIceWallChunk_GetComponentsForOverlapCheck final
{
public:
	TArray<class UPrimitiveComponent*>            OutComponents;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function ItemizedPropSpawnerParentRuntime.EmeraldGlassIceWallChunk.NativeCheckOverlappedActor
// 0x00B8 (0x00B8 - 0x0000)
struct EmeraldGlassIceWallChunk_NativeCheckOverlappedActor final
{
public:
	struct FSereneYardOverlappedActorCheckData    CheckData;                                         // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 OverlappedActor;                                   // 0x0098(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UCapsuleComponent*>              InOutComponentsSetToIgnoreCollision;               // 0x00A0(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bInOutShouldPlayImpulseCue;                        // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutDestroyOverlappedActor;                        // 0x00B1(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutShouldWaitATick;                               // 0x00B2(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutDestroyProp;                                   // 0x00B3(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ItemizedPropSpawnerParentRuntime.EmeraldGlassIceWallChunk.NativeShouldActorBlockSpawn
// 0x0018 (0x0018 - 0x0000)
struct EmeraldGlassIceWallChunk_NativeShouldActorBlockSpawn final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldLaunch;                                     // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           BlockTag;                                          // 0x000C(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ItemizedPropSpawnerParentRuntime.EmeraldGlassIceWallChunk.NativeShouldDestroyOverlappedActor
// 0x0030 (0x0030 - 0x0000)
struct EmeraldGlassIceWallChunk_NativeShouldDestroyOverlappedActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TagsToDestroyOverlappedActor;                      // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ItemizedPropSpawnerParentRuntime.EmeraldGlassIceWallChunk.IsIceWallAllowedToOverlapActor
// 0x0010 (0x0010 - 0x0000)
struct EmeraldGlassIceWallChunk_IsIceWallAllowedToOverlapActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ItemizedPropSpawnerParentRuntime.FortControllerComponent_SereneYard.AddTrackedInstance
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_SereneYard_AddTrackedInstance final
{
public:
	class ABuildingGameplayActor*                 TrackedInstance;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizedPropSpawnerParentRuntime.FortControllerComponent_SereneYard.GetOldestTrackedInstance
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_SereneYard_GetOldestTrackedInstance final
{
public:
	class ABuildingGameplayActor*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizedPropSpawnerParentRuntime.FortControllerComponent_SereneYard.GetTrackedInstanceCount
// 0x0004 (0x0004 - 0x0000)
struct FortControllerComponent_SereneYard_GetTrackedInstanceCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ItemizedPropSpawnerParentRuntime.SereneYardFunctionLibraryNative.BuildPropDataForWeaponData
// 0x0070 (0x0070 - 0x0000)
struct SereneYardFunctionLibraryNative_BuildPropDataForWeaponData final
{
public:
	TArray<struct FNativeItemizedPropSpawner_PropSpawnData> PropSpawnDataArray;                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     PropRelativeTransforms;                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<ESereneYardChunkLocation, int32>         ChunkLocationToPropIndexMap;                       // 0x0020(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function ItemizedPropSpawnerParentRuntime.SereneYardFunctionLibraryNative.NativeCheckSpawnValidity
// 0x0198 (0x0198 - 0x0000)
struct SereneYardFunctionLibraryNative_NativeCheckSpawnValidity final
{
public:
	struct FSereneYardWeaponData                  WeaponData;                                        // 0x0000(0x0140)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                InOutTargetLocation;                               // 0x0140(0x0018)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraYaw;                                         // 0x0158(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckForAllChunks;                                // 0x015C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  OutValidity;                                       // 0x0160(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<double>                                OutOffsets;                                        // 0x0170(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         OutActorsBeingUsedAsBase;                          // 0x0180(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	ESereneYardTargetingFailedReason              OutFailureReason;                                  // 0x0190(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0191(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function ItemizedPropSpawnerParentRuntime.SereneYardFunctionLibraryNative.NativeUpdateTarget
// 0x0178 (0x0178 - 0x0000)
struct SereneYardFunctionLibraryNative_NativeUpdateTarget final
{
public:
	struct FSereneYardWeaponData                  WeaponData;                                        // 0x0000(0x0140)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                outTargetLocation;                                 // 0x0140(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESereneYardTargetingFailedReason              OutFailureReason;                                  // 0x0158(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  OutValidity;                                       // 0x0160(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0170(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

