#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JamFabricRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FabricRuntime_structs.hpp"
#include "FabricRuntime_classes.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "FMCoreRuntime_structs.hpp"


namespace SDK
{

// Class JamFabricRuntime.JamFabricBridgePlayspaceComponent
// 0x0058 (0x00F8 - 0x00A0)
class UJamFabricBridgePlayspaceComponent final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     DeviceCableManagerClass;                           // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UJamFabricPatchWrapper>     FabricPatchWrapperClass;                           // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           FabricMusicEventTag;                               // 0x00B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           FabricControlsJamTag;                              // 0x00BC(0x0004)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJamFabricPatchWrapper*                 FabricPatchWrapperInstance;                        // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EJamFabricSyncType                            SyncType;                                          // 0x00C8(0x0001)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C9[0x2F];                                      // 0x00C9(0x002F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFabricKeyChanged(EMusicKey CurrentKey);
	void OnFabricModeChanged(EMusicKeyMode CurrentMode);
	void OnFabricMusicEventGroupChanged(const class FName& CurrentMusicEventGroup);
	void OnFabricMusicEventPriorityChanged(EFabricMetasoundMusicEventPriority CurrentMusicEventPriority);
	void OnFabricPlayStateChanged(EFabricMetasoundPlayState CurrentState);
	void OnFabricTempoChanged(int32 CurrentTempo);
	void OnPlayspaceVolumeReplicated(class APlayspace* Playspace);
	void OnRep_SyncType();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamFabricBridgePlayspaceComponent">();
	}
	static class UJamFabricBridgePlayspaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamFabricBridgePlayspaceComponent>();
	}
};

// Class JamFabricRuntime.JamFabricPatchWrapper
// 0x0000 (0x0788 - 0x0788)
class UJamFabricPatchWrapper final : public UFabricMetaSoundPatchWrapper
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JamFabricPatchWrapper">();
	}
	static class UJamFabricPatchWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJamFabricPatchWrapper>();
	}
};

}

