#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoWorldManagement

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class JunoWorldManagement.JunoWorldManagementHandler
// 0x0000 (0x0028 - 0x0028)
class UJunoWorldManagementHandler : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldManagementHandler">();
	}
	static class UJunoWorldManagementHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldManagementHandler>();
	}
};

// Class JunoWorldManagement.JunoWorld
// 0x00E8 (0x0110 - 0x0028)
class UJunoWorld : public UObject
{
public:
	uint8                                         Pad_28[0xE8];                                      // 0x0028(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorld">();
	}
	static class UJunoWorld* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorld>();
	}
};

// Class JunoWorldManagement.JunoUserWorldView
// 0x0028 (0x0138 - 0x0110)
class UJunoUserWorldView final : public UJunoWorld
{
public:
	uint8                                         Pad_110[0x28];                                     // 0x0110(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoUserWorldView">();
	}
	static class UJunoUserWorldView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoUserWorldView>();
	}
};

// Class JunoWorldManagement.JunoWorldManagerSubsystem
// 0x0048 (0x0078 - 0x0030)
class UJunoWorldManagerSubsystem final : public UWorldSubsystem
{
public:
	bool                                          bEnableWorldManager;                               // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableWorldManagerInPIE;                          // 0x0031(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WorldPersistenceCompatibilityVersion;              // 0x0034(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DeviceProfileSuffix;                               // 0x0038(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoWorldManagementHandler*            WorldManagementHandler;                            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldManagerSubsystem">();
	}
	static class UJunoWorldManagerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldManagerSubsystem>();
	}
};

// Class JunoWorldManagement.JunoWorldManagerSubsystemData
// 0x0018 (0x0048 - 0x0030)
class UJunoWorldManagerSubsystemData final : public UPrimaryDataAsset
{
public:
	TArray<TSubclassOf<class UJunoWorldManagementHandler>> AvailableWorldManagementHandlerClasses;   // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TSubclassOf<class UJunoWorldManagementHandler> DefaultWorldManagementHandlerClass;               // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldManagerSubsystemData">();
	}
	static class UJunoWorldManagerSubsystemData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldManagerSubsystemData>();
	}
};

// Class JunoWorldManagement.JunoPersistenceFeatureWorldMetadataCorrespondentInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoPersistenceFeatureWorldMetadataCorrespondentInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPersistenceFeatureWorldMetadataCorrespondentInterface">();
	}
	static class IJunoPersistenceFeatureWorldMetadataCorrespondentInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoPersistenceFeatureWorldMetadataCorrespondentInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class JunoWorldManagement.JunoWorldManagementHandler_WorldArbitrationService
// 0x00F8 (0x0120 - 0x0028)
class UJunoWorldManagementHandler_WorldArbitrationService final : public UJunoWorldManagementHandler
{
public:
	TMap<class FString, class UJunoUserWorldView*> WorldViewMap;                                     // 0x0028(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x50];                                      // 0x0078(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        GetAllAccessibleWorldsCacheTime;                   // 0x00C8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        GetAllAccessibleWorldsErrorCacheTime;              // 0x00CC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x50];                                      // 0x00D0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldManagementHandler_WorldArbitrationService">();
	}
	static class UJunoWorldManagementHandler_WorldArbitrationService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldManagementHandler_WorldArbitrationService>();
	}
};

}

