#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCreature_TamingUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "JunoUI_structs.hpp"
#include "JunoCreature_TamingUI_structs.hpp"
#include "JunoGameNative_structs.hpp"


namespace SDK::Params
{

// Function JunoCreature_TamingUI.JunoBarnAssignmentListEntry.OnBarnAssignmentObjectSet
// 0x0008 (0x0008 - 0x0000)
struct JunoBarnAssignmentListEntry_OnBarnAssignmentObjectSet final
{
public:
	class UJunoBarnAssignmentListObject*          NewBarnAssignmentListObject;                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetDescriptorTag
// 0x0004 (0x0004 - 0x0000)
struct JunoBarnAssignmentListObject_GetDescriptorTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct JunoBarnAssignmentListObject_GetDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetFriendshipStateTag
// 0x0004 (0x0004 - 0x0000)
struct JunoBarnAssignmentListObject_GetFriendshipStateTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetFriendshipValue
// 0x0004 (0x0004 - 0x0000)
struct JunoBarnAssignmentListObject_GetFriendshipValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetHasBed
// 0x0001 (0x0001 - 0x0000)
struct JunoBarnAssignmentListObject_GetHasBed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetIcon
// 0x0020 (0x0020 - 0x0000)
struct JunoBarnAssignmentListObject_GetIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetIsFollowingEntry
// 0x0001 (0x0001 - 0x0000)
struct JunoBarnAssignmentListObject_GetIsFollowingEntry final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetIsGlobalLimitReachedEntry
// 0x0001 (0x0001 - 0x0000)
struct JunoBarnAssignmentListObject_GetIsGlobalLimitReachedEntry final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetIsNoNearbyAnimalEntry
// 0x0001 (0x0001 - 0x0000)
struct JunoBarnAssignmentListObject_GetIsNoNearbyAnimalEntry final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetIsNoVillageSlot
// 0x0001 (0x0001 - 0x0000)
struct JunoBarnAssignmentListObject_GetIsNoVillageSlot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.GetUniqueAIIdentifier
// 0x0004 (0x0004 - 0x0000)
struct JunoBarnAssignmentListObject_GetUniqueAIIdentifier final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentListObject.IsSelectable
// 0x0001 (0x0001 - 0x0000)
struct JunoBarnAssignmentListObject_IsSelectable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoVillageTamingLevelRewardsColumn.SetIsExpanded
// 0x0001 (0x0001 - 0x0000)
struct JunoVillageTamingLevelRewardsColumn_SetIsExpanded final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoVillageTamingLevelRewardsColumn.SetVillageRewardEntryInfo
// 0x0248 (0x0248 - 0x0000)
struct JunoVillageTamingLevelRewardsColumn_SetVillageRewardEntryInfo final
{
public:
	struct FJunoVillageTamingLevelRewardsColumnInfo InVillageTamingLevelRewardsColumnInfo;           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FJunoVillageUIData                     InParentVillageUIData;                             // 0x0018(0x0230)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoVillageTamingLevelRewardsEntry.SetExpanded
// 0x0001 (0x0001 - 0x0000)
struct JunoVillageTamingLevelRewardsEntry_SetExpanded final
{
public:
	bool                                          bInIsExpanded;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoVillageTamingLevelRewardsEntry.SetVillageRewardEntryInfo
// 0x0298 (0x0298 - 0x0000)
struct JunoVillageTamingLevelRewardsEntry_SetVillageRewardEntryInfo final
{
public:
	struct FJunoVillageTamingLevelRewardsEntryInfo InVillageTamingLevelRewardsEntryInfo;             // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FJunoVillageUIData                     InParentVillageUIData;                             // 0x0068(0x0230)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoVillageTamingVillagerEntry.SetVillagerInfo
// 0x0130 (0x0130 - 0x0000)
struct JunoVillageTamingVillagerEntry_SetVillagerInfo final
{
public:
	struct FJunoVillageTamingVillagerEntryInfo    InVillagerInfo;                                    // 0x0000(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentScreen.OnSelectionChanged
// 0x0008 (0x0008 - 0x0000)
struct JunoBarnAssignmentScreen_OnSelectionChanged final
{
public:
	const class UJunoBarnAssignmentListObject*    InSelectedListObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentScreen.GetGlobalHasSlotForAnimal
// 0x0001 (0x0001 - 0x0000)
struct JunoBarnAssignmentScreen_GetGlobalHasSlotForAnimal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnAssignmentScreen.GetVillageHasSlotForAnimal
// 0x0001 (0x0001 - 0x0000)
struct JunoBarnAssignmentScreen_GetVillageHasSlotForAnimal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoBarnProcessorScreen.SetupAnimalInfo
// 0x0098 (0x0098 - 0x0000)
struct JunoBarnProcessorScreen_SetupAnimalInfo final
{
public:
	struct FActiveCampCreatureEntry               Data;                                              // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoTamingMapMarkerIconScreen.SetMarkerNameText
// 0x0018 (0x0018 - 0x0000)
struct JunoTamingMapMarkerIconScreen_SetMarkerNameText final
{
public:
	bool                                          bIsTown;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoTamingMapMarkerIconScreen.SetPreviewMarkerMaterial
// 0x0001 (0x0001 - 0x0000)
struct JunoTamingMapMarkerIconScreen_SetPreviewMarkerMaterial final
{
public:
	bool                                          bIsTown;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoTamingMapMarkerMenuContainer.HandleTabSelected
// 0x0004 (0x0004 - 0x0000)
struct JunoTamingMapMarkerMenuContainer_HandleTabSelected final
{
public:
	class FName                                   SelectedTabId;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoTamingMapMarkerNameScreen.SetMarkerNameText
// 0x0010 (0x0010 - 0x0000)
struct JunoTamingMapMarkerNameScreen_SetMarkerNameText final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingUI.JunoVillageTamingVillagersScreen.OnEntryHovered
// 0x0008 (0x0008 - 0x0000)
struct JunoVillageTamingVillagersScreen_OnEntryHovered final
{
public:
	class UJunoVillageTamingVillagerEntry*        Entry;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

