#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoProceduralLandscape

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct JunoProceduralLandscape.JunoLandscapeCachedComponentKey
// 0x000C (0x000C - 0x0000)
struct FJunoLandscapeCachedComponentKey final
{
public:
	class FName                                   PackagePath;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ComponentKey;                                      // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeLayerInfo
// 0x0030 (0x0030 - 0x0000)
struct FJunoLandscapeLayerInfo final
{
public:
	class ULandscapeLayerInfoObject*              LandscapeInfo;                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LayerName;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         WeightmapTextureIndex;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WeightmapTextureMask;                              // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                      PhysicsMaterial;                                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumCollisionRelevanceWeight;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeCustomOutputInfo
// 0x0020 (0x0020 - 0x0000)
struct FJunoLandscapeCustomOutputInfo final
{
public:
	int32                                         InputIndex;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutputIndex;                                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsConstant;                                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConstantValue;                                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                InputObject;                                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeGrassAndPhysics
// 0x0038 (0x0038 - 0x0000)
struct FJunoLandscapeGrassAndPhysics final
{
public:
	uint16                                        ShaderPlatform;                                    // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoLandscapeCustomOutputInfo> AvailableGrasses;                                  // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoLandscapeCustomOutputInfo> AvailablePhysicsMaterials;                         // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGuid                                  SavedMaterialID;                                   // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeMaterialCacheKeyBase
// 0x0018 (0x0018 - 0x0000)
struct FJunoLandscapeMaterialCacheKeyBase
{
public:
	TArray<class FName>                           OrderedLayers;                                     // 0x0000(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint32                                        KeyHash;                                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsTextureSorted;                                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeMaterialInstanceCacheKey
// 0x0000 (0x0018 - 0x0018)
struct FJunoLandscapeMaterialInstanceCacheKey final : public FJunoLandscapeMaterialCacheKeyBase
{
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeCombinedMaterialCacheKey
// 0x0000 (0x0018 - 0x0018)
struct FJunoLandscapeCombinedMaterialCacheKey final : public FJunoLandscapeMaterialCacheKeyBase
{
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeCombinedMaterialInstance
// 0x0030 (0x0030 - 0x0000)
struct FJunoLandscapeCombinedMaterialInstance final
{
public:
	TArray<struct FJunoLandscapeLayerInfo>        LandscapeInfos;                                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UMaterialInstanceConstant*              MaterialInstance;                                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceConstant*              CPUReadbackMaterialInstance;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               CPUReadbackSharedMID;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VisibilityLayerIndex;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRenderMaterials;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeCustomRenderIdentifier
// 0x0008 (0x0008 - 0x0000)
struct FJunoLandscapeCustomRenderIdentifier final
{
public:
	class FName                                   Identifier;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MipIndex;                                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeComponentPrecachSettings
// 0x0020 (0x0020 - 0x0000)
struct FJunoLandscapeComponentPrecachSettings final
{
public:
	bool                                          bPrecacheHeights;                                  // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrecachePhysicalMaterials;                        // 0x0001(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrecacheGrass;                                    // 0x0002(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrecacheAllWeightmaps;                            // 0x0003(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PrecacheWeightmaps;                                // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	bool                                          bPrecacheCustomRenders;                            // 0x0018(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldKeepHeights;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldKeepPhysicalMaterials;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeComponentPrecachedDataLayers
// 0x00F8 (0x00F8 - 0x0000)
struct FJunoLandscapeComponentPrecachedDataLayers final
{
public:
	TArray<class ULandscapeGrassType*>            SerializedGrassReferences;                         // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UPhysicalMaterial*>              SerializedPhysicalMaterials;                       // 0x0010(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FJunoLandscapeCustomRenderIdentifier> SerializedCustomRenders;                     // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0xC8];                                      // 0x0030(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeComponentPrecachedData
// 0x00E0 (0x00E0 - 0x0000)
struct FJunoLandscapeComponentPrecachedData final
{
public:
	uint32                                        ComponentQuads;                                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x2C];                                       // 0x0004(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SerializedWeightmaps;                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x50];                                      // 0x0040(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FJunoLandscapeMaterialInstanceCacheKey, struct FJunoLandscapeComponentPrecachedDataLayers> PrecachedLayersMap; // 0x0090(0x0050)(NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeLayersGroup
// 0x0018 (0x0018 - 0x0000)
struct FJunoLandscapeLayersGroup final
{
public:
	TArray<class FName>                           Layers;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         CombinationIndex;                                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeMaterialCache
// 0x00A0 (0x00A0 - 0x0000)
struct FJunoLandscapeMaterialCache final
{
public:
	TMap<struct FJunoLandscapeCombinedMaterialCacheKey, class UJunoLandscapeCombinedMaterial*> ExternalCombinedMaterials; // 0x0000(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FJunoLandscapeCombinedMaterialCacheKey, class UJunoLandscapeCombinedMaterial*> MaterialCombinations; // 0x0050(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralLandscape.JunoLandscapeGenerationData
// 0x0068 (0x0068 - 0x0000)
struct FJunoLandscapeGenerationData final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 Generator;                                         // 0x0008(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      LandscapeMaterial;                                 // 0x0028(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UJunoLandscapeLayersData> LayersData;                                       // 0x0048(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralLandscape.DrawToRenderTargetContext_JunoLandscape
// 0x0008 (0x0008 - 0x0000)
struct FDrawToRenderTargetContext_JunoLandscape final
{
public:
	class UJunoLandscapeRenderTarget*             RenderTarget;                                      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

