#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoBuildingCosmeticsUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "JunoBuildingCosmeticsUI_structs.hpp"


namespace SDK
{

// Class JunoBuildingCosmeticsUI.JunoBuildSetLockerCategoryConfig
// 0x0000 (0x0178 - 0x0178)
class UJunoBuildSetLockerCategoryConfig final : public UAthenaLockerCategoryConfig
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildSetLockerCategoryConfig">();
	}
	static class UJunoBuildSetLockerCategoryConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildSetLockerCategoryConfig>();
	}
};

// Class JunoBuildingCosmeticsUI.JunoPropBundleLockerCategoryConfig
// 0x0000 (0x0178 - 0x0178)
class UJunoPropBundleLockerCategoryConfig final : public UAthenaLockerCategoryConfig
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPropBundleLockerCategoryConfig">();
	}
	static class UJunoPropBundleLockerCategoryConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPropBundleLockerCategoryConfig>();
	}
};

// Class JunoBuildingCosmeticsUI.JunoCollectiblesLockerCategoryVM
// 0x0000 (0x0228 - 0x0228)
class UJunoCollectiblesLockerCategoryVM final : public UAthenaLockerCategoryVM
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoCollectiblesLockerCategoryVM">();
	}
	static class UJunoCollectiblesLockerCategoryVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoCollectiblesLockerCategoryVM>();
	}
};

// Class JunoBuildingCosmeticsUI.JunoShopBuildSetVM
// 0x0000 (0x0110 - 0x0110)
class UJunoShopBuildSetVM final : public UAthenaItemVM
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoShopBuildSetVM">();
	}
	static class UJunoShopBuildSetVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoShopBuildSetVM>();
	}
};

// Class JunoBuildingCosmeticsUI.JunoShopBuildSetItemDetailsVM
// 0x0040 (0x0350 - 0x0310)
class UJunoShopBuildSetItemDetailsVM final : public UAthenaItemDetailsVM
{
public:
	uint8                                         Pad_310[0x20];                                     // 0x0310(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoShopBuildPartInfo>         Parts;                                             // 0x0330(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJunoShopBuildResourceRequirement> ResourceRequirements;                           // 0x0340(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void ForceUpdateItemDetails();

	TArray<class FText> GetFormattedPartList() const;
	int32 GetTotalPartCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoShopBuildSetItemDetailsVM">();
	}
	static class UJunoShopBuildSetItemDetailsVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoShopBuildSetItemDetailsVM>();
	}
};

// Class JunoBuildingCosmeticsUI.JunoShopPropBundleVM
// 0x0000 (0x0110 - 0x0110)
class UJunoShopPropBundleVM final : public UAthenaItemVM
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoShopPropBundleVM">();
	}
	static class UJunoShopPropBundleVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoShopPropBundleVM>();
	}
};

// Class JunoBuildingCosmeticsUI.JunoShopPropBundleItemDetailsVM
// 0x0020 (0x0330 - 0x0310)
class UJunoShopPropBundleItemDetailsVM final : public UAthenaItemDetailsVM
{
public:
	TArray<struct FJunoShopPropInfo>              Props;                                             // 0x0310(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FJunoShopBuildResourceRequirement> ResourceRequirements;                           // 0x0320(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	TArray<class FText> GetPropNames() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoShopPropBundleItemDetailsVM">();
	}
	static class UJunoShopPropBundleItemDetailsVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoShopPropBundleItemDetailsVM>();
	}
};

}

