#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoPowerSystemRuntime

#include "Basic.hpp"

#include "JunoGameNative_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JunoPowerSystemRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class JunoPowerSystemRuntime.JunoPowerBank
// 0x0010 (0x0CB0 - 0x0CA0)
class AJunoPowerBank final : public AJunoBuildingActor
{
public:
	class UJunoInventoryComponent*                InventoryComponent;                                // 0x0CA0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoPowerManagerComponent*             PowerManager;                                      // 0x0CA8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleInventoryChanged(const TArray<class UFortItem*>& AddedItems, const TArray<class UFortItem*>& RemovedItems);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPowerBank">();
	}
	static class AJunoPowerBank* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPowerBank>();
	}
};

// Class JunoPowerSystemRuntime.JunoPowerCenter
// 0x0030 (0x0CD0 - 0x0CA0)
class AJunoPowerCenter final : public AJunoBuildingActor
{
public:
	class UJunoInventoryComponent*                InventoryComponent;                                // 0x0CA0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWeaponItemDefinition*              PowerItemDef;                                      // 0x0CA8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoPowerManagerComponent*             PowerManager;                                      // 0x0CB0(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  CurrentPowerItemGUID;                              // 0x0CB8(0x0010)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CC8[0x8];                                      // 0x0CC8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleInventoryChanged(const TArray<class UFortItem*>& AddedItems, const TArray<class UFortItem*>& RemovedItems);

	float GetCurrentPowerCapacity() const;
	struct FGuid GetCurrentPowerItemGUID() const;
	float GetMaxPowerCapacity() const;
	float GetPowerCapacityPercent() const;
	float GetPowerConsumptionAmount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPowerCenter">();
	}
	static class AJunoPowerCenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPowerCenter>();
	}
};

// Class JunoPowerSystemRuntime.JunoPowerConsumerComponent
// 0x0078 (0x0118 - 0x00A0)
class UJunoPowerConsumerComponent final : public UGameFrameworkComponent
{
public:
	struct FScalableFloat                         PowerRequired;                                     // 0x00A0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ConsumptionInterval;                               // 0x00C8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ConsumerChannelTags;                               // 0x00F0(0x0020)(SaveGame, Protected, NativeAccessSpecifierProtected)
	class UJunoPowerManagerComponent*             PowerManager;                                      // 0x0110(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AddPowerChannel(const struct FGameplayTag& Channel);
	bool ConsumePower();
	bool HasPower();
	void OnAttached(const struct FGraphIslandHandle& IslandHandle);
	void OnDetached();
	void RegisterPowerConsumer(const struct FGameplayTagContainer& Channels);
	void RemovePowerChannel(const struct FGameplayTag& Channel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPowerConsumerComponent">();
	}
	static class UJunoPowerConsumerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPowerConsumerComponent>();
	}
};

// Class JunoPowerSystemRuntime.JunoPowerManagerComponent
// 0x0080 (0x0120 - 0x00A0)
class UJunoPowerManagerComponent final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnStartConsumingPowerEvent;                        // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnStopConsumingPowerEvent;                         // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AJunoPowerCenter>> AttachedPowerCenters;                             // 0x00D8(0x0010)(Net, ZeroConstructor, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AJunoPowerBank>>  AttachedPowerBanks;                                // 0x00E8(0x0010)(Net, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FConsumerChannelPowerInfo>      ConsumerChannelPowers;                             // 0x00F8(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AJunoPowerCenter>        CurrentPowerCenter;                                // 0x0108(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsConsumingPower;                                 // 0x0110(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_111[0xF];                                      // 0x0111(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_AttachedPowerCenters();
	void OnRep_IsConsumingPower();

	const TArray<struct FConsumerChannelPowerInfo> GetAttachedPowerConsumerInfo() const;
	float GetCurrentPowerCapacity() const;
	float GetCurrentPowerCapacityPercent() const;
	const class UFortWorldItem* GetCurrentPowerItem() const;
	float GetCurrentPowerItemDurability() const;
	float GetMaxPowerCapacity() const;
	float GetMaxPowerItemDurability() const;
	int32 GetMaxPowerItemsCount() const;
	class AJunoPowerCenter* GetPowerCenterInUse() const;
	int32 GetRemainingPowerItemsCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPowerManagerComponent">();
	}
	static class UJunoPowerManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPowerManagerComponent>();
	}
};

// Class JunoPowerSystemRuntime.JunoPowerSystemLibrary
// 0x0000 (0x0028 - 0x0028)
class UJunoPowerSystemLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPowerSystemLibrary">();
	}
	static class UJunoPowerSystemLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPowerSystemLibrary>();
	}
};

}

