#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoFrontendUI

#include "Basic.hpp"

#include "EpicMediaBasePlayer_structs.hpp"


namespace SDK::Params
{

// Function JunoFrontendUI.JunoFrontendExperienceFlow.HandleTrailerTerminalError
// 0x0001 (0x0001 - 0x0000)
struct JunoFrontendExperienceFlow_HandleTrailerTerminalError final
{
public:
	EBaseMediaTerminalErrorReason                 Reason;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoFrontendUI.JunoWorldManagementViewModel.InitWorldData
// 0x0048 (0x0048 - 0x0000)
struct JunoWorldManagementViewModel_InitWorldData final
{
public:
	TSoftObjectPtr<class UDataTable>              InSettingDataTable;                                // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              InWorldImageDataTable;                             // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoWorldDataViewModel*                ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoFrontendUI.JunoWorldManagementViewModel.StartMatchmakingInModeratorMode
// 0x0010 (0x0010 - 0x0000)
struct JunoWorldManagementViewModel_StartMatchmakingInModeratorMode final
{
public:
	class FString                                 InWorldId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoFrontendUI.JunoWorldManagementViewModel.GetIsCreateFlowSelected
// 0x0001 (0x0001 - 0x0000)
struct JunoWorldManagementViewModel_GetIsCreateFlowSelected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

