#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameMobileUI

#include "Basic.hpp"

#include "JunoGameNative_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function JunoGameMobileUI.FortMobileButtonBehaviorComponent_OffhandVisuals.HandleInventoryItemChanged
// 0x0058 (0x0058 - 0x0000)
struct FortMobileButtonBehaviorComponent_OffhandVisuals_HandleInventoryItemChanged final
{
public:
	struct FJunoItemSlot                          ItemSlot;                                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoItemChangeType                           ChangeType;                                        // 0x0050(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameMobileUI.JunoGameDynamicMobileUIDirector.BP_OnBuildingModeChanged
// 0x0018 (0x0018 - 0x0000)
struct JunoGameDynamicMobileUIDirector_BP_OnBuildingModeChanged final
{
public:
	struct FJunoEvent_BuildingModeChanged         Event;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameMobileUI.JunoGameDynamicMobileUIDirector.UpdateHUDLayoutContexts
// 0x0040 (0x0040 - 0x0000)
struct JunoGameDynamicMobileUIDirector_UpdateHUDLayoutContexts final
{
public:
	struct FGameplayTagContainer                  ContextsToAdd;                                     // 0x0000(0x0020)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ContextsToRemove;                                  // 0x0020(0x0020)(ConstParm, Parm, NativeAccessSpecifierPublic)
};

}

