#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoPowerSystemRuntime

#include "Basic.hpp"

#include "GameplayGraph_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JunoPowerSystemRuntime_structs.hpp"


namespace SDK::Params
{

// Function JunoPowerSystemRuntime.JunoPowerBank.HandleInventoryChanged
// 0x0020 (0x0020 - 0x0000)
struct JunoPowerBank_HandleInventoryChanged final
{
public:
	TArray<class UFortItem*>                      AddedItems;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UFortItem*>                      RemovedItems;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerCenter.HandleInventoryChanged
// 0x0020 (0x0020 - 0x0000)
struct JunoPowerCenter_HandleInventoryChanged final
{
public:
	TArray<class UFortItem*>                      AddedItems;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UFortItem*>                      RemovedItems;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerCenter.GetCurrentPowerCapacity
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerCenter_GetCurrentPowerCapacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerCenter.GetCurrentPowerItemGUID
// 0x0010 (0x0010 - 0x0000)
struct JunoPowerCenter_GetCurrentPowerItemGUID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerCenter.GetMaxPowerCapacity
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerCenter_GetMaxPowerCapacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerCenter.GetPowerCapacityPercent
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerCenter_GetPowerCapacityPercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerCenter.GetPowerConsumptionAmount
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerCenter_GetPowerConsumptionAmount final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerConsumerComponent.AddPowerChannel
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerConsumerComponent_AddPowerChannel final
{
public:
	struct FGameplayTag                           Channel;                                           // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerConsumerComponent.ConsumePower
// 0x0001 (0x0001 - 0x0000)
struct JunoPowerConsumerComponent_ConsumePower final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerConsumerComponent.HasPower
// 0x0001 (0x0001 - 0x0000)
struct JunoPowerConsumerComponent_HasPower final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerConsumerComponent.OnAttached
// 0x0028 (0x0028 - 0x0000)
struct JunoPowerConsumerComponent_OnAttached final
{
public:
	struct FGraphIslandHandle                     IslandHandle;                                      // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerConsumerComponent.RegisterPowerConsumer
// 0x0020 (0x0020 - 0x0000)
struct JunoPowerConsumerComponent_RegisterPowerConsumer final
{
public:
	struct FGameplayTagContainer                  Channels;                                          // 0x0000(0x0020)(ConstParm, Parm, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerConsumerComponent.RemovePowerChannel
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerConsumerComponent_RemovePowerChannel final
{
public:
	struct FGameplayTag                           Channel;                                           // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerManagerComponent.GetAttachedPowerConsumerInfo
// 0x0010 (0x0010 - 0x0000)
struct JunoPowerManagerComponent_GetAttachedPowerConsumerInfo final
{
public:
	TArray<struct FConsumerChannelPowerInfo>      ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerManagerComponent.GetCurrentPowerCapacity
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerManagerComponent_GetCurrentPowerCapacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerManagerComponent.GetCurrentPowerCapacityPercent
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerManagerComponent_GetCurrentPowerCapacityPercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerManagerComponent.GetCurrentPowerItem
// 0x0008 (0x0008 - 0x0000)
struct JunoPowerManagerComponent_GetCurrentPowerItem final
{
public:
	const class UFortWorldItem*                   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerManagerComponent.GetCurrentPowerItemDurability
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerManagerComponent_GetCurrentPowerItemDurability final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerManagerComponent.GetMaxPowerCapacity
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerManagerComponent_GetMaxPowerCapacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerManagerComponent.GetMaxPowerItemDurability
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerManagerComponent_GetMaxPowerItemDurability final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerManagerComponent.GetMaxPowerItemsCount
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerManagerComponent_GetMaxPowerItemsCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerManagerComponent.GetPowerCenterInUse
// 0x0008 (0x0008 - 0x0000)
struct JunoPowerManagerComponent_GetPowerCenterInUse final
{
public:
	class AJunoPowerCenter*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoPowerSystemRuntime.JunoPowerManagerComponent.GetRemainingPowerItemsCount
// 0x0004 (0x0004 - 0x0000)
struct JunoPowerManagerComponent_GetRemainingPowerItemsCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

