#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCoreUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "JunoCoreUI_structs.hpp"


namespace SDK::Params
{

// Function JunoCoreUI.JunoPlayerAvatarContainer.RepresentLocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerAvatarContainer_RepresentLocalPlayer final
{
public:
	class UFortPlayerAvatarViewModel*             InPlayerAvatarViewModel;                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoPlayerAvatarContainer.RepresentRemotePlayer
// 0x0038 (0x0038 - 0x0000)
struct JunoPlayerAvatarContainer_RepresentRemotePlayer final
{
public:
	struct FUniqueNetIdRepl                       UniqueID;                                          // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortPlayerAvatarViewModel*             InPlayerAvatarViewModel;                           // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoPlayerCardViewModel.OpenSidebarUserProfile
// 0x0010 (0x0010 - 0x0000)
struct JunoPlayerCardViewModel_OpenSidebarUserProfile final
{
public:
	class UCommonActivatableWidget*               CurrentStateWidget;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalPlayer*                           LocalPlayer;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoPlayerCardViewModel.ShowNotificationToast
// 0x0030 (0x0030 - 0x0000)
struct JunoPlayerCardViewModel_ShowNotificationToast final
{
public:
	const class AFortPlayerController*            FortPlayerController;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0018(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EFortNotificationType                         NotificationType;                                  // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoCoreUI.JunoPlayerManagementViewModel.UpdateFromData
// 0x0010 (0x0010 - 0x0000)
struct JunoPlayerManagementViewModel_UpdateFromData final
{
public:
	class APlayerController*                      WidgetOwner;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UJunoWorld*                       JunoWorld;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoPlayerManagementViewModel.IsInGame
// 0x0001 (0x0001 - 0x0000)
struct JunoPlayerManagementViewModel_IsInGame final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoUGCViewModel.SetTextIfValid
// 0x0018 (0x0018 - 0x0000)
struct JunoUGCViewModel_SetTextIfValid final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ValidText;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldDataViewModel.CheckWorldMatchmakingAvailability
// 0x0001 (0x0001 - 0x0000)
struct JunoWorldDataViewModel_CheckWorldMatchmakingAvailability final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldDataViewModel.GetCreationDateFormatted
// 0x0010 (0x0010 - 0x0000)
struct JunoWorldDataViewModel_GetCreationDateFormatted final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldDataViewModel.GetLastPlayedFormatted
// 0x0010 (0x0010 - 0x0000)
struct JunoWorldDataViewModel_GetLastPlayedFormatted final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldDataViewModel.GetSelectedWorldImageIndex
// 0x0004 (0x0004 - 0x0000)
struct JunoWorldDataViewModel_GetSelectedWorldImageIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldDataViewModel.GetTagNames
// 0x0010 (0x0010 - 0x0000)
struct JunoWorldDataViewModel_GetTagNames final
{
public:
	TArray<class FText>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldImageObject.UpdateImageReference
// 0x0004 (0x0004 - 0x0000)
struct JunoWorldImageObject_UpdateImageReference final
{
public:
	class FName                                   NewRowName;                                        // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldImageObject.GetImageReferenceName
// 0x0004 (0x0004 - 0x0000)
struct JunoWorldImageObject_GetImageReferenceName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldImageObject.GetTexture
// 0x0020 (0x0020 - 0x0000)
struct JunoWorldImageObject_GetTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldSettingViewModel.GetCurrentDefaultIndex
// 0x0004 (0x0004 - 0x0000)
struct JunoWorldSettingViewModel_GetCurrentDefaultIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldSettingViewModel.GetOptionDescription
// 0x0010 (0x0010 - 0x0000)
struct JunoWorldSettingViewModel_GetOptionDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldSettingViewModel.GetOptionName
// 0x0010 (0x0010 - 0x0000)
struct JunoWorldSettingViewModel_GetOptionName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoWorldSettingViewModel.IsDefaultOptionSelected
// 0x0001 (0x0001 - 0x0000)
struct JunoWorldSettingViewModel_IsDefaultOptionSelected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoDropSplitModal.HandleConfirmOperation
// 0x0008 (0x0008 - 0x0000)
struct JunoDropSplitModal_HandleConfirmOperation final
{
public:
	EJunoContextMenuAction                        InActionType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDesiredCount;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoDropSplitModal.HandleQuantityChanged
// 0x0008 (0x0008 - 0x0000)
struct JunoDropSplitModal_HandleQuantityChanged final
{
public:
	EJunoContextMenuAction                        InActionType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InUpdatedCount;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoDropSplitModal.OnOperationSet
// 0x0020 (0x0020 - 0x0000)
struct JunoDropSplitModal_OnOperationSet final
{
public:
	EJunoContextMenuAction                        ActionType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ActionText;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         StackCount;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QuantityDisplayMultiplier;                         // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoContextMenu.GetAllAvailableActions
// 0x0050 (0x0050 - 0x0000)
struct JunoContextMenu_GetAllAvailableActions final
{
public:
	TSet<EJunoContextMenuAction>                  ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoContextMenu.HandleContextEntrySelected
// 0x0001 (0x0001 - 0x0000)
struct JunoContextMenu_HandleContextEntrySelected final
{
public:
	EJunoContextMenuAction                        MenuAction;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCoreUI.JunoContextMenu.OnAddMenuEntry
// 0x0002 (0x0002 - 0x0000)
struct JunoContextMenu_OnAddMenuEntry final
{
public:
	EJunoContextMenuAction                        MenuAction;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisabled;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

