#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AssembledMeshSystem_structs.hpp"
#include "GameplayGraph_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "AtomRuntime_structs.hpp"
#include "StructUtils_structs.hpp"
#include "GeometryCollectionEngine_structs.hpp"
#include "DataflowCore_structs.hpp"
#include "NetCore_structs.hpp"
#include "MassEntity_structs.hpp"
#include "CraftingRuntime_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "JsonUtilities_structs.hpp"
#include "AIModule_structs.hpp"
#include "JunoWorldManagement_structs.hpp"
#include "FortGameplayGraph_structs.hpp"
#include "GameplayInteractionsModule_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Enum JunoGameNative.EJunoBuildingPlacementType
// NumValues: 0x0005
enum class EJunoBuildingPlacementType : uint8
{
	GuidedSnapping                           = 0,
	Connectivity                             = 1,
	SnapPlacement                            = 2,
	NoTarget                                 = 3,
	MAX                                      = 4,
};

// Enum JunoGameNative.EJunoBuildingBehaviorState
// NumValues: 0x0006
enum class EJunoBuildingBehaviorState : uint8
{
	Uninitialized                            = 0,
	Pending                                  = 1,
	Ready                                    = 2,
	Invalid                                  = 3,
	Disabled                                 = 4,
	MAX                                      = 5,
};

// Enum JunoGameNative.EJunoBiomeHabitat
// NumValues: 0x0010
enum class EJunoBiomeHabitat : uint8
{
	Unknown                                  = 0,
	POI                                      = 1,
	Cave                                     = 2,
	Stone                                    = 3,
	Asphalt                                  = 4,
	Snow                                     = 5,
	Dirt                                     = 6,
	Sand                                     = 7,
	Grass                                    = 8,
	Flowers                                  = 9,
	Heather                                  = 10,
	Moss                                     = 11,
	Ocean                                    = 12,
	Lake                                     = 13,
	River                                    = 14,
	Max                                      = 15,
};

// Enum JunoGameNative.EJunoBiome
// NumValues: 0x0009
enum class EJunoBiome : uint8
{
	Unknown                                  = 0,
	Grasslands                               = 1,
	DarkForest                               = 2,
	Desert                                   = 3,
	Tropical                                 = 4,
	Alpine                                   = 5,
	Water                                    = 6,
	Reserved                                 = 7,
	Max                                      = 8,
};

// Enum JunoGameNative.EJunoAwesomePointModificationContext
// NumValues: 0x0006
enum class EJunoAwesomePointModificationContext : uint8
{
	Cheat                                    = 0,
	Interaction                              = 1,
	ActorPlacement                           = 2,
	ActorRemoval                             = 3,
	QuestCompletion                          = 4,
	EJunoAwesomePointModificationContext_MAX = 5,
};

// Enum JunoGameNative.EJunoPawnEmotionalState
// NumValues: 0x0004
enum class EJunoPawnEmotionalState : uint8
{
	Default                                  = 0,
	Happy                                    = 1,
	Sad                                      = 2,
	MAX                                      = 3,
};

// Enum JunoGameNative.EPassiveCraftingDoneReason
// NumValues: 0x0005
enum class EPassiveCraftingDoneReason : uint8
{
	UnexpectedError                          = 0,
	PlayerStopped                            = 1,
	NoOutputSpace                            = 2,
	MissingIngredients                       = 3,
	EPassiveCraftingDoneReason_MAX           = 4,
};

// Enum JunoGameNative.EJunoCaveType
// NumValues: 0x000B
enum class EJunoCaveType : uint8
{
	Unknown                                  = 0,
	Surface                                  = 1,
	Lava                                     = 2,
	Rift                                     = 3,
	Ruins                                    = 4,
	SurfaceMines                             = 5,
	Pirate                                   = 6,
	Bear                                     = 7,
	Treasure                                 = 8,
	BossRoom                                 = 9,
	Max                                      = 10,
};

// Enum JunoGameNative.EJunoAwesomeUpgradeBuiltObjectsRequirementType
// NumValues: 0x0003
enum class EJunoAwesomeUpgradeBuiltObjectsRequirementType : uint8
{
	CraftingRowName                          = 0,
	ItemDefinitionTagQuery                   = 1,
	EJunoAwesomeUpgradeBuiltObjectsRequirementType_MAX = 2,
};

// Enum JunoGameNative.EJunoAwesomeUpgradeStepType
// NumValues: 0x0004
enum class EJunoAwesomeUpgradeStepType : uint8
{
	BuiltObjects                             = 0,
	PersistantTag                            = 1,
	WorldReaction                            = 2,
	EJunoAwesomeUpgradeStepType_MAX          = 3,
};

// Enum JunoGameNative.EJunoCompassDirection
// NumValues: 0x000A
enum class EJunoCompassDirection : uint8
{
	Unknown                                  = 0,
	North                                    = 1,
	NorthEast                                = 2,
	East                                     = 3,
	SouthEast                                = 4,
	South                                    = 5,
	SouthWest                                = 6,
	West                                     = 7,
	NorthWest                                = 8,
	Max                                      = 9,
};

// Enum JunoGameNative.EJunoTrackedActorRefreshReason
// NumValues: 0x0005
enum class EJunoTrackedActorRefreshReason : uint8
{
	LocationChanged                          = 0,
	NetRelDistanceChanged                    = 1,
	NumberOfRelevantActorsChanged            = 2,
	Unknown                                  = 3,
	EJunoTrackedActorRefreshReason_MAX       = 4,
};

// Enum JunoGameNative.EJunoRecruitmentObjectAcceptedPawnType
// NumValues: 0x0005
enum class EJunoRecruitmentObjectAcceptedPawnType : uint8
{
	None                                     = 0,
	Player                                   = 1,
	NPC                                      = 2,
	Creature                                 = 4,
	EJunoRecruitmentObjectAcceptedPawnType_MAX = 5,
};

// Enum JunoGameNative.EChaosEventSize
// NumValues: 0x0006
enum class EChaosEventSize : uint8
{
	Single                                   = 0,
	Small                                    = 1,
	Medium                                   = 2,
	Large                                    = 3,
	Default                                  = 1,
	EChaosEventSize_MAX                      = 4,
};

// Enum JunoGameNative.EJunoContactDirection
// NumValues: 0x0007
enum class EJunoContactDirection : uint8
{
	PosX                                     = 0,
	NegX                                     = 1,
	PosY                                     = 2,
	NegY                                     = 3,
	PosZ                                     = 4,
	NegZ                                     = 5,
	EJunoContactDirection_MAX                = 6,
};

// Enum JunoGameNative.EJunoDumpWorldPersistentContentsVerbosity
// NumValues: 0x0004
enum class EJunoDumpWorldPersistentContentsVerbosity : uint8
{
	Compact                                  = 0,
	Default                                  = 1,
	Verbose                                  = 2,
	EJunoDumpWorldPersistentContentsVerbosity_MAX = 3,
};

// Enum JunoGameNative.EJunoGeneratePersistenceAssetsReportCommandletAction
// NumValues: 0x0005
enum class EJunoGeneratePersistenceAssetsReportCommandletAction : uint8
{
	None                                     = 0,
	GeneratePersistenceSchema                = 1,
	GeneratePersistenceAssetsReport          = 2,
	GeneratePersistenceAssetsBackwardCompatibiliyReport = 3,
	EJunoGeneratePersistenceAssetsReportCommandletAction_MAX = 4,
};

// Enum JunoGameNative.EJunoGeometryCollectionAssemblerDurationType
// NumValues: 0x0004
enum class EJunoGeometryCollectionAssemblerDurationType : uint32
{
	Default                                  = 0,
	CalculateLayerCount                      = 1,
	SpecifyLayerCount                        = 2,
	EJunoGeometryCollectionAssemblerDurationType_MAX = 3,
};

// Enum JunoGameNative.EJunoKnowledgeState
// NumValues: 0x0004
enum class EJunoKnowledgeState : uint8
{
	Hidden                                   = 0,
	Revealed                                 = 1,
	Acquired                                 = 2,
	EJunoKnowledgeState_MAX                  = 3,
};

// Enum JunoGameNative.EJunoPersistenceAssetBackwardCompatibilityIssueType
// NumValues: 0x0005
enum class EJunoPersistenceAssetBackwardCompatibilityIssueType : uint8
{
	None                                     = 0,
	Missing                                  = 1,
	NoLongerCooked                           = 2,
	IncompatibleContents                     = 3,
	EJunoPersistenceAssetBackwardCompatibilityIssueType_MAX = 4,
};

// Enum JunoGameNative.EJunoGeneratePersistenceAssetCustomDumpMode
// NumValues: 0x0004
enum class EJunoGeneratePersistenceAssetCustomDumpMode : uint32
{
	None                                     = 0,
	InCookOnly                               = 1,
	All                                      = 2,
	EJunoGeneratePersistenceAssetCustomDumpMode_MAX = 3,
};

// Enum JunoGameNative.EJunoWorldSaveDataState
// NumValues: 0x0006
enum class EJunoWorldSaveDataState : uint8
{
	Uninitialized                            = 0,
	Loading                                  = 1,
	Loaded                                   = 2,
	CheckingIn                               = 3,
	CheckedIn                                = 4,
	EJunoWorldSaveDataState_MAX              = 5,
};

// Enum JunoGameNative.EJunoLevelSaveDataState
// NumValues: 0x0005
enum class EJunoLevelSaveDataState : uint8
{
	None                                     = 0,
	CheckedOut                               = 1,
	Applied                                  = 2,
	CheckedIn                                = 3,
	EJunoLevelSaveDataState_MAX              = 4,
};

// Enum JunoGameNative.EJunoWorldPersistenceType
// NumValues: 0x0003
enum class EJunoWorldPersistenceType : uint32
{
	Online                                   = 0,
	None                                     = 1,
	EJunoWorldPersistenceType_MAX            = 2,
};

// Enum JunoGameNative.EJunoWorldReadOnly
// NumValues: 0x0003
enum class EJunoWorldReadOnly : uint32
{
	No                                       = 0,
	Yes                                      = 1,
	EJunoWorldReadOnly_MAX                   = 2,
};

// Enum JunoGameNative.EJunoPersistenceFeatureCheckoutState
// NumValues: 0x0004
enum class EJunoPersistenceFeatureCheckoutState : uint32
{
	None                                     = 0,
	CheckedOut                               = 1,
	CheckedIn                                = 2,
	EJunoPersistenceFeatureCheckoutState_MAX = 3,
};

// Enum JunoGameNative.EJunoBuildModeType
// NumValues: 0x0005
enum class EJunoBuildModeType : uint8
{
	BuildMode                                = 0,
	GuidedBuildingMode                       = 1,
	NumOfBuildModes                          = 2,
	ActionMode                               = 3,
	EJunoBuildModeType_MAX                   = 4,
};

// Enum JunoGameNative.EJunoPersistenceReportOptions
// NumValues: 0x000F
enum class EJunoPersistenceReportOptions : uint16
{
	None                                     = 0,
	ActorTemplateDataEnabled                 = 1,
	ActorInstanceDataEnabled                 = 2,
	JunoUpdateActionDataEnabled              = 4,
	JunoDeleteActionDataEnabled              = 8,
	JunoPersistenceFeaturesDataEnabled       = 16,
	DataEnabledDefaultFlags                  = 31,
	ShowReportHeader                         = 32,
	ShowPlayspaceHeaders                     = 64,
	ShowSubreportsHeaders                    = 128,
	ShowTablesHeaders                        = 256,
	ShowIndividualItemsStats                 = 512,
	ShowAggregatedStats                      = 1024,
	ShowDefaultFlags                         = 1504,
	EJunoPersistenceReportOptions_MAX        = 1505,
};

// Enum JunoGameNative.EJunoWorldConditionAICampChecksIsAssigned
// NumValues: 0x0004
enum class EJunoWorldConditionAICampChecksIsAssigned : uint8
{
	None                                     = 0,
	Assigned                                 = 1,
	Unassigned                               = 2,
	EJunoWorldConditionAICampChecksIsAssigned_MAX = 3,
};

// Enum JunoGameNative.EJunoWorldConditionMustHaveLastUsedGatheringActor
// NumValues: 0x0004
enum class EJunoWorldConditionMustHaveLastUsedGatheringActor : uint8
{
	None                                     = 0,
	IsValid                                  = 1,
	IsNotValid                               = 2,
	EJunoWorldConditionMustHaveLastUsedGatheringActor_MAX = 3,
};

// Enum JunoGameNative.EJunoWorldConditionAssignmentState
// NumValues: 0x0005
enum class EJunoWorldConditionAssignmentState : uint8
{
	None                                     = 0,
	AssignedToUserActor                      = 1,
	Assigned                                 = 2,
	Unassigned                               = 3,
	EJunoWorldConditionAssignmentState_MAX   = 4,
};

// Enum JunoGameNative.EJunoWorldConditionPawnType
// NumValues: 0x0006
enum class EJunoWorldConditionPawnType : uint8
{
	None                                     = 0,
	Player                                   = 1,
	Villager                                 = 2,
	EnemyMinifig                             = 4,
	Creature                                 = 8,
	EJunoWorldConditionPawnType_MAX          = 9,
};

// Enum JunoGameNative.EJunoWorldConditionHasFollower
// NumValues: 0x0004
enum class EJunoWorldConditionHasFollower : uint8
{
	Unset                                    = 0,
	Zero                                     = 1,
	OneOrMore                                = 2,
	EJunoWorldConditionHasFollower_MAX       = 3,
};

// Enum JunoGameNative.EPhysicalStrainHealthMode
// NumValues: 0x0005
enum class EPhysicalStrainHealthMode : uint8
{
	Disabled                                 = 0,
	FullIntegrityPercentageMapping           = 1,
	ZeroIntegrity                            = 2,
	FullIntegrityFatigueThresholdMapping     = 3,
	EPhysicalStrainHealthMode_MAX            = 4,
};

// Enum JunoGameNative.EJunoAwesomeThresholdTestMode
// NumValues: 0x0004
enum class EJunoAwesomeThresholdTestMode : uint32
{
	LessOrEqual                              = 0,
	GreaterOrEqual                           = 1,
	Range                                    = 2,
	EJunoAwesomeThresholdTestMode_MAX        = 3,
};

// Enum JunoGameNative.EJunoAwesomePlacementConfigType
// NumValues: 0x0003
enum class EJunoAwesomePlacementConfigType : uint8
{
	ItemDefinition                           = 0,
	CraftingRowName                          = 1,
	EJunoAwesomePlacementConfigType_MAX      = 2,
};

// Enum JunoGameNative.EJunoAwesomeLevelUpgradeQueryResult
// NumValues: 0x0007
enum class EJunoAwesomeLevelUpgradeQueryResult : uint8
{
	Fail_LackingAwesomePoints                = 0,
	Fail_LackingPlayerResources              = 1,
	Fail_LackingRequiredBuiltObjectCount     = 2,
	Fail_LackingPersistentCampTags           = 3,
	Fail_LackingTriggeredWorldReactions      = 4,
	Pass                                     = 5,
	EJunoAwesomeLevelUpgradeQueryResult_MAX  = 6,
};

// Enum JunoGameNative.EJunoAwesomeConfigDeterminationType
// NumValues: 0x0003
enum class EJunoAwesomeConfigDeterminationType : uint8
{
	Biome                                    = 0,
	PoiType                                  = 1,
	EJunoAwesomeConfigDeterminationType_MAX  = 2,
};

// Enum JunoGameNative.EJunoAwesomeLevelIncrementType
// NumValues: 0x0003
enum class EJunoAwesomeLevelIncrementType : uint8
{
	LevelDelta                               = 0,
	CurrentLevel                             = 1,
	EJunoAwesomeLevelIncrementType_MAX       = 2,
};

// Enum JunoGameNative.EJunoEquipmentChangedFilterState
// NumValues: 0x0004
enum class EJunoEquipmentChangedFilterState : uint8
{
	Equipped                                 = 0,
	UnEquipped                               = 1,
	Any                                      = 2,
	EJunoEquipmentChangedFilterState_MAX     = 3,
};

// Enum JunoGameNative.EImpactOrDamage_ExecutionPin
// NumValues: 0x0004
enum class EImpactOrDamage_ExecutionPin : uint8
{
	LocalImpact                              = 0,
	LocalDamage                              = 1,
	OtherDamage                              = 2,
	EImpactOrDamage_MAX                      = 3,
};

// Enum JunoGameNative.EUpdateAnimationTimer_ExecutionPin
// NumValues: 0x0003
enum class EUpdateAnimationTimer_ExecutionPin : uint8
{
	Active                                   = 0,
	Expired                                  = 1,
	EUpdateAnimationTimer_MAX                = 2,
};

// Enum JunoGameNative.EJunoMinifigRotationMode
// NumValues: 0x0005
enum class EJunoMinifigRotationMode : uint8
{
	NoRotation                               = 0,
	ContinuousRotateToTarget                 = 1,
	CurveRotateToMovingTarget                = 2,
	CurveRotateToStaticTarget                = 3,
	EJunoMinifigRotationMode_MAX             = 4,
};

// Enum JunoGameNative.EJunoBedAssignmentProcessingState
// NumValues: 0x0003
enum class EJunoBedAssignmentProcessingState : uint8
{
	Processing                               = 0,
	Ready                                    = 1,
	EJunoBedAssignmentProcessingState_MAX    = 2,
};

// Enum JunoGameNative.EJunoResourceScale
// NumValues: 0x0007
enum class EJunoResourceScale : uint8
{
	Invalid                                  = 0,
	Small                                    = 1,
	Medium                                   = 2,
	Large                                    = 3,
	VerySmall                                = 4,
	VeryLarge                                = 5,
	EJunoResourceScale_MAX                   = 6,
};

// Enum JunoGameNative.EWorldDataAvailable
// NumValues: 0x0004
enum class EWorldDataAvailable : uint8
{
	Undefined                                = 0,
	WasLoadedFromPersistentData              = 1,
	WasInitializedFromWorldMetadata          = 2,
	EWorldDataAvailable_MAX                  = 3,
};

// Enum JunoGameNative.EJunoItemChangeType
// NumValues: 0x0006
enum class EJunoItemChangeType : uint8
{
	Added                                    = 0,
	Removed                                  = 1,
	ItemChanged                              = 2,
	SlotChanged                              = 3,
	Swapped                                  = 4,
	EJunoItemChangeType_MAX                  = 5,
};

// Enum JunoGameNative.EJunoInventoryAcquisitionResult
// NumValues: 0x0005
enum class EJunoInventoryAcquisitionResult : uint8
{
	Failure                                  = 0,
	SystemNotReady                           = 1,
	InventoryCreated                         = 2,
	InventoryRestored                        = 3,
	EJunoInventoryAcquisitionResult_MAX      = 4,
};

// Enum JunoGameNative.EJunoBuildingSnapEntryState
// NumValues: 0x0006
enum class EJunoBuildingSnapEntryState : uint8
{
	Incompatible                             = 0,
	Compatible                               = 1,
	InRangeRejected                          = 2,
	InRangeValid                             = 3,
	Connected                                = 4,
	EJunoBuildingSnapEntryState_MAX          = 5,
};

// Enum JunoGameNative.EOnPlacementAction
// NumValues: 0x0003
enum class EOnPlacementAction : uint8
{
	IgnoreOnly                               = 0,
	IgnoreAndDestroy                         = 1,
	EOnPlacementAction_MAX                   = 2,
};

// Enum JunoGameNative.EJunoGuidedBuildingState
// NumValues: 0x0005
enum class EJunoGuidedBuildingState : uint8
{
	Default                                  = 0,
	Hidden                                   = 1,
	Unfilled                                 = 2,
	Filled                                   = 3,
	EJunoGuidedBuildingState_MAX             = 4,
};

// Enum JunoGameNative.EJunoLandscapeVisualModifierType
// NumValues: 0x0003
enum class EJunoLandscapeVisualModifierType : uint8
{
	None                                     = 0,
	DirtPatch                                = 1,
	EJunoLandscapeVisualModifierType_MAX     = 2,
};

// Enum JunoGameNative.EJunoPlayspaceMigrationFlags
// NumValues: 0x0004
enum class EJunoPlayspaceMigrationFlags : uint8
{
	None                                     = 0,
	NoDistanceLimiter                        = 1,
	NoTimeLimiter                            = 2,
	EJunoPlayspaceMigrationFlags_MAX         = 3,
};

// Enum JunoGameNative.EJunoAutomaticConnectionMethod
// NumValues: 0x0004
enum class EJunoAutomaticConnectionMethod : uint8
{
	Full                                     = 0,
	Below                                    = 1,
	Custom                                   = 2,
	EJunoAutomaticConnectionMethod_MAX       = 3,
};

// Enum JunoGameNative.EJunoDeltaFileVersion
// NumValues: 0x0005
enum class EJunoDeltaFileVersion : uint8
{
	LevelDeltaCompressionMovedIntoJunoDeltaFile = 0,
	UpdateActionsForDeletedActorsFixed       = 1,
	VersionPlusOne                           = 2,
	LatestVersion                            = 1,
	EJunoDeltaFileVersion_MAX                = 3,
};

// Enum JunoGameNative.EJunoDeltaActionTypes
// NumValues: 0x0005
enum class EJunoDeltaActionTypes : uint8
{
	None                                     = 0,
	Add                                      = 1,
	Update                                   = 2,
	Delete                                   = 4,
	EJunoDeltaActionTypes_MAX                = 5,
};

// Enum JunoGameNative.EJunoQuickbarSelectionDirection
// NumValues: 0x0003
enum class EJunoQuickbarSelectionDirection : uint8
{
	Next                                     = 0,
	Prev                                     = 1,
	EJunoQuickbarSelectionDirection_MAX      = 2,
};

// Enum JunoGameNative.EJunoPawnEmotionalStateMappingTest
// NumValues: 0x0003
enum class EJunoPawnEmotionalStateMappingTest : uint32
{
	LessOrEqual                              = 0,
	GreaterOrEqual                           = 1,
	EJunoPawnEmotionalStateMappingTest_MAX   = 2,
};

// Enum JunoGameNative.EJunoActionExecutionConfig
// NumValues: 0x0004
enum class EJunoActionExecutionConfig : uint8
{
	ExecuteEveryTime                         = 0,
	ExecuteFirstTimeOnly                     = 1,
	ExecuteReloadOnly                        = 2,
	EJunoActionExecutionConfig_MAX           = 3,
};

// Enum JunoGameNative.EMeshAuditFailureReason
// NumValues: 0x000C
enum class EMeshAuditFailureReason : uint32
{
	MAFR_None                                = 0,
	MAFR_NeverStream                         = 1,
	MAFR_HighTriRatioInLODs                  = 2,
	MAFR_SimplestLODTooComplex               = 4,
	MAFR_TriDensityTooHigh                   = 8,
	MAFR_PhysicsTriDensityHigh               = 256,
	MAFR_PhysicsComplexAsSimple              = 512,
	MAFR_PhysicsMeshIsHighLOD                = 1024,
	MAFR_PhysicsSimpleShapeTooComplex        = 2048,
	MAFR_PhysicsTooDetailedForSmallObject    = 4096,
	MAFR_PhysicsCollideAll                   = 8192,
	MAFR_MAX                                 = 16144,
};

// ScriptStruct JunoGameNative.JunoEvent_QuickBuildSelectionData
// 0x0008 (0x0008 - 0x0000)
struct FJunoEvent_QuickBuildSelectionData final
{
public:
	class UJunoQuickBuildSelectionData*           QuickBuildSelectionData;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoCollisionChannelResponsePair
// 0x0002 (0x0002 - 0x0000)
struct FJunoCollisionChannelResponsePair final
{
public:
	ECollisionChannel                             Channel;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionResponse                            Response;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoBuildingPreviewParams
// 0x0018 (0x0018 - 0x0000)
struct FJunoBuildingPreviewParams final
{
public:
	TArray<struct FJunoCollisionChannelResponsePair> CollisionResponses;                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bShowFoundationPieces;                             // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetCustomDepthStencil;                            // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoBuildingFloatingResult
// 0x0010 (0x0010 - 0x0000)
struct FJunoBuildingFloatingResult final
{
public:
	TArray<TWeakObjectPtr<class UPrimitiveComponent>> SupportingComponents;                          // 0x0000(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoBuildingSupportedComponent
// 0x0018 (0x0018 - 0x0000)
struct FJunoBuildingSupportedComponent final
{
public:
	TWeakObjectPtr<class UPrimitiveComponent>     Component;                                         // 0x0000(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoBuildingFloatingResult            Result;                                            // 0x0008(0x0010)(Edit, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.SoundBreakEvent
// 0x0040 (0x0040 - 0x0000)
struct FSoundBreakEvent final
{
public:
	struct FGuid                                  UniqueID;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BreakEventNum;                                     // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulatedMass;                                   // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                      PhysMaterial;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoEvent_HideFTUEQuestTrackingMessage
// 0x0001 (0x0001 - 0x0000)
struct FJunoEvent_HideFTUEQuestTrackingMessage final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoAccountItemDefinitionOverride
// 0x0010 (0x0010 - 0x0000)
struct FJunoAccountItemDefinitionOverride final
{
public:
	class UFortAccountItemDefinition*             OverridenAccountItemDefinition;                    // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoEvent_CampAwesomePointsModified
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FJunoEvent_CampAwesomePointsModified final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoMarker
// 0x0098 (0x0098 - 0x0000)
struct FJunoMarker final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Icon;                                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideColor;                                    // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMarkerCustomization;                        // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeLeft;                                          // 0x0028(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       AttachedPlayerNetId;                               // 0x0030(0x0030)(SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  VolumeId;                                          // 0x0060(0x0010)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SettingsName;                                      // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MaterialInstanceDynamic;                           // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IconParamName;                                     // 0x0080(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ColorParamName;                                    // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    CustomizationOptionsHandle;                        // 0x0088(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct JunoGameNative.JunoVerbFilter_TemperatureUpdated
// 0x0090 (0x0130 - 0x00A0)
struct FJunoVerbFilter_TemperatureUpdated final : public FObjectiveFilter
{
public:
	struct FObjectiveSubjectTags                  PreviousTemperature;                               // 0x00A0(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FObjectiveSubjectTags                  NewTemperature;                                    // 0x00E8(0x0048)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoUserGeneratedTextEntry
// 0x0040 (0x0040 - 0x0000)
struct FJunoUserGeneratedTextEntry final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(SaveGame, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       LastUpdatePlayerId;                                // 0x0010(0x0030)(SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoUserGeneratedTextSaveData
// 0x0050 (0x0050 - 0x0000)
struct FJunoUserGeneratedTextSaveData final
{
public:
	TMap<class FName, struct FJunoUserGeneratedTextEntry> TextEntries;                               // 0x0000(0x0050)(SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoTemperatureChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct FJunoTemperatureChangedEvent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           OldTemperature;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NewTemperature;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoResourceData
// 0x0070 (0x0078 - 0x0008)
struct FJunoResourceData final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UFortWorldItemDefinition> ItemDefinition;                                   // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EJunoResourceScale, int32>               Amount;                                            // 0x0028(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoMerchantWantedItemData
// 0x0028 (0x0028 - 0x0000)
struct FJunoMerchantWantedItemData final
{
public:
	TSoftObjectPtr<class UFortItemDefinition>     WantItemDefinition;                                // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WantItemWeight;                                    // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoMerchantPricingLevel
// 0x0010 (0x0010 - 0x0000)
struct FJunoMerchantPricingLevel final
{
public:
	class UDataTable*                             BarterPricingData;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TierGroup;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfPackagesForSale;                           // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoMerchantSalesData
// 0x0030 (0x0038 - 0x0008)
struct FJunoMerchantSalesData final : public FTableRowBase
{
public:
	struct FGameplayTag                           MerchantTag;                                       // 0x0008(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InitialPricingLevel;                               // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FJunoMerchantPricingLevel>      PricingLevels;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoMerchantWantedItemData>    WantedItemDatas;                                   // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         RefreshTimeInHours;                                // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.SoundCollisionEvent
// 0x0058 (0x0058 - 0x0000)
struct FSoundCollisionEvent final
{
public:
	struct FGuid                                  UniqueID;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CollisionEventNum;                                 // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccumulatedMass;                                   // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DeltaVelocity;                                     // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                      PhysMaterial;                                      // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoInventoryGroupConfig
// 0x0060 (0x0060 - 0x0000)
struct FJunoInventoryGroupConfig final
{
public:
	struct FGameplayTag                           GroupType;                                         // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumItemRows;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NumItemColumns;                                    // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FGameplayTagContainer>     SlotTagMap;                                        // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoInventoryConfig
// 0x0018 (0x0018 - 0x0000)
struct FJunoInventoryConfig final
{
public:
	TArray<struct FJunoInventoryGroupConfig>      InventoryGroupConfigs;                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GameplayTag;                                       // 0x0010(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPersistent;                                     // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoEvent_EnterBuildModePreview
// 0x0010 (0x0010 - 0x0000)
struct FJunoEvent_EnterBuildModePreview final
{
public:
	class AFortPlayerController*                  SourceController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AJunoBuilderTool*                       BuilderTool;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoEvent_OpenInventoryMenuMessage
// 0x0008 (0x0008 - 0x0000)
struct FJunoEvent_OpenInventoryMenuMessage final
{
public:
	class AFortPlayerController*                  SourceController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoBuildingBehaviorStateContext
// 0x0040 (0x0040 - 0x0000)
struct FJunoBuildingBehaviorStateContext final
{
public:
	TWeakObjectPtr<class UPrimitiveComponent>     OverlappedPreviewComponent;                        // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoBuildingMultiOverlapResult        OverlapResult;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FJunoBuildingSupportedComponent> SupportedComponents;                              // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBlockedByAssembly;                                // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGuidedBuildMisplacement;                          // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockedByActorCount;                              // 0x003A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoPlayerCheckpoint
// 0x0038 (0x0038 - 0x0000)
struct FJunoPlayerCheckpoint final
{
public:
	struct FGuid                                  CheckpointGUID;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  CheckpointActor;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CheckpointLocation;                                // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCheckpointActor;                               // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoWorldConditionAICampChecks
// 0x0108 (0x0118 - 0x0010)
struct FJunoWorldConditionAICampChecks final : public FWorldConditionCommonBase
{
public:
	struct FWorldConditionContextDataRef          EventDataRef;                                      // 0x0010(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FWorldConditionContextDataRef          AIRef;                                             // 0x0018(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EJunoWorldConditionAICampChecksIsAssigned     MustBeAssignedToACamp;                             // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoWorldConditionAICampChecksIsAssigned     MustBeAssignedToPlayer;                            // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldConditionContextDataRef          PlayerControllerRef;                               // 0x0024(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      RoleMustMatchQuery;                                // 0x0030(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      SoftRemovedReasonsMustMatchQuery;                  // 0x0078(0x0048)(Edit, NativeAccessSpecifierPublic)
	EJunoWorldConditionMustHaveLastUsedGatheringActor MustHaveLastUsedGatheringActor;                // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      CampTagQuery;                                      // 0x00C8(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          bRequireEmptyCampTag;                              // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoEvent_ExitBuildModePreview
// 0x0010 (0x0010 - 0x0000)
struct FJunoEvent_ExitBuildModePreview final
{
public:
	class AFortPlayerController*                  SourceController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AJunoBuilderTool*                       BuilderTool;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoRecipeUnlockType
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FJunoRecipeUnlockType
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoGameNative.JunoRecipeUnlockType_BuildInstructions
// 0x0010 (0x0018 - 0x0008)
struct FJunoRecipeUnlockType_BuildInstructions final : public FJunoRecipeUnlockType
{
public:
	TArray<TSoftObjectPtr<class UJunoBuildInstructionsItemDefinition>> BuildInstructions;            // 0x0008(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.TemperatureRange
// 0x0014 (0x0014 - 0x0000)
struct FTemperatureRange final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            Range;                                             // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoTemperatureRangesChangedEvent
// 0x0018 (0x0018 - 0x0000)
struct FJunoTemperatureRangesChangedEvent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTemperatureRange>              NewTemperatureRanges;                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoAIFriendshipStateThresholds
// 0x000C (0x000C - 0x0000)
struct FJunoAIFriendshipStateThresholds final
{
public:
	struct FGameplayTag                           State;                                             // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinThreshold;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxThreshold;                                      // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoEvent_InventoryMenuOpen
// 0x0008 (0x0008 - 0x0000)
struct FJunoEvent_InventoryMenuOpen final
{
public:
	class AActor*                                 InventoryObject;                                   // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoRecipeUnlockType_KnowledgeBundle
// 0x0008 (0x0010 - 0x0008)
struct FJunoRecipeUnlockType_KnowledgeBundle final : public FJunoRecipeUnlockType
{
public:
	class UJunoKnowledgeBundle*                   KnowledgeBundle;                                   // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoWeatherLocation
// 0x0002 (0x0002 - 0x0000)
struct FJunoWeatherLocation final
{
public:
	EJunoBiome                                    Biome;                                             // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBiomeHabitat                             Habitat;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoEvent_TemperatureChanged
// 0x000C (0x000C - 0x0000)
struct FJunoEvent_TemperatureChanged final
{
public:
	struct FJunoWeatherLocation                   Location;                                          // 0x0000(0x0002)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           NewTemperature;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewFloatTemperature;                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.AwesomePerkReward
// 0x0040 (0x0040 - 0x0000)
struct FAwesomePerkReward final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0020(0x0020)(BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.AwesomeLevelRewardEntry
// 0x0038 (0x0038 - 0x0000)
struct FAwesomeLevelRewardEntry final
{
public:
	int32                                         MaxVillagerCapacity;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNPCOnlyCapacity;                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxCreatureOnlyCapacity;                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSharedAICapacity;                               // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FixedNPCCapacity;                                  // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAwesomePerkReward>             PlayerPerkRewards;                                 // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FAwesomePerkReward>             NPCPerkRewards;                                    // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoPersistenceAssetSourceControlInfo
// 0x0030 (0x0030 - 0x0000)
struct FJunoPersistenceAssetSourceControlInfo final
{
public:
	class FString                                 CurrentRevisionCheckInIdentifier;                  // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentRevisionAction;                             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentRevisionUser;                               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoPersistenceAssetBackwardCompatibilityIssue
// 0x0080 (0x0080 - 0x0000)
struct FJunoPersistenceAssetBackwardCompatibilityIssue final
{
public:
	class FString                                 PackageName;                                       // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTopLevelAssetPath                     AssetClassPath;                                    // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoPersistenceAssetBackwardCompatibilityIssueType IssueType;                                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJsonObjectWrapper                     IssueData;                                         // 0x0020(0x0020)(NativeAccessSpecifierPublic)
	class FString                                 AssetSourceControlInfoVersion;                     // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoPersistenceAssetSourceControlInfo AssetSourceControlInfo;                            // 0x0050(0x0030)(NativeAccessSpecifierPublic)
};

// ScriptStruct JunoGameNative.JunoWeatherPhase
// 0x0038 (0x0038 - 0x0000)
struct FJunoWeatherPhase final
{
public:
	struct FGameplayTag                           WeatherTypeName;                                   // 0x0000(0x0004)(BlueprintVisible, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
