#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCreature_TamingUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUILegacy_classes.hpp"
#include "JunoUI_structs.hpp"
#include "JunoUI_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "JunoCreature_TamingUI_structs.hpp"


namespace SDK
{

// Class JunoCreature_TamingUI.JunoBarnAssignmentListEntry
// 0x0010 (0x14F0 - 0x14E0)
class UJunoBarnAssignmentListEntry final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_14E0[0x8];                                     // 0x14E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoBarnAssignmentListObject*          BarnAssignmentListObject;                          // 0x14E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnBarnAssignmentObjectSet(class UJunoBarnAssignmentListObject* NewBarnAssignmentListObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBarnAssignmentListEntry">();
	}
	static class UJunoBarnAssignmentListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBarnAssignmentListEntry>();
	}
};

// Class JunoCreature_TamingUI.JunoBarnAssignmentListObject
// 0x0058 (0x0080 - 0x0028)
class UJunoBarnAssignmentListObject final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0050(0x0020)(Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_70[0x4];                                       // 0x0070(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  AnimalActor;                                       // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FGameplayTag GetDescriptorTag() const;
	class FText GetDisplayName() const;
	struct FGameplayTag GetFriendshipStateTag() const;
	float GetFriendshipValue() const;
	bool GetHasBed() const;
	TSoftObjectPtr<class UTexture2D> GetIcon() const;
	bool GetIsFollowingEntry() const;
	bool GetIsGlobalLimitReachedEntry() const;
	bool GetIsNoNearbyAnimalEntry() const;
	bool GetIsNoVillageSlot() const;
	struct FGameplayTag GetUniqueAIIdentifier() const;
	bool IsSelectable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBarnAssignmentListObject">();
	}
	static class UJunoBarnAssignmentListObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBarnAssignmentListObject>();
	}
};

// Class JunoCreature_TamingUI.JunoVillageTamingHubScreen
// 0x0110 (0x0790 - 0x0680)
class UJunoVillageTamingHubScreen final : public UJunoVillageScreenBase
{
public:
	class UScrollBox*                             ScrollBox_Ingredients;                             // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_Ingredients;                              // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>                SpacerWidgetClass;                                 // 0x0690(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UJunoVillageBuiltObjectEntry> BuiltObjectWidgetClass;                          // 0x0698(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UJunoVillagePersistentTagEntry> PersistentTagWidgetClass;                      // 0x06A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UJunoVillageWorldReactionEntry> WorldReactionWidgetClass;                      // 0x06A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Upgrade;                                    // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_RemoveVillage;                              // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        RemoveVillageModalScene;                           // 0x06C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   RemoveVillageConfirmationTitle;                    // 0x06C8(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   RemoveVillageConfirmationDescription;              // 0x06D8(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   RemoveVillageConfirmButtonText;                    // 0x06E8(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   RemoveVillageCancelButtonText;                     // 0x06F8(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    RemoveModalConfirmAction;                          // 0x0708(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    RemoveModalCancelAction;                           // 0x0718(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_EditVillage;                                // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UTexture2D>> JobToIconMap;                        // 0x0730(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class FText                                   StaticUpgradeItemDescription;                      // 0x0780(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void HandleRemoveVillageCancelled();
	void HandleRemoveVillageConfirmed();
	void UpdateVillageInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoVillageTamingHubScreen">();
	}
	static class UJunoVillageTamingHubScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVillageTamingHubScreen>();
	}
};

// Class JunoCreature_TamingUI.JunoVillageTamingLevelRewardsColumn
// 0x0260 (0x16F0 - 0x1490)
class UJunoVillageTamingLevelRewardsColumn final : public UCommonButtonBase
{
public:
	uint8                                         Pad_1490[0x8];                                     // 0x1490(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntriesList;                                       // 0x1498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FJunoVillageTamingLevelRewardsColumnInfo VillageRewardsColumnInfo;                        // 0x14A0(0x0018)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FJunoVillageUIData                     ParentVillageUIData;                               // 0x14B8(0x0230)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_16E8[0x8];                                     // 0x16E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIsExpanded(bool bIsExpanded);
	void SetVillageRewardEntryInfo(const struct FJunoVillageTamingLevelRewardsColumnInfo& InVillageTamingLevelRewardsColumnInfo, const struct FJunoVillageUIData& InParentVillageUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoVillageTamingLevelRewardsColumn">();
	}
	static class UJunoVillageTamingLevelRewardsColumn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVillageTamingLevelRewardsColumn>();
	}
};

// Class JunoCreature_TamingUI.JunoVillageTamingLevelRewardsEntry
// 0x0298 (0x0578 - 0x02E0)
class UJunoVillageTamingLevelRewardsEntry final : public UCommonUserWidget
{
public:
	struct FJunoVillageTamingLevelRewardsEntryInfo VillageRewardsEntryInfo;                          // 0x02E0(0x0068)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FJunoVillageUIData                     ParentVillageUIData;                               // 0x0348(0x0230)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	void SetExpanded(bool bInIsExpanded);
	void SetVillageRewardEntryInfo(const struct FJunoVillageTamingLevelRewardsEntryInfo& InVillageTamingLevelRewardsEntryInfo, const struct FJunoVillageUIData& InParentVillageUIData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoVillageTamingLevelRewardsEntry">();
	}
	static class UJunoVillageTamingLevelRewardsEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVillageTamingLevelRewardsEntry>();
	}
};

// Class JunoCreature_TamingUI.JunoVillageTamingLevelRewardsScreen
// 0x0030 (0x06B0 - 0x0680)
class UJunoVillageTamingLevelRewardsScreen final : public UJunoVillageScreenBase
{
public:
	class UDynamicEntryBox*                       RewardsList;                                       // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoVillageTamingLevelRewardsColumn*   LastHoveredEntry;                                  // 0x0688(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroupBase*                 ButtonGroup_AllRewards;                            // 0x0690(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Previous;                                   // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Next;                                       // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                             ScrollBox;                                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRewardsFilledOut();
	void RefreshPointsProgressBars();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoVillageTamingLevelRewardsScreen">();
	}
	static class UJunoVillageTamingLevelRewardsScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVillageTamingLevelRewardsScreen>();
	}
};

// Class JunoCreature_TamingUI.JunoVillageTamingMenuContainer
// 0x0010 (0x0440 - 0x0430)
class UJunoVillageTamingMenuContainer final : public UJunoHudMenuBase
{
public:
	class FName                                   VillagersTabName;                                  // 0x0430(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   HubTabName;                                        // 0x0434(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RewardsTabName;                                    // 0x0438(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoVillageTamingMenuContainer">();
	}
	static class UJunoVillageTamingMenuContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVillageTamingMenuContainer>();
	}
};

// Class JunoCreature_TamingUI.JunoVillageTamingVillagerEntry
// 0x0140 (0x15D0 - 0x1490)
class UJunoVillageTamingVillagerEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_1490[0x8];                                     // 0x1490(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoVillageTamingVillagerEntryInfo    VillagerInfo;                                      // 0x1498(0x0130)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C8[0x8];                                     // 0x15C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetVillagerInfo(const struct FJunoVillageTamingVillagerEntryInfo& InVillagerInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoVillageTamingVillagerEntry">();
	}
	static class UJunoVillageTamingVillagerEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVillageTamingVillagerEntry>();
	}
};

// Class JunoCreature_TamingUI.JunoBarnAssignmentMenuContainer
// 0x0028 (0x0420 - 0x03F8)
class UJunoBarnAssignmentMenuContainer final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoBarnAssignmentScreen*              BarnAssignmentScreen;                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoBarnNameAnimalScreen*              BarnNameAnimalScreen;                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonActivatableWidgetSwitcher*       WidgetSwitcher_Screens;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoBarnAssignmentMenuInitData*        JunoBarnAssignmentMenuInitData;                    // 0x0418(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBarnAssignmentMenuContainer">();
	}
	static class UJunoBarnAssignmentMenuContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBarnAssignmentMenuContainer>();
	}
};

// Class JunoCreature_TamingUI.JunoBarnAssignmentScreen
// 0x00D0 (0x04C8 - 0x03F8)
class UJunoBarnAssignmentScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x38];                                     // 0x03F8(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      BackButton;                                        // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      CloseButton;                                       // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonListView*                        List_Characters;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoBarnAssignmentListObject*          ThisBedListObject;                                 // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 BarnObject;                                        // 0x0450(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoCampRecruitmentComponent*          JunoCampRecruitmentComponent;                      // 0x0458(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoCampAIManagementComponent*         JunoCampAIManagementComponent;                     // 0x0460(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Assign;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   AssignedHeaderText;                                // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   NoBarnHeaderText;                                  // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   NearbyAnimalsHeaderText;                           // 0x0490(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   AssignButtonText;                                  // 0x04A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   ReassignButtonText;                                // 0x04B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>                ListHeaderClass;                                   // 0x04C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnSelectionChanged(const class UJunoBarnAssignmentListObject* InSelectedListObject);

	bool GetGlobalHasSlotForAnimal() const;
	bool GetVillageHasSlotForAnimal() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBarnAssignmentScreen">();
	}
	static class UJunoBarnAssignmentScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBarnAssignmentScreen>();
	}
};

// Class JunoCreature_TamingUI.JunoBarnNameAnimalScreen
// 0x0090 (0x0488 - 0x03F8)
class UJunoBarnNameAnimalScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x38];                                     // 0x03F8(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 BarnObject;                                        // 0x0430(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoBarnAssignmentMenuInitData*        JunoBarnAssignmentMenuInitData;                    // 0x0438(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_RandomName;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      BackButton;                                        // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      CloseButton;                                       // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Assign;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEditableTextBox*                       Debug_EditableTextBox;                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_468[0x10];                                     // 0x0468(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AllAnimalNamesGameplayTag;                         // 0x0478(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AnimalNameRegistryName;                            // 0x047C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_480[0x8];                                      // 0x0480(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBarnNameAnimalScreen">();
	}
	static class UJunoBarnNameAnimalScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBarnNameAnimalScreen>();
	}
};

// Class JunoCreature_TamingUI.JunoBarnProcessorScreen
// 0x0008 (0x0558 - 0x0550)
class UJunoBarnProcessorScreen final : public UJunoDisassemblingScreen
{
public:
	class UJunoCampRecruitmentComponent*          JunoCampRecruitmentComponent;                      // 0x0550(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetupAnimalInfo(const struct FActiveCampCreatureEntry& Data);
	void ShowLoadingState();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBarnProcessorScreen">();
	}
	static class UJunoBarnProcessorScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBarnProcessorScreen>();
	}
};

// Class JunoCreature_TamingUI.JunoTamingMapMarkerIconScreen
// 0x0068 (0x0460 - 0x03F8)
class UJunoTamingMapMarkerIconScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UJunoMapMarkerCustomizationEntry> EntryClass;                                  // 0x0400(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ColorParamName;                                    // 0x0408(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       ColorPanel;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       IconPanel;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                 ButtonGroup_AllIconSlots;                          // 0x0420(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                 ButtonGroup_AllColorSlots;                         // 0x0428(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_PreviewMarker;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoMapMarkerCustomizationEntry*       SelectedColor;                                     // 0x0438(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoMapMarkerCustomizationEntry*       SelectedIcon;                                      // 0x0440(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoMapMarkerCustomizationInitData*    InitData;                                          // 0x0448(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CampRow;                                           // 0x0450(0x0010)(NoDestructor, NativeAccessSpecifierPrivate)

public:
	void SetMarkerNameText(bool bIsTown, const class FText& Name_0);
	void SetPreviewMarkerMaterial(bool bIsTown);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoTamingMapMarkerIconScreen">();
	}
	static class UJunoTamingMapMarkerIconScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoTamingMapMarkerIconScreen>();
	}
};

// Class JunoCreature_TamingUI.JunoTamingMapMarkerMenuContainer
// 0x0060 (0x0458 - 0x03F8)
class UJunoTamingMapMarkerMenuContainer final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Next;                                       // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Confirm;                                    // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Close;                                      // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoMapMarkerCustomizationInitData*    InitData;                                          // 0x0418(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   NameScreenTabName;                                 // 0x0420(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   IconScreenTabName;                                 // 0x0424(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTabListWidgetBase*                 TabList_MenuTabs;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidgetSwitcher*       Switcher_Tabs;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CampRow;                                           // 0x0440(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_450[0x8];                                      // 0x0450(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleTabSelected(class FName SelectedTabId);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoTamingMapMarkerMenuContainer">();
	}
	static class UJunoTamingMapMarkerMenuContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoTamingMapMarkerMenuContainer>();
	}
};

// Class JunoCreature_TamingUI.JunoTamingMapMarkerNameScreen
// 0x0038 (0x0430 - 0x03F8)
class UJunoTamingMapMarkerNameScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      RandomizeButton;                                   // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoMapMarkerCustomizationInitData*    InitData;                                          // 0x0408(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_410[0x18];                                     // 0x0410(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditableTextBox*                       Debug_EditableTextBox;                             // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetMarkerNameText(const class FText& Name_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoTamingMapMarkerNameScreen">();
	}
	static class UJunoTamingMapMarkerNameScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoTamingMapMarkerNameScreen>();
	}
};

// Class JunoCreature_TamingUI.JunoVillageTamingVillagersScreen
// 0x0098 (0x0718 - 0x0680)
class UJunoVillageTamingVillagersScreen final : public UJunoVillageScreenBase
{
public:
	class UDynamicEntryBox*                       VillageInhabitantsList;                            // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_AskToLeave;                                 // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ChangeName;                                 // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroupBase*                 ButtonGroup_AllVillagers;                          // 0x0698(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoVillageTamingVillagerEntry*        LastHoveredEntry;                                  // 0x06A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        AskToLeaveModalScene;                              // 0x06A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   AskToLeaveConfirmationTitle;                       // 0x06B0(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   AskToLeaveConfirmationDescription;                 // 0x06C0(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   AskToLeaveConfirmButtonText;                       // 0x06D0(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   AskToLeaveCancelButtonText;                        // 0x06E0(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ModalConfirmAction;                                // 0x06F0(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ModalCancelAction;                                 // 0x0700(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         OsirisVillagerSlotCount;                           // 0x0710(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleAskToLeaveCancelled();
	void HandleAskToLeaveConfirmed();
	void OnEntryHovered(class UJunoVillageTamingVillagerEntry* Entry);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoVillageTamingVillagersScreen">();
	}
	static class UJunoVillageTamingVillagersScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVillageTamingVillagersScreen>();
	}
};

}

