#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCreature_TamingRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteAI_structs.hpp"


namespace SDK::Params
{

// Function JunoCreature_TamingRuntime.JunoControllerComponent_Taming.OnConvertFollowingAnimal
// 0x0008 (0x0008 - 0x0000)
struct JunoControllerComponent_Taming_OnConvertFollowingAnimal final
{
public:
	class AFortPawn*                              ConvertedPawn;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingRuntime.JunoControllerComponent_Taming.OnUnconvertFollowingAnimal
// 0x0010 (0x0010 - 0x0000)
struct JunoControllerComponent_Taming_OnUnconvertFollowingAnimal final
{
public:
	class AFortPawn*                              UnconvertedPawn;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnconvertReason                              UnconvertReason;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoCreature_TamingRuntime.JunoControllerComponent_Taming.Server_AssignAnimalToBarn
// 0x0028 (0x0028 - 0x0000)
struct JunoControllerComponent_Taming_Server_AssignAnimalToBarn final
{
public:
	const class AFortPlayerController*            TriggeringPlayer;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 BarnActor;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 AnimalActor;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CustomName;                                        // 0x0018(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingRuntime.JunoControllerComponent_Taming.Server_ReassignAnimalToBarn
// 0x0028 (0x0028 - 0x0000)
struct JunoControllerComponent_Taming_Server_ReassignAnimalToBarn final
{
public:
	const class AFortPlayerController*            TriggeringPlayer;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 BarnActor;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           UniqueAIIdentifier;                                // 0x0010(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ExistingName;                                      // 0x0018(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoCreature_TamingRuntime.JunoControllerComponent_Taming.Server_RenameAnimal
// 0x0020 (0x0020 - 0x0000)
struct JunoControllerComponent_Taming_Server_RenameAnimal final
{
public:
	const class AFortPlayerController*            TriggeringPlayer;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           UniqueAIIdentifier;                                // 0x0008(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewName;                                           // 0x0010(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

}

