#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoAIRuntime

#include "Basic.hpp"

#include "FortniteAI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "JunoAIRuntime_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function JunoAIRuntime.JunoAIFriendshipPawnComponent.DisableFriendshipChanges
// 0x0001 (0x0001 - 0x0000)
struct JunoAIFriendshipPawnComponent_DisableFriendshipChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoAIFriendshipPawnComponent.EnableFriendshipChanges
// 0x0001 (0x0001 - 0x0000)
struct JunoAIFriendshipPawnComponent_EnableFriendshipChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoAIFriendshipPawnComponent.HandleConverted
// 0x0010 (0x0010 - 0x0000)
struct JunoAIFriendshipPawnComponent_HandleConverted final
{
public:
	const class AFortPawn*                        InstigatorPawn;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPawn*                        ConvertedPawn;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoAIFriendshipPawnComponent.HandleUnconverted
// 0x0010 (0x0010 - 0x0000)
struct JunoAIFriendshipPawnComponent_HandleUnconverted final
{
public:
	const class AFortPawn*                        UnconvertedPawn;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnconvertReason                              UnconvertReason;                                   // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoAIRuntime.JunoAIFriendshipPawnComponent.AreFriendshipChangesEnabled
// 0x0001 (0x0001 - 0x0000)
struct JunoAIFriendshipPawnComponent_AreFriendshipChangesEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoAIFriendshipPawnComponent.GetFriendshipState
// 0x0004 (0x0004 - 0x0000)
struct JunoAIFriendshipPawnComponent_GetFriendshipState final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoAIFriendshipPawnComponent.GetFriendshipValue
// 0x0004 (0x0004 - 0x0000)
struct JunoAIFriendshipPawnComponent_GetFriendshipValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCampAIManagementComponent.HandleAIControllerChanged
// 0x0018 (0x0018 - 0x0000)
struct JunoCampAIManagementComponent_HandleAIControllerChanged final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            OldController;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            NewController;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCampAIManagementComponent.HandleAIControllerFullySpawned
// 0x0010 (0x0010 - 0x0000)
struct JunoCampAIManagementComponent_HandleAIControllerFullySpawned final
{
public:
	const class AAIController*                    Controller;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPawn*                        Pawn;                                              // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCampAIManagementComponent.HandleAIDespawned
// 0x0010 (0x0010 - 0x0000)
struct JunoCampAIManagementComponent_HandleAIDespawned final
{
public:
	const class AActor*                           DespawnedAIPawn;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortAthenaLivingWorldEventData*  EventData;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCampAIManagementComponent.HandleAISpawned
// 0x0010 (0x0010 - 0x0000)
struct JunoCampAIManagementComponent_HandleAISpawned final
{
public:
	const class AActor*                           SpawnedAIPawn;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortAthenaLivingWorldEventData*  EventData;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCampAIManagementComponent.HandleAwesomeLevelChanged
// 0x0018 (0x0018 - 0x0000)
struct JunoCampAIManagementComponent_HandleAwesomeLevelChanged final
{
public:
	struct FJunoAwesomeLevelChangeData            ChangeData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCampAIManagementComponent.HandleAwesomeLevelReady
// 0x0014 (0x0014 - 0x0000)
struct JunoCampAIManagementComponent_HandleAwesomeLevelReady final
{
public:
	struct FJunoCampAwesomeStatsData              AwesomeData;                                       // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCampAIManagementComponent.RequestCreatureTemporaryDespawn
// 0x0008 (0x0008 - 0x0000)
struct JunoCampAIManagementComponent_RequestCreatureTemporaryDespawn final
{
public:
	struct FGameplayTag                           UniqueAIIdentifier;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoAIRuntime.JunoCampAIManagementComponent.GetCachedAndReplicatedRecruitmentData
// 0x0028 (0x0028 - 0x0000)
struct JunoCampAIManagementComponent_GetCachedAndReplicatedRecruitmentData final
{
public:
	struct FJunoCampAICachedRecruitmentData       ReturnValue;                                       // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCampAIManagementComponent.GetSpawnedAIFromUniqueAIIdentifier
// 0x0010 (0x0010 - 0x0000)
struct JunoCampAIManagementComponent_GetSpawnedAIFromUniqueAIIdentifier final
{
public:
	struct FGameplayTag                           UniqueAIIdentifier;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCreaturePawnComponent.AssignNewCustomName
// 0x0018 (0x0018 - 0x0000)
struct JunoCreaturePawnComponent_AssignNewCustomName final
{
public:
	class FText                                   NewCustomName;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoAIRuntime.JunoCreaturePawnComponent.HandleConverted
// 0x0010 (0x0010 - 0x0000)
struct JunoCreaturePawnComponent_HandleConverted final
{
public:
	const class AFortPawn*                        InstigatorPawn;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPawn*                        ConvertedPawn;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCreaturePawnComponent.HandleDied
// 0x0060 (0x0060 - 0x0000)
struct JunoCreaturePawnComponent_HandleDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCreaturePawnComponent.HandleUnconverted
// 0x0010 (0x0010 - 0x0000)
struct JunoCreaturePawnComponent_HandleUnconverted final
{
public:
	const class AFortPawn*                        UnconvertedPawn;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnconvertReason                              UnconvertReason;                                   // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoAIRuntime.JunoCreaturePawnComponent.NotifyFeeding
// 0x0010 (0x0010 - 0x0000)
struct JunoCreaturePawnComponent_NotifyFeeding final
{
public:
	const class AFortPawn*                        Instigator;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortItemDefinition*              ItemBeingFed;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCreaturePawnComponent.NotifyPetting
// 0x0008 (0x0008 - 0x0000)
struct JunoCreaturePawnComponent_NotifyPetting final
{
public:
	const class AFortPawn*                        Instigator;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCreaturePawnComponent.RecruitToCampIfPossible
// 0x0020 (0x0020 - 0x0000)
struct JunoCreaturePawnComponent_RecruitToCampIfPossible final
{
public:
	struct FJunoCreatureRecruitmentRequestData    RecruitmentRequestData;                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoAIRuntime.JunoCreaturePawnComponent.GetAssignedAndSpawnedRecruitmentObject
// 0x0008 (0x0008 - 0x0000)
struct JunoCreaturePawnComponent_GetAssignedAndSpawnedRecruitmentObject final
{
public:
	class UJunoCampRecruitmentObjectComponent*    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCreaturePawnComponent.GetAssignedRecruitmentObjectId
// 0x0010 (0x0010 - 0x0000)
struct JunoCreaturePawnComponent_GetAssignedRecruitmentObjectId final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoCreaturePawnComponent.GetCustomName
// 0x0010 (0x0010 - 0x0000)
struct JunoCreaturePawnComponent_GetCustomName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoNPCPawnComponent.ConvertAIRoleToDisplayText
// 0x0018 (0x0018 - 0x0000)
struct JunoNPCPawnComponent_ConvertAIRoleToDisplayText final
{
public:
	struct FGameplayTag                           AIRole;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoNPCPawnComponent.GetAIRole
// 0x0004 (0x0004 - 0x0000)
struct JunoNPCPawnComponent_GetAIRole final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoNPCPawnComponent.GetAIRoleDisplayText
// 0x0010 (0x0010 - 0x0000)
struct JunoNPCPawnComponent_GetAIRoleDisplayText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoNPCPawnComponent.GetSoftRemovedReasons
// 0x0020 (0x0020 - 0x0000)
struct JunoNPCPawnComponent_GetSoftRemovedReasons final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.PlayspaceComponent_Root_JunoAIManagement.HandleFTUENPCSpawned
// 0x0010 (0x0010 - 0x0000)
struct PlayspaceComponent_Root_JunoAIManagement_HandleFTUENPCSpawned final
{
public:
	const class AActor*                           FTUENPC;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortAthenaLivingWorldEventData*  EventData;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoAISafetyBubbleComponent.OnTimeOfDayPhaseChanged
// 0x0003 (0x0003 - 0x0000)
struct JunoAISafetyBubbleComponent_OnTimeOfDayPhaseChanged final
{
public:
	EFortDayPhase                                 CurrentDayPhase;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortDayPhase                                 PreviousDayPhase;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAtCreation;                                       // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoAICheatManager.JunoEnableFriendlyCreatures
// 0x0001 (0x0001 - 0x0000)
struct JunoAICheatManager_JunoEnableFriendlyCreatures final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoAICheatManager.JunoEnableFriendlyNPCs
// 0x0001 (0x0001 - 0x0000)
struct JunoAICheatManager_JunoEnableFriendlyNPCs final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoAICheatManager.JunoEnableHostileCreatures
// 0x0001 (0x0001 - 0x0000)
struct JunoAICheatManager_JunoEnableHostileCreatures final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoAIRuntime.JunoAICheatManager.JunoEnableRecruitedCreaturePermaDeath
// 0x0001 (0x0001 - 0x0000)
struct JunoAICheatManager_JunoEnableRecruitedCreaturePermaDeath final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

