#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayGraph_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "JunoGameNative_structs.hpp"
#include "FortniteAI_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "EnergyRuntime_classes.hpp"
#include "MeshNetwork_classes.hpp"
#include "TacticalSprintRuntime_classes.hpp"
#include "WorldConditions_classes.hpp"
#include "JunoWorldManagement_structs.hpp"
#include "GameplayEventRouter_structs.hpp"
#include "FortGameplayGraph_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "SoundLibrary_classes.hpp"
#include "GameplayStateMachine_classes.hpp"
#include "CraftingRuntime_classes.hpp"
#include "FortImGuiCore_classes.hpp"
#include "DeltaFileSystem_structs.hpp"
#include "SpatialMetricsCore_classes.hpp"


namespace SDK
{

// Class JunoGameNative.FortAutomationRpcManager_Juno
// 0x0050 (0x00B8 - 0x0068)
class UFortAutomationRpcManager_Juno final : public UFortAutomationRpcManager
{
public:
	uint8                                         Pad_68[0x50];                                      // 0x0068(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAutomationRpcManager_Juno">();
	}
	static class UFortAutomationRpcManager_Juno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAutomationRpcManager_Juno>();
	}
};

// Class JunoGameNative.JunoPlayerPersistenceComponent
// 0x0070 (0x0168 - 0x00F8)
class UJunoPlayerPersistenceComponent final : public UFortPlayspaceComponent
{
public:
	uint8                                         Pad_F8[0x70];                                      // 0x00F8(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAnyPlayerLoggedIn(class APlayerController* PlayerController);
	void OnControllerBeginDestroy(class AFortPlayerControllerAthena* FortPCAthena);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayerPersistenceComponent">();
	}
	static class UJunoPlayerPersistenceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPlayerPersistenceComponent>();
	}
};

// Class JunoGameNative.FortQueryGenerator_PointsOutsideVolume
// 0x0078 (0x0100 - 0x0088)
class UFortQueryGenerator_PointsOutsideVolume final : public UEnvQueryGenerator_ProjectedPoints
{
public:
	struct FAIDataProviderFloatValue              SpaceBetween;                                      // 0x0088(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FAIDataProviderFloatValue              NumberOfRingsAroundVolume;                         // 0x00C0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UEnvQueryContext>           GenerateInVolume;                                  // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQueryGenerator_PointsOutsideVolume">();
	}
	static class UFortQueryGenerator_PointsOutsideVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryGenerator_PointsOutsideVolume>();
	}
};

// Class JunoGameNative.JunoBuildingTrackedActorInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoBuildingTrackedActorInterface final
{
public:
	float GetNetRelevanceDistanceOverride() const;
	int32 GetNumberOfRelevantActors() const;
	bool ShouldBeTrackedByMetrics() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingTrackedActorInterface">();
	}
	static class IJunoBuildingTrackedActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoBuildingTrackedActorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class JunoGameNative.JunoBuildingGameplayActor
// 0x0250 (0x0BD0 - 0x0980)
class AJunoBuildingGameplayActor : public ABuildingGameplayActor
{
public:
	uint8                                         Pad_980[0x88];                                     // 0x0980(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoGeometryCollectionAssemblerComponent* GeometryCollectionAssemblerComponent;           // 0x0A08(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                GridSizeOverride;                                  // 0x0A10(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A28[0x8];                                      // 0x0A28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BuildingPivotOffset;                               // 0x0A30(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                BuildingGridSnapOffset;                            // 0x0A90(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FJunoBuildingBehaviorGridLimits        GridOffsetLimits;                                  // 0x0AA8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FJunoBuilderToolInteractionActorClassSet OverlappableClasses;                             // 0x0AB8(0x00A0)(Edit, NativeAccessSpecifierPrivate)
	class UItemDefinitionBase*                    AssociatedItem;                                    // 0x0B58(0x0008)(Edit, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UJunoBuildingPreviewComponent>> PreviewComponentTemplates;   // 0x0B60(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bShouldPersist;                                    // 0x0BB0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BB1[0x1F];                                     // 0x0BB1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool BlueprintCanDropResourceOnDeath();
	bool BlueprintCanDropResourceWithTagOnDeath(const struct FGameplayTag& ResourceTag);
	void SetAssociatedItem(const class UItemDefinitionBase* Item);

	bool BlueprintCanDropItemOnDestroy() const;
	const class UItemDefinitionBase* GetAssociatedItem() const;
	bool HasBeenMigrated() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingGameplayActor">();
	}
	static class AJunoBuildingGameplayActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoBuildingGameplayActor>();
	}
};

// Class JunoGameNative.JunoPhysicsToyActor
// 0x0000 (0x0BD0 - 0x0BD0)
class AJunoPhysicsToyActor final : public AJunoBuildingGameplayActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPhysicsToyActor">();
	}
	static class AJunoPhysicsToyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPhysicsToyActor>();
	}
};

// Class JunoGameNative.JunoAbility_PlayerPushPhysicsObject
// 0x0130 (0x0C70 - 0x0B40)
class UJunoAbility_PlayerPushPhysicsObject final : public UFortGameplayAbility
{
public:
	EFortPhysicsSimSize                           MaxPhysicsObjectSizeToPush;                        // 0x0B40(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortPhysicsSimSize                           MinPhysicsObjectSizeToPush;                        // 0x0B41(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B42[0x6];                                      // 0x0B42(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  NoTagsPusher;                                      // 0x0B48(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  NoTagsPushedObject;                                // 0x0B68(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           DefaultPushMontage;                                // 0x0B88(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FPushMontageData>               SpecializedPushMontages;                           // 0x0B90(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      EnergyComponentQuery;                              // 0x0BA0(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EnergyInitialCost;                                 // 0x0BE8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EnergyDrainPerSecond;                              // 0x0C10(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bEnergyExhausted;                                  // 0x0C38(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C39[0x3];                                      // 0x0C39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UFortComponent_Energy>   CachedEnergyComponent;                             // 0x0C3C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C44[0xC];                                      // 0x0C44(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  TrackedObjectToPush;                               // 0x0C50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortPhysicsSimSize                           TrackedObjectSimSize;                              // 0x0C58(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C59[0x17];                                     // 0x0C59(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelPushingPhysicsObject();
	void OnEnergyDrained(class UFortComponent_Energy* EnergyComponentDrained);
	void OnEnergyFullyRecharged(class UFortComponent_Energy* EnergyComponentRecharged);
	void OnPlayerHit(class AActor* HitPlayer, class AActor* HitActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void PotentiallyStartUsingEnergy();
	void StopUsingEnergy();

	class UAnimMontage* GetMontageToPlay() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAbility_PlayerPushPhysicsObject">();
	}
	static class UJunoAbility_PlayerPushPhysicsObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAbility_PlayerPushPhysicsObject>();
	}
};

// Class JunoGameNative.JunoAccountItemDefinitionOverrideManager
// 0x01B8 (0x01E0 - 0x0028)
class UJunoAccountItemDefinitionOverrideManager final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHeroType*                          JunoHeroDefinition;                                // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             DefaultCharacters;                                 // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, TSoftClassPtr<class UClass>> PreviewActorClasses;              // 0x0040(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, struct FGameplayTagContainer> GameplayTagParentsToRemoveFromOverrides; // 0x0090(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<TSoftClassPtr<class UClass>, struct FGameplayTagContainer> GameplayTagsToAdd;               // 0x00E0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSet<class FString>                           CosmeticsProhibitedByHotfix;                       // 0x0130(0x0050)(Config, Protected, NativeAccessSpecifierProtected)
	TMap<struct FPrimaryAssetId, struct FJunoAccountItemDefinitionOverride> Overrides;               // 0x0180(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D0[0x10];                                     // 0x01D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAccountItemDefinitionOverrideManager">();
	}
	static class UJunoAccountItemDefinitionOverrideManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAccountItemDefinitionOverrideManager>();
	}
};

// Class JunoGameNative.JunoBasePFWPersistenceFeatureData
// 0x0018 (0x0040 - 0x0028)
class UJunoBasePFWPersistenceFeatureData : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDirty;                                            // 0x0038(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPersistentDataModified();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBasePFWPersistenceFeatureData">();
	}
	static class UJunoBasePFWPersistenceFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBasePFWPersistenceFeatureData>();
	}
};

// Class JunoGameNative.JunoAIPersistenceFeatureData
// 0x01E0 (0x0220 - 0x0040)
class UJunoAIPersistenceFeatureData final : public UJunoBasePFWPersistenceFeatureData
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSavedAIDataManager                    SavedAIData;                                       // 0x0050(0x01D0)(SaveGame, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureData">();
	}
	static class UJunoAIPersistenceFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIPersistenceFeatureData>();
	}
};

// Class JunoGameNative.JunoAccountItemOverrideDefinition
// 0x0088 (0x00B8 - 0x0030)
class UJunoAccountItemOverrideDefinition : public UPrimaryDataAsset
{
public:
	struct FGameplayTagContainer                  GameplayTagsToAdd;                                 // 0x0030(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortCosmeticVariant*>           ItemVariantsOverride;                              // 0x0050(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bOverrideFrontendTransform;                        // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrontendPreviewScale;                              // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                FrontendPreviewPivotOffset;                        // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               FrontendPreviewInitialRotation;                    // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   PreviewActorClass;                                 // 0x0098(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAccountItemOverrideDefinition">();
	}
	static class UJunoAccountItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAccountItemOverrideDefinition>();
	}
};

// Class JunoGameNative.JunoAthenaCharacterItemOverrideDefinition
// 0x0090 (0x0148 - 0x00B8)
class UJunoAthenaCharacterItemOverrideDefinition final : public UJunoAccountItemOverrideDefinition
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAthenaCharacterItemDefinition> BaseAthenaCharacterItemDefinition;          // 0x00C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAssembledMeshSchema>    AssembledMeshSchema;                               // 0x00E0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAssembledMeshSchema>    LowDetailsAssembledMeshSchema;                     // 0x0100(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontendAnimMontageIdleOverride;                   // 0x0120(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PreviewPawnScale;                                  // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBaseAthenaCharacterItemDefinition(TSoftObjectPtr<class UAthenaCharacterItemDefinition> InBaseAthenaCharacterItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAthenaCharacterItemOverrideDefinition">();
	}
	static class UJunoAthenaCharacterItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAthenaCharacterItemOverrideDefinition>();
	}
};

// Class JunoGameNative.JunoBasePFWContainer
// 0x00A0 (0x01E0 - 0x0140)
class UJunoBasePFWContainer : public UPersistenceFrameworkContainer
{
public:
	uint8                                         Pad_140[0xA0];                                     // 0x0140(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBasePFWContainer">();
	}
	static class UJunoBasePFWContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBasePFWContainer>();
	}
};

// Class JunoGameNative.JunoBasePFWPersistenceFeatureDataContainer
// 0x0000 (0x01E0 - 0x01E0)
class UJunoBasePFWPersistenceFeatureDataContainer : public UJunoBasePFWContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBasePFWPersistenceFeatureDataContainer">();
	}
	static class UJunoBasePFWPersistenceFeatureDataContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBasePFWPersistenceFeatureDataContainer>();
	}
};

// Class JunoGameNative.JunoPhysicsToyPersistenceFeatureData_Container
// 0x0000 (0x01E0 - 0x01E0)
class UJunoPhysicsToyPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPhysicsToyPersistenceFeatureData_Container">();
	}
	static class UJunoPhysicsToyPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPhysicsToyPersistenceFeatureData_Container>();
	}
};

// Class JunoGameNative.JunoAthenaDanceItemOverrideDefinition
// 0x0118 (0x01D0 - 0x00B8)
class UJunoAthenaDanceItemOverrideDefinition final : public UJunoAccountItemOverrideDefinition
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAthenaDanceItemDefinition> BaseAthenaDanceItemDefinition;                  // 0x00C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            Animation;                                         // 0x00E0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            AnimationFemaleOverride;                           // 0x0100(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmoteMapping>              AnimationOverrides;                                // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverridePlayRandomSectionByName;                  // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSectionNameAndWeight>          PlayRandomSectionByName;                           // 0x0138(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontEndAnimation;                                 // 0x0148(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimMontage>            FrontEndAnimationFemaleOverride;                   // 0x0168(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortEmoteMapping>              FrontEndAnimationOverrides;                        // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverridePreviewDuration;                          // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviewLoops;                                      // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PreviewLength;                                     // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GroupEmotePositionOffset;                          // 0x01A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GroupEmotePositionOffsetTolerance;                 // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GroupEmoteFollowDistance;                          // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WalkForwardSpeed;                                  // 0x01C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBaseAthenaDanceItemDefinition(TSoftObjectPtr<class UAthenaDanceItemDefinition> InBaseAthenaDanceItemDefinition);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAthenaDanceItemOverrideDefinition">();
	}
	static class UJunoAthenaDanceItemOverrideDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAthenaDanceItemOverrideDefinition>();
	}
};

// Class JunoGameNative.JunoActionConfig
// 0x0010 (0x0038 - 0x0028)
class UJunoActionConfig : public UObject
{
public:
	TSubclassOf<class UJunoAction>                JunoActionClass;                                   // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EJunoActionExecutionConfig                    JunoActionExecutionConfig;                         // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActionConfig">();
	}
	static class UJunoActionConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActionConfig>();
	}
};

// Class JunoGameNative.JunoActionConfig_StaticMesh
// 0x0008 (0x0040 - 0x0038)
class UJunoActionConfig_StaticMesh final : public UJunoActionConfig
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActionConfig_StaticMesh">();
	}
	static class UJunoActionConfig_StaticMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActionConfig_StaticMesh>();
	}
};

// Class JunoGameNative.JunoActorAttributeOverrideComponent
// 0x0018 (0x00B8 - 0x00A0)
class UJunoActorAttributeOverrideComponent final : public UFortBuildingActorTagComponent
{
public:
	struct FDataRegistryType                      AttributeOverrideDataRegistry;                     // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryId                        DataRegistryItemId;                                // 0x00A4(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0xC];                                       // 0x00AC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetPrimaryLootTier();
	class FName GetSecondaryLootTier();
	void SetupHealthAttributeSet();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActorAttributeOverrideComponent">();
	}
	static class UJunoActorAttributeOverrideComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorAttributeOverrideComponent>();
	}
};

// Class JunoGameNative.JunoBuildingActorCountMetric
// 0x0008 (0x0030 - 0x0028)
class UJunoBuildingActorCountMetric final : public UObject
{
public:
	class UDataTable*                             BuildLimitPools;                                   // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingActorCountMetric">();
	}
	static class UJunoBuildingActorCountMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingActorCountMetric>();
	}
};

// Class JunoGameNative.JunoActorInstancesReportHandler
// 0x0028 (0x0050 - 0x0028)
class UJunoActorInstancesReportHandler final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActorInstancesReportHandler">();
	}
	static class UJunoActorInstancesReportHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActorInstancesReportHandler>();
	}
};

// Class JunoGameNative.JunoPersistenceFeatureDataActor
// 0x0040 (0x02D0 - 0x0290)
class AJunoPersistenceFeatureDataActor : public AInfo
{
public:
	uint8                                         Pad_290[0x28];                                     // 0x0290(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SavedActorGuid;                                    // 0x02B8(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Version;                                           // 0x02C8(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSpawnedByLevelSaveRecord;                         // 0x02CC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceDirty;                                       // 0x02CD(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDirty;                                            // 0x02CE(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CF[0x1];                                      // 0x02CF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPersistentDataModified();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPersistenceFeatureDataActor">();
	}
	static class AJunoPersistenceFeatureDataActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPersistenceFeatureDataActor>();
	}
};

// Class JunoGameNative.JunoAIPersistenceFeatureDataActor
// 0x01E0 (0x04B0 - 0x02D0)
class AJunoAIPersistenceFeatureDataActor final : public AJunoPersistenceFeatureDataActor
{
public:
	uint8                                         Pad_2D0[0x10];                                     // 0x02D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSavedAIDataManager                    SavedAIData;                                       // 0x02E0(0x01D0)(SaveGame, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureDataActor">();
	}
	static class AJunoAIPersistenceFeatureDataActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoAIPersistenceFeatureDataActor>();
	}
};

// Class JunoGameNative.JunoAIPersistenceFeatureDataInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoAIPersistenceFeatureDataInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureDataInterface">();
	}
	static class IJunoAIPersistenceFeatureDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoAIPersistenceFeatureDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class JunoGameNative.JunoPawnComponent_EmotionalState
// 0x0090 (0x0138 - 0x00A8)
class UJunoPawnComponent_EmotionalState final : public UFortPawnComponent
{
public:
	TMulticastInlineDelegate<void(EJunoPawnEmotionalState NewEmotion)> OnJunoCurrentEmotionalStateChangedDelegate; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EJunoPawnEmotionalState NewEmotion)> OnJunoCurrentEmotionalStateStartedChange; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float NewEmotionPercent)> OnJunoCurrentEmotionChangeFinished;      // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(uint8 EmotionIndex)> OnCheatEmotionIndexChanged;                   // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EJunoPawnEmotionalState                       CurrentEmotionalState;                             // 0x00E8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoEmotionalStateData                TargetEmotionalState;                              // 0x00EC(0x0010)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         CheatEmotionIndex;                                 // 0x00FC(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoPawnEmotionalStateMappingFromAwesomeLevel> JunoPawnEmotionalStateMappingFromAwesomeLevel; // 0x0100(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ResetToDefaultEmotionRate;                         // 0x0118(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeToStayAtEmotionInSeconds;                      // 0x011C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DefaultEmotionHandle;                              // 0x0128(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleJunoAwesomeLevelChanged(const struct FJunoAwesomeLevelChangeData& ChangeData);
	void OnRep_CheatEmotionIndex();
	void OnRep_CurrentEmotionalState();
	void OnRep_TargetEmotionalState();
	void ResetToDefaultEmotionalState();
	void SetCurrentEmotionalState(const EJunoPawnEmotionalState NewEmotion);
	void SetEmotionalState(const struct FJunoEmotionalStateData& Emotion);

	EJunoPawnEmotionalState GetCurrentEmotionalState() const;
	float GetCurrentEmotionalStateValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPawnComponent_EmotionalState">();
	}
	static class UJunoPawnComponent_EmotionalState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPawnComponent_EmotionalState>();
	}
};

// Class JunoGameNative.JunoAIPersistenceFeatureModule
// 0x0000 (0x00E0 - 0x00E0)
class UJunoAIPersistenceFeatureModule final : public UPersistenceFrameworkModule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureModule">();
	}
	static class UJunoAIPersistenceFeatureModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIPersistenceFeatureModule>();
	}
};

// Class JunoGameNative.JunoAIPersistenceFeatureData_Container
// 0x0000 (0x01E0 - 0x01E0)
class UJunoAIPersistenceFeatureData_Container final : public UJunoBasePFWPersistenceFeatureDataContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAIPersistenceFeatureData_Container">();
	}
	static class UJunoAIPersistenceFeatureData_Container* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAIPersistenceFeatureData_Container>();
	}
};

// Class JunoGameNative.JunoWeatherPersistenceFeatureData
// 0x0018 (0x0058 - 0x0040)
class UJunoWeatherPersistenceFeatureData final : public UJunoBasePFWPersistenceFeatureData
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoWeatherSaveData                   WeatherSaveData;                                   // 0x0048(0x0010)(SaveGame, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWeatherPersistenceFeatureData">();
	}
	static class UJunoWeatherPersistenceFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWeatherPersistenceFeatureData>();
	}
};

// Class JunoGameNative.JunoAlterationCraftingComponent
// 0x0010 (0x00B0 - 0x00A0)
class UJunoAlterationCraftingComponent final : public UGameFrameworkComponent
{
public:
	TWeakObjectPtr<class UCraftingObjectComponent> CachedCraftingObjectComponent;                    // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataRegistryType                      WeaponEssenceDataRegistryType;                     // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCraftingStateChanged(const struct FCraftingObjectStateChangedEvent& Event);
	bool OnCheckValidItemType(class AFortPlayerController* Instigator);
	void OnCraftingSuccess(const struct FCraftingObjectSuccessEvent& Event);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAlterationCraftingComponent">();
	}
	static class UJunoAlterationCraftingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAlterationCraftingComponent>();
	}
};

// Class JunoGameNative.JunoAnalytics
// 0x0000 (0x0028 - 0x0028)
class UJunoAnalytics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnalytics">();
	}
	static class UJunoAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnalytics>();
	}
};

// Class JunoGameNative.JunoAnimNotifyState_QueueInput
// 0x0068 (0x0098 - 0x0030)
class UJunoAnimNotifyState_QueueInput final : public UAnimNotifyState
{
public:
	bool                                          bQueueMantisInput;                                 // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameplayEventTagsToQueue;                          // 0x0038(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToRemove;                               // 0x0058(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToAdd;                                  // 0x0078(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnimNotifyState_QueueInput">();
	}
	static class UJunoAnimNotifyState_QueueInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimNotifyState_QueueInput>();
	}
};

// Class JunoGameNative.JunoAnimNotifyState_MakeInterruptible
// 0x0040 (0x0070 - 0x0030)
class UJunoAnimNotifyState_MakeInterruptible final : public UAnimNotifyState
{
public:
	struct FGameplayTagContainer                  AbilityTagsToRemove;                               // 0x0030(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToAdd;                                  // 0x0050(0x0020)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnimNotifyState_MakeInterruptible">();
	}
	static class UJunoAnimNotifyState_MakeInterruptible* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimNotifyState_MakeInterruptible>();
	}
};

// Class JunoGameNative.JunoQuestDefinitionComponent_ProductCompatibilityInjector_GameMode
// 0x0008 (0x0080 - 0x0078)
class UJunoQuestDefinitionComponent_ProductCompatibilityInjector_GameMode final : public UFortQuestDefinitionComponent_ProductCompatibilityInjector
{
public:
	EJunoWorldSettingOptions_BuildMode            GameMode;                                          // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoQuestDefinitionComponent_ProductCompatibilityInjector_GameMode">();
	}
	static class UJunoQuestDefinitionComponent_ProductCompatibilityInjector_GameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQuestDefinitionComponent_ProductCompatibilityInjector_GameMode>();
	}
};

// Class JunoGameNative.JunoAsyncAction_WaitForEventRouter
// 0x0030 (0x0060 - 0x0030)
class UJunoAsyncAction_WaitForEventRouter final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UGameplayEventRouterComponent* EventRouter)> OnGameplayEventRouterAvailable; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UJunoAsyncAction_WaitForEventRouter* WaitForEventRouter(class AActor* ContextActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAsyncAction_WaitForEventRouter">();
	}
	static class UJunoAsyncAction_WaitForEventRouter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAsyncAction_WaitForEventRouter>();
	}
};

// Class JunoGameNative.JunoVerbProcessor_EquipmentChanged
// 0x0000 (0x00A0 - 0x00A0)
class UJunoVerbProcessor_EquipmentChanged final : public UFortObjectiveProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoVerbProcessor_EquipmentChanged">();
	}
	static class UJunoVerbProcessor_EquipmentChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVerbProcessor_EquipmentChanged>();
	}
};

// Class JunoGameNative.JunoAsyncAction_WaitForRootPlayspace
// 0x0018 (0x0048 - 0x0030)
class UJunoAsyncAction_WaitForRootPlayspace final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class AJunoRootPlayspace* Playspace)> OnReady;                     // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UJunoAsyncAction_WaitForRootPlayspace* RootPlayspaceReadyAsync(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAsyncAction_WaitForRootPlayspace">();
	}
	static class UJunoAsyncAction_WaitForRootPlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAsyncAction_WaitForRootPlayspace>();
	}
};

// Class JunoGameNative.JunoLWITriggerComponent
// 0x0018 (0x00C0 - 0x00A8)
class UJunoLWITriggerComponent final : public UFortPawnComponent
{
public:
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoLWITriggerComponent">();
	}
	static class UJunoLWITriggerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLWITriggerComponent>();
	}
};

// Class JunoGameNative.JunoPersistenceAssetType
// 0x0008 (0x0030 - 0x0028)
class UJunoPersistenceAssetType : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPersistenceAssetType">();
	}
	static class UJunoPersistenceAssetType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPersistenceAssetType>();
	}
};

// Class JunoGameNative.JunoBlueprintPersistenceAssetType
// 0x0000 (0x0030 - 0x0030)
class UJunoBlueprintPersistenceAssetType final : public UJunoPersistenceAssetType
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBlueprintPersistenceAssetType">();
	}
	static class UJunoBlueprintPersistenceAssetType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBlueprintPersistenceAssetType>();
	}
};

// Class JunoGameNative.JunoBuilderToolSelectedActorInterface
// 0x0000 (0x0000 - 0x0000)
class IJunoBuilderToolSelectedActorInterface final
{
public:
	void ReceiveSelectionSpawnedByBuilderTool(class AJunoBuilderTool* BuilderTool, class UJunoBuilderToolInteractionBehavior* Behavior, const struct FJunoBuilderToolSelectionSpawnParams& SelectionSpawnParameters);
	void ReceiveSpawnedByBuilderTool(class AJunoBuilderTool* BuilderTool, class UJunoBuilderToolInteractionBehavior* Behavior);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuilderToolSelectedActorInterface">();
	}
	static class IJunoBuilderToolSelectedActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IJunoBuilderToolSelectedActorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class JunoGameNative.JunoVerbProcessor_TemperatureUpdated
// 0x0000 (0x00A0 - 0x00A0)
class UJunoVerbProcessor_TemperatureUpdated final : public UFortObjectiveProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoVerbProcessor_TemperatureUpdated">();
	}
	static class UJunoVerbProcessor_TemperatureUpdated* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoVerbProcessor_TemperatureUpdated>();
	}
};

// Class JunoGameNative.JunoBuildingAccountItemDefBase
// 0x0020 (0x0528 - 0x0508)
class UJunoBuildingAccountItemDefBase : public UAthenaCosmeticItemDefinition
{
public:
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JunoBuildingFrontendPreviewScale;                  // 0x0510(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              JunoBuildingFrontendFramingCenterOffsetRatio;      // 0x0518(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingAccountItemDefBase">();
	}
	static class UJunoBuildingAccountItemDefBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingAccountItemDefBase>();
	}
};

// Class JunoGameNative.JunoPlayerState
// 0x0028 (0x19E0 - 0x19B8)
class AJunoPlayerState final : public AFortPlayerStateAthena
{
public:
	struct FGuid                                  CaveId;                                            // 0x19B8(0x0010)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FLinearColor>                   PinColorForPlayer;                                 // 0x19C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           GameplayTagPresentWhenTeleporting;                 // 0x19D8(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_19DC[0x4];                                     // 0x19DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FGuid GetCaveId() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPlayerState">();
	}
	static class AJunoPlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoPlayerState>();
	}
};

// Class JunoGameNative.JunoBuildingSetAccountItemDefinition
// 0x0028 (0x0550 - 0x0528)
class UJunoBuildingSetAccountItemDefinition final : public UJunoBuildingAccountItemDefBase
{
public:
	float                                         FoundationPiecesHeightToShow;                      // 0x0528(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   BuildingActorClassToPreview;                       // 0x0530(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingSetAccountItemDefinition">();
	}
	static class UJunoBuildingSetAccountItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingSetAccountItemDefinition>();
	}
};

// Class JunoGameNative.JunoBuildingPropAccountItemDefinition
// 0x0020 (0x0548 - 0x0528)
class UJunoBuildingPropAccountItemDefinition final : public UJunoBuildingAccountItemDefBase
{
public:
	TSoftClassPtr<class UClass>                   BuildingActorClassToPreview;                       // 0x0528(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingPropAccountItemDefinition">();
	}
	static class UJunoBuildingPropAccountItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingPropAccountItemDefinition>();
	}
};

// Class JunoGameNative.JunoAssetList
// 0x0010 (0x0038 - 0x0028)
class UJunoAssetList final : public UObject
{
public:
	TArray<struct FSoftObjectPath>                Assets;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AssetRegistrySearchable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAssetList">();
	}
	static class UJunoAssetList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAssetList>();
	}
};

// Class JunoGameNative.JunoBuildingConnectivityBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UJunoBuildingConnectivityBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DebugDrawConnectionLocations(const class UObject* WorldContextObject, const struct FJunoBuildingConnection& Connection);
	static void DebugDrawConnections(const class UObject* WorldContextObject, const struct FJunoBuildingConnectionPointsResult& Candidates, const struct FJunoBuildingConnectionPointsResult& Targets, const struct FJunoBuildingConnection& ChosenConnection, const TArray<struct FJunoBuildingConnection>& Connections);
	static TArray<class UAtomModelAssetUserData*> GetAtomModelAssetUserData(const class UObject* Object);
	static TArray<struct FJunoBuildingConnectionPoint> GetKnobs(const struct FJunoBuildingConnectionPointsResult& Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBuildingConnectivityBlueprintLibrary">();
	}
	static class UJunoBuildingConnectivityBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBuildingConnectivityBlueprintLibrary>();
	}
};

// Class JunoGameNative.JunoPhysicsObjectNavigationComponent
// 0x00A0 (0x0140 - 0x00A0)
class alignas(0x10) UJunoPhysicsObjectNavigationComponent final : public UActorComponent
{
public:
	float                                         LowSpeedThreshold;                                 // 0x00A0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowSpeedDistanceThreshold;                         // 0x00A4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowSpeedRotationThreshold;                         // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowSpeedScaleThreshold;                            // 0x00AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowSpeedDurationTrigger;                           // 0x00B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x6C];                                      // 0x00B4(0x006C)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    PrimitiveComponentAffectingNavMesh;                // 0x0120(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x18];                                     // 0x0128(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAddedToClusterUnion(class UClusterUnionComponent* ClusterUnion, class UPrimitiveComponent* Component);
	void OnClusterUnionPhysicsObjectAwakeChanged(class UPrimitiveComponent* SimulatingComponent, bool bIsAwake);
	void OnRemovedFromClusterUnion(class UClusterUnionComponent* ClusterUnion, class UPrimitiveComponent* Component);
	void OnSleep(class UPrimitiveComponent* SimulatingComponent, class FName BoneName);
	void OnWake(class UPrimitiveComponent* SimulatingComponent, class FName BoneName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoPhysicsObjectNavigationComponent">();
	}
	static class UJunoPhysicsObjectNavigationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoPhysicsObjectNavigationComponent>();
	}
};

// Class JunoGameNative.JunoBuildingCosmeticsSettings
// 0x0088 (0x00B8 - 0x0030)
class UJunoBuildingCosmeticsSettings final : public UPrimaryDataAsset
{
public:
