#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameMobileUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "DynamicBacchusHUD_classes.hpp"
#include "JunoGameNative_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class JunoGameMobileUI.FortMobileButtonBehaviorComponent_OffhandVisuals
// 0x0020 (0x0068 - 0x0048)
class UFortMobileButtonBehaviorComponent_OffhandVisuals final : public UFortMobileButtonBehaviorComponent_Visibility
{
public:
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CachedOffhandItem;                                 // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleInventoryItemChanged(const struct FJunoItemSlot& ItemSlot, const EJunoItemChangeType ChangeType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileButtonBehaviorComponent_OffhandVisuals">();
	}
	static class UFortMobileButtonBehaviorComponent_OffhandVisuals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_OffhandVisuals>();
	}
};

// Class JunoGameMobileUI.JunoMobileActionButtonBehavior_Interact
// 0x0000 (0x0130 - 0x0130)
class UJunoMobileActionButtonBehavior_Interact final : public UFortMobileActionButtonBehavior
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMobileActionButtonBehavior_Interact">();
	}
	static class UJunoMobileActionButtonBehavior_Interact* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMobileActionButtonBehavior_Interact>();
	}
};

// Class JunoGameMobileUI.JunoGameDynamicMobileUIDirector
// 0x00C8 (0x0550 - 0x0488)
class AJunoGameDynamicMobileUIDirector final : public ADynamicBacchusHUDDirector
{
public:
	uint8                                         Pad_488[0x20];                                     // 0x0488(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  HUDTagsToSkip;                                     // 0x04A8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                   ForcedPresetName;                                  // 0x04C8(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ForcedProfile;                                     // 0x04D8(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ForcedProfileContainer;                            // 0x04DC(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UDynamicUIScene*> HUDContextVisibilityTagToScene;                // 0x04E0(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_530[0x20];                                     // 0x0530(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnBuildingModeChanged(const struct FJunoEvent_BuildingModeChanged& Event);
	void UpdateHUDLayoutContexts(const struct FGameplayTagContainer& ContextsToAdd, const struct FGameplayTagContainer& ContextsToRemove);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoGameDynamicMobileUIDirector">();
	}
	static class AJunoGameDynamicMobileUIDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJunoGameDynamicMobileUIDirector>();
	}
};

}

