#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoLowMemoryFallbackRuntime

#include "Basic.hpp"

#include "LowMemoryFallbackRuntime_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "JunoLowMemoryFallbackRuntime_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class JunoLowMemoryFallbackRuntime.JunoActivateStrategyOnAllClients_LowMemoryFallbackStrategy
// 0x0008 (0x0040 - 0x0038)
class UJunoActivateStrategyOnAllClients_LowMemoryFallbackStrategy final : public ULowMemoryFallbackStrategy
{
public:
	TSubclassOf<class ULowMemoryFallbackStrategy> StrategyToActivate;                                // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActivateStrategyOnAllClients_LowMemoryFallbackStrategy">();
	}
	static class UJunoActivateStrategyOnAllClients_LowMemoryFallbackStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActivateStrategyOnAllClients_LowMemoryFallbackStrategy>();
	}
};

// Class JunoLowMemoryFallbackRuntime.JunoBlockBuilding_LowMemoryFallbackStrategy
// 0x0008 (0x0040 - 0x0038)
class UJunoBlockBuilding_LowMemoryFallbackStrategy final : public ULowMemoryFallbackStrategy
{
public:
	struct FGameplayTag                           BlockingTag;                                       // 0x0038(0x0004)(Edit, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBlockBuilding_LowMemoryFallbackStrategy">();
	}
	static class UJunoBlockBuilding_LowMemoryFallbackStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBlockBuilding_LowMemoryFallbackStrategy>();
	}
};

// Class JunoLowMemoryFallbackRuntime.JunoLowMemoryFallbackGameStateComponent
// 0x0020 (0x00C0 - 0x00A0)
class UJunoLowMemoryFallbackGameStateComponent final : public UFortGameStateComponent
{
public:
	TArray<struct FJunoLowMemoryFallbackTriggeredStrategy> TriggeredStrategies;                      // 0x00A0(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	TArray<class ULowMemoryFallbackStrategy*>     ActiveStrategies;                                  // 0x00B0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void OnRep_TriggeredStrategies();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoLowMemoryFallbackGameStateComponent">();
	}
	static class UJunoLowMemoryFallbackGameStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLowMemoryFallbackGameStateComponent>();
	}
};

// Class JunoLowMemoryFallbackRuntime.JunoLowMemoryFallbackPlayerControllerComponent
// 0x0008 (0x00A8 - 0x00A0)
class UJunoLowMemoryFallbackPlayerControllerComponent final : public UControllerComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Server_TriggerStrategy(TSubclassOf<class ULowMemoryFallbackStrategy> StrategyClass);
	void Server_UntriggerStrategy(TSubclassOf<class ULowMemoryFallbackStrategy> StrategyClass);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoLowMemoryFallbackPlayerControllerComponent">();
	}
	static class UJunoLowMemoryFallbackPlayerControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLowMemoryFallbackPlayerControllerComponent>();
	}
};

// Class JunoLowMemoryFallbackRuntime.JunoLowMemoryFallbackWorldSubsystem
// 0x0000 (0x0118 - 0x0118)
class UJunoLowMemoryFallbackWorldSubsystem final : public ULowMemoryFallbackWorldSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoLowMemoryFallbackWorldSubsystem">();
	}
	static class UJunoLowMemoryFallbackWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoLowMemoryFallbackWorldSubsystem>();
	}
};

// Class JunoLowMemoryFallbackRuntime.JunoSendMemoryStateMessage_LowMemoryFallbackStrategy
// 0x0008 (0x0040 - 0x0038)
class UJunoSendMemoryStateMessage_LowMemoryFallbackStrategy : public ULowMemoryFallbackStrategy
{
public:
	EJunoLowMemoryState                           MemoryState;                                       // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoSendMemoryStateMessage_LowMemoryFallbackStrategy">();
	}
	static class UJunoSendMemoryStateMessage_LowMemoryFallbackStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoSendMemoryStateMessage_LowMemoryFallbackStrategy>();
	}
};

// Class JunoLowMemoryFallbackRuntime.JunoSendMemoryStateMessage_LowMemoryFallbackStrategyGood
// 0x0000 (0x0040 - 0x0040)
class UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyGood final : public UJunoSendMemoryStateMessage_LowMemoryFallbackStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoSendMemoryStateMessage_LowMemoryFallbackStrategyGood">();
	}
	static class UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyGood* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyGood>();
	}
};

// Class JunoLowMemoryFallbackRuntime.JunoSendMemoryStateMessage_LowMemoryFallbackStrategyLow
// 0x0000 (0x0040 - 0x0040)
class UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyLow final : public UJunoSendMemoryStateMessage_LowMemoryFallbackStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoSendMemoryStateMessage_LowMemoryFallbackStrategyLow">();
	}
	static class UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyLow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyLow>();
	}
};

// Class JunoLowMemoryFallbackRuntime.JunoSendMemoryStateMessage_LowMemoryFallbackStrategyVeryLow
// 0x0000 (0x0040 - 0x0040)
class UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyVeryLow final : public UJunoSendMemoryStateMessage_LowMemoryFallbackStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoSendMemoryStateMessage_LowMemoryFallbackStrategyVeryLow">();
	}
	static class UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyVeryLow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyVeryLow>();
	}
};

// Class JunoLowMemoryFallbackRuntime.JunoSendMemoryStateMessage_LowMemoryFallbackStrategyCritical
// 0x0000 (0x0040 - 0x0040)
class UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyCritical final : public UJunoSendMemoryStateMessage_LowMemoryFallbackStrategy
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoSendMemoryStateMessage_LowMemoryFallbackStrategyCritical">();
	}
	static class UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyCritical* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoSendMemoryStateMessage_LowMemoryFallbackStrategyCritical>();
	}
};

// Class JunoLowMemoryFallbackRuntime.JunoStreamingDistance_LowMemoryFallbackStrategy
// 0x0008 (0x0040 - 0x0038)
class UJunoStreamingDistance_LowMemoryFallbackStrategy final : public ULowMemoryFallbackStrategy
{
public:
	float                                         ScaleMultiplier;                                   // 0x0038(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoStreamingDistance_LowMemoryFallbackStrategy">();
	}
	static class UJunoStreamingDistance_LowMemoryFallbackStrategy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoStreamingDistance_LowMemoryFallbackStrategy>();
	}
};

}

