#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoAdventuresRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonConversationRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "StateDrivenActorRuntime_structs.hpp"


namespace SDK
{

// Enum JunoAdventuresRuntime.EJunoNPCJoinReason
// NumValues: 0x0004
enum class EJunoNPCJoinReason : uint8
{
	StandardRecruitment                      = 0,
	RemoteRecruitment                        = 1,
	BarnRecruitment                          = 2,
	EJunoNPCJoinReason_MAX                   = 3,
};

// Enum JunoAdventuresRuntime.EJunoTokenReceiverType
// NumValues: 0x0003
enum class EJunoTokenReceiverType : uint8
{
	QuestGiver                               = 0,
	QuestGiverBoundPlayspace                 = 1,
	EJunoTokenReceiverType_MAX               = 2,
};

// Enum JunoAdventuresRuntime.EJunoInsertItemType
// NumValues: 0x0004
enum class EJunoInsertItemType : uint8
{
	Equipped                                 = 0,
	OffHand                                  = 1,
	Any                                      = 2,
	EJunoInsertItemType_MAX                  = 3,
};

// Enum JunoAdventuresRuntime.EJunoQuestState
// NumValues: 0x0006
enum class EJunoQuestState : uint8
{
	Invalid                                  = 0,
	Available                                = 1,
	Rolled                                   = 2,
	InProgress                               = 3,
	Completed                                = 4,
	EJunoQuestState_MAX                      = 5,
};

// ScriptStruct JunoAdventuresRuntime.JunoConversationContextRequirement
// 0x0008 (0x0008 - 0x0000)
struct FJunoConversationContextRequirement final
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           RequirementTag;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.JunoContexualMessageContainer
// 0x0048 (0x0048 - 0x0000)
struct FJunoContexualMessageContainer final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoiceOverTag;                                      // 0x0010(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           MoodReactionTag;                                   // 0x0014(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FConversationNodeParameterPair> MetadataParameters;                                // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  MetadataTags;                                      // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.JunoContextualMessageCandidate
// 0x0088 (0x0088 - 0x0000)
struct FJunoContextualMessageCandidate final
{
public:
	EContextRequirementMatchPolicy                RequirementMatchPolicy;                            // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseJunoContextRequirements;                       // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortConversationContextRequirement> ContextRequirements;                          // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FJunoConversationContextRequirement> JunoContextRequirements;                      // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FScalableFloat                         Priority;                                          // 0x0028(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FScalableFloat                         Weight;                                            // 0x0050(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FJunoContexualMessageContainer> Messages;                                          // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.JunoContextualMessageConfig
// 0x0010 (0x0010 - 0x0000)
struct FJunoContextualMessageConfig final
{
public:
	TArray<struct FJunoContextualMessageCandidate> ContextualMessages;                               // 0x0000(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
};

// ScriptStruct JunoAdventuresRuntime.JunoContextualMessageConfigTableRow
// 0x0010 (0x0018 - 0x0008)
struct FJunoContextualMessageConfigTableRow final : public FTableRowBase
{
public:
	struct FJunoContextualMessageConfig           MessageConfig;                                     // 0x0008(0x0010)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.JunoContextualMessageQueryResult
// 0x0050 (0x0050 - 0x0000)
struct FJunoContextualMessageQueryResult final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                           MoodReactionTag;                                   // 0x0010(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoiceOverTag;                                      // 0x0014(0x0004)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FConversationNodeParameterPair> MetadataParameters;                                // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  MetadataTags;                                      // 0x0028(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bAreConsecutiveMessagesPending;                    // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoAdventuresRuntime.JunoSpecializedContextualMessageConfig
// 0x00B8 (0x00B8 - 0x0000)
struct FJunoSpecializedContextualMessageConfig final
{
public:
	struct FGameplayTagQuery                      NPCActorTagQuery;                                  // 0x0000(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         Priority;                                          // 0x0048(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FScalableFloat                         Weight;                                            // 0x0070(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FJunoContextualMessageConfig           MessageConfig;                                     // 0x0098(0x0010)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                    MessageConfigTableRow;                             // 0x00A8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.JunoConversationGetResourceTaskMemory
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FJunoConversationGetResourceTaskMemory final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoAdventuresRuntime.JunoConversationGiftNPCTaskMemory
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJunoConversationGiftNPCTaskMemory final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoAdventuresRuntime.JunoConversationGrantDirectRewardTaskMemory
// 0x0020 (0x0020 - 0x0000)
struct FJunoConversationGrantDirectRewardTaskMemory final
{
public:
	TArray<class FName>                           SaveNames;                                         // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FFortItemEntry>                 Items;                                             // 0x0010(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.JunoAIGrantDirectRewardRow
// 0x0010 (0x0018 - 0x0008)
struct FJunoAIGrantDirectRewardRow final : public FTableRowBase
{
public:
	int32                                         MaximumPickAmount;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaximumPickSaveName;                               // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LootTierGroup;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoAdventuresRuntime.JunoConversationRemoteCampRecruitmentTaskMemory
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FJunoConversationRemoteCampRecruitmentTaskMemory final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoAdventuresRuntime.QuestPropSpawnInfo
// 0x0088 (0x0088 - 0x0000)
struct FQuestPropSpawnInfo final
{
public:
	TSoftClassPtr<class UClass>                   ClassToSpawn;                                      // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequiredTags;                                      // 0x0020(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ForbiddenTags;                                     // 0x0040(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUseMinMaxDistances;                               // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MinMaxDistanceFromOtherQuestPropActors;            // 0x0068(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MinMaxDistanceFromQuestGiver;                      // 0x0078(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.QuestPropSpawnInfoContainer
// 0x0010 (0x0010 - 0x0000)
struct FQuestPropSpawnInfoContainer final
{
public:
	TArray<struct FQuestPropSpawnInfo>            QuestPropSpawnInfos;                               // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.QuestTokenMappingContainer
// 0x0050 (0x0050 - 0x0000)
struct FQuestTokenMappingContainer final
{
public:
	TMap<EJunoTokenReceiverType, struct FGameplayTagContainer> QuestTokens;                          // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.QuestTokenMappings
// 0x0050 (0x0050 - 0x0000)
struct FQuestTokenMappings final
{
public:
	TMap<class FName, struct FQuestTokenMappingContainer> ObjectiveQuestTokensToGrant;               // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.JunoQuestData
// 0x00A8 (0x00A8 - 0x0000)
struct FJunoQuestData final
{
public:
	TMap<class FName, struct FQuestPropSpawnInfoContainer> ObjectiveQuestPropActorsToSpawn;          // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FQuestTokenMappings                    QuestTokenMappings;                                // 0x0050(0x0050)(Edit, NativeAccessSpecifierPublic)
	int32                                         AwesomePointsToGrant;                              // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoAdventuresRuntime.JunoChangeInventoryEventEntry
// 0x0030 (0x0030 - 0x0000)
struct FJunoChangeInventoryEventEntry final
{
public:
	struct FStateDrivenTagQuery                   ItemTagQuery;                                      // 0x0000(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStateDrivenFloat                      ItemCount;                                         // 0x0018(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.JunoStateDrivenEvent_ChangeInventory
// 0x0028 (0x0078 - 0x0050)
struct FJunoStateDrivenEvent_ChangeInventory final : public FStateDrivenEvent_InteractionBase
{
public:
	TArray<struct FJunoChangeInventoryEventEntry> ItemRequirements;                                  // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bExactRequirements;                                // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoChangeInventoryHelper*             ChangeInventoryHelper;                             // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AFortPawn>               SavedInteractingPawn;                              // 0x0070(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct JunoAdventuresRuntime.JunoStateDrivenEvent_InsertItem
// 0x0050 (0x00A0 - 0x0050)
struct FJunoStateDrivenEvent_InsertItem final : public FStateDrivenEvent_InteractionBase
{
public:
	EJunoInsertItemType                           InsertType;                                        // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateDrivenTagQuery                   EquippedItemTagQuery;                              // 0x0058(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStateDrivenTagQuery                   OffHandItemTagQuery;                               // 0x0070(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStateDrivenTagQuery                   AnyHandItemTagQuery;                               // 0x0088(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoAdventuresRuntime.JunoQuestPoolDataAssetEntry
// 0x0010 (0x0010 - 0x0000)
struct FJunoQuestPoolDataAssetEntry final
{
public:
	class UFortQuestItemDefinition*               QuestDefinition;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRepeatable;                                     // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoAdventuresRuntime.JunoQuestIDListWrapper
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJunoQuestIDListWrapper final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoAdventuresRuntime.JunoQuestRuntimeEntry
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FJunoQuestRuntimeEntry final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoAdventuresRuntime.ActiveQuestInfo
// 0x00D0 (0x00D0 - 0x0000)
struct FActiveQuestInfo final
{
public:
	class AActor*                                 QuestGiver;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0xC8];                                       // 0x0008(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoAdventuresRuntime.MappedJunoActions
// 0x0010 (0x0010 - 0x0000)
struct FMappedJunoActions final
{
public:
	TArray<class UJunoActionConfig*>              MappedJunoActions;                                 // 0x0000(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};

}

