#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCraftingBaseRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum JunoCraftingBaseRuntime.EJunoRecipeSortType
// NumValues: 0x0005
enum class EJunoRecipeSortType : uint8
{
	BySet                                    = 0,
	ByName                                   = 1,
	BySortPriority                           = 2,
	MAX_None                                 = 3,
	EJunoRecipeSortType_MAX                  = 4,
};

// ScriptStruct JunoCraftingBaseRuntime.JunoCraftingHeaderUIDataEntry
// 0x0018 (0x0018 - 0x0000)
struct FJunoCraftingHeaderUIDataEntry final
{
public:
	struct FGameplayTag                           HeaderTag;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HeaderText;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoCraftingBaseRuntime.JunoCraftingSubCategoryUIDataEntry
// 0x0068 (0x0068 - 0x0000)
struct FJunoCraftingSubCategoryUIDataEntry final
{
public:
	struct FGameplayTag                           CategoryTag;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CategoryIcon;                                      // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CategoryTitle;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   CategoryTitleFormattedWithCount;                   // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FJunoCraftingHeaderUIDataEntry> Headers;                                           // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<EJunoRecipeSortType>                   SortingPreferences;                                // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoCraftingBaseRuntime.JunoCraftingCategoryUIDataEntry
// 0x0068 (0x0068 - 0x0000)
struct FJunoCraftingCategoryUIDataEntry final
{
public:
	struct FGameplayTag                           CategoryTag;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CategoryIcon;                                      // 0x0008(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CategoryTitle;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FJunoCraftingHeaderUIDataEntry> Headers;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FJunoCraftingSubCategoryUIDataEntry> Subcategories;                                // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<EJunoRecipeSortType>                   SortingPreferences;                                // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

}

