#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoUI

#include "Basic.hpp"

#include "JunoUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CraftingRuntime_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonConversationRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "JunoCraftingBaseRuntime_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function JunoUI.JunoBangWidget.OnFreeBuildToggled
// 0x0001 (0x0001 - 0x0000)
struct JunoBangWidget_OnFreeBuildToggled final
{
public:
	bool                                          bFreeBuildEnabled;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBangWidget.SetBangCount
// 0x0004 (0x0004 - 0x0000)
struct JunoBangWidget_SetBangCount final
{
public:
	int32                                         NewCount;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBangWidget.SetBangVisibility
// 0x0001 (0x0001 - 0x0000)
struct JunoBangWidget_SetBangVisibility final
{
public:
	EJunoBangVisibility                           BangVisibility;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBangWidget.IsFreeBuildEnabled
// 0x0001 (0x0001 - 0x0000)
struct JunoBangWidget_IsFreeBuildEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoReticleContainerWidget.HandlePossessedPawnChanged
// 0x0010 (0x0010 - 0x0000)
struct JunoReticleContainerWidget_HandlePossessedPawnChanged final
{
public:
	class APawn*                                  OldPawn;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoReticleContainerWidget.HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct JunoReticleContainerWidget_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PreviousWeapon;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBedAssignmentListEntry.OnBedAssignmentObjectSet
// 0x0008 (0x0008 - 0x0000)
struct JunoBedAssignmentListEntry_OnBedAssignmentObjectSet final
{
public:
	class UJunoBedAssignmentListObject*           NewBedAssignmentListObject;                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBedAssignmentListObject.GetHasBed
// 0x0001 (0x0001 - 0x0000)
struct JunoBedAssignmentListObject_GetHasBed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBedAssignmentListObject.GetIsBed
// 0x0001 (0x0001 - 0x0000)
struct JunoBedAssignmentListObject_GetIsBed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBedAssignmentListObject.GetNPCDisplayName
// 0x0010 (0x0010 - 0x0000)
struct JunoBedAssignmentListObject_GetNPCDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBedAssignmentListObject.GetNPCGameplayTag
// 0x0004 (0x0004 - 0x0000)
struct JunoBedAssignmentListObject_GetNPCGameplayTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBedAssignmentListObject.GetNPCIcon
// 0x0020 (0x0020 - 0x0000)
struct JunoBedAssignmentListObject_GetNPCIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBedAssignmentListObject.IsEmpty
// 0x0001 (0x0001 - 0x0000)
struct JunoBedAssignmentListObject_IsEmpty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBedAssignmentListObject.IsNPC
// 0x0001 (0x0001 - 0x0000)
struct JunoBedAssignmentListObject_IsNPC final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBedAssignmentListObject.IsPlayer
// 0x0001 (0x0001 - 0x0000)
struct JunoBedAssignmentListObject_IsPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBedAssignmentListObject.IsSelectable
// 0x0001 (0x0001 - 0x0000)
struct JunoBedAssignmentListObject_IsSelectable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoPlayerIndicatorWidget.HandlePlayerStatePawnDied
// 0x0060 (0x0060 - 0x0000)
struct JunoPlayerIndicatorWidget_HandlePlayerStatePawnDied final
{
public:
	struct FPawnDamageData                        PawnDamageInfo;                                    // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoPlayerIndicatorWidget.OnClampedStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct JunoPlayerIndicatorWidget_OnClampedStatusChanged final
{
public:
	bool                                          bInIsClamped;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoPlayerIndicatorWidget.OnInFocusStateChanged
// 0x0001 (0x0001 - 0x0000)
struct JunoPlayerIndicatorWidget_OnInFocusStateChanged final
{
public:
	bool                                          bInInFocus;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoPlayerIndicatorWidget.OnPlayerDataUpdated
// 0x0048 (0x0048 - 0x0000)
struct JunoPlayerIndicatorWidget_OnPlayerDataUpdated final
{
public:
	struct FJunoPlayerIndicatorData               PlayerIndicatorData;                               // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBiomeUIData.GetJunoBIomeUIData
// 0x0008 (0x0008 - 0x0000)
struct JunoBiomeUIData_GetJunoBIomeUIData final
{
public:
	const class UJunoBiomeUIData*                 ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBiomeUIData.FindBiomeTypeUIData
// 0x0050 (0x0050 - 0x0000)
struct JunoBiomeUIData_FindBiomeTypeUIData final
{
public:
	EJunoBiome                                    Biome;                                             // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoBiomeUIDisplayData                OutBiomeUIDisplayData;                             // 0x0008(0x0040)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoUI.JunoBuildingBarAssignScreen.SetRecipeToAssign
// 0x0004 (0x0004 - 0x0000)
struct JunoBuildingBarAssignScreen_SetRecipeToAssign final
{
public:
	class FName                                   InRecipeToAssign;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBuildingBarHudSlot.OnBuildingSlotPinned
// 0x0001 (0x0001 - 0x0000)
struct JunoBuildingBarHudSlot_OnBuildingSlotPinned final
{
public:
	bool                                          bIsPinned;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBuildingBarHudSlot.OnSelectionChanged
// 0x0048 (0x0048 - 0x0000)
struct JunoBuildingBarHudSlot_OnSelectionChanged final
{
public:
	bool                                          bInSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoBuildingSlotData                  BuildingSlotInitData;                              // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBuildingBarMenuSlot.OnEnterPreview
// 0x0040 (0x0040 - 0x0000)
struct JunoBuildingBarMenuSlot_OnEnterPreview final
{
public:
	struct FJunoBuildingSlotData                  InPreviewSlotData;                                 // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBuildingDisplaySlot.OnSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct JunoBuildingDisplaySlot_OnSelectionChanged final
{
public:
	bool                                          bInSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBuildingDisplaySlot.OnSetBuildingSlotInitData
// 0x0040 (0x0040 - 0x0000)
struct JunoBuildingDisplaySlot_OnSetBuildingSlotInitData final
{
public:
	struct FJunoBuildingSlotData                  BuildingSlotInitData;                              // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBuildingIngredientsGroup.OnCanCraftChanged
// 0x0001 (0x0001 - 0x0000)
struct JunoBuildingIngredientsGroup_OnCanCraftChanged final
{
public:
	bool                                          bCanCraft;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBuildingIngredientsGroup.OnRecipeDisplayDataChanged
// 0x0018 (0x0018 - 0x0000)
struct JunoBuildingIngredientsGroup_OnRecipeDisplayDataChanged final
{
public:
	class FText                                   RecipeDisplayName;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UJunoBuildInstructionsItemDefinition* BuildingItemDefinition;                        // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoDynamicUIDirector.OpenHudMenuScene
// 0x0018 (0x0018 - 0x0000)
struct JunoDynamicUIDirector_OpenHudMenuScene final
{
public:
	struct FJunoWidgetSceneAndIndex               WidgetSceneAndIndex;                               // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UJunoHudMenuBaseInitData*               HudMenuData;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoDynamicUIDirector.OpenStandaloneMenuScene
// 0x0018 (0x0018 - 0x0000)
struct JunoDynamicUIDirector_OpenStandaloneMenuScene final
{
public:
	struct FJunoWidgetSceneAndIndex               WidgetSceneAndIndex;                               // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                BoundObject;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoDynamicUIDirector.FindTagDrivenScene
// 0x0020 (0x0020 - 0x0000)
struct JunoDynamicUIDirector_FindTagDrivenScene final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoWidgetSceneAndIndex               OutWidgetSceneAndIndex;                            // 0x0008(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoUI.JunoDynamicUIDirector.FindTagDrivenSceneByTagContainer
// 0x0040 (0x0040 - 0x0000)
struct JunoDynamicUIDirector_FindTagDrivenSceneByTagContainer final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParentTag;                                         // 0x0020(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoWidgetSceneAndIndex               OutWidgetSceneAndIndex;                            // 0x0028(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoUI.JunoDynamicUIDirector.GetIsMobileHUDShowing
// 0x0001 (0x0001 - 0x0000)
struct JunoDynamicUIDirector_GetIsMobileHUDShowing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeDetailsWidget.HandleCraftingSuccess
// 0x0030 (0x0030 - 0x0000)
struct JunoRecipeDetailsWidget_HandleCraftingSuccess final
{
public:
	struct FCraftingObjectSuccessEvent            Event;                                             // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeDetailsWidget.HandleInventoryChanged
// 0x0058 (0x0058 - 0x0000)
struct JunoRecipeDetailsWidget_HandleInventoryChanged final
{
public:
	struct FJunoItemSlot                          Item;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoItemChangeType                           ChangeType;                                        // 0x0050(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoUI.JunoRecipeDetailsWidget.OnSetFolderDetails
// 0x0038 (0x0038 - 0x0000)
struct JunoRecipeDetailsWidget_OnSetFolderDetails final
{
public:
	struct FJunoCraftingFolderUIDataEntry         FolderDef;                                         // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeDetailsWidget.OnSetRecipeDetails
// 0x00F0 (0x00F0 - 0x0000)
struct JunoRecipeDetailsWidget_OnSetRecipeDetails final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EJunoKnowledgeState                           KnowledgeState;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CraftCount;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UItemDefinitionBase*              CraftedItemDef;                                    // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   SourceName;                                        // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SourceIcon;                                        // 0x0030(0x00C0)(ConstParm, Parm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeDetailsWidget.SetCraftingObject
// 0x0008 (0x0008 - 0x0000)
struct JunoRecipeDetailsWidget_SetCraftingObject final
{
public:
	class AActor*                                 InCraftingObject;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeDetailsWidget.SetFolderContents
// 0x0010 (0x0010 - 0x0000)
struct JunoRecipeDetailsWidget_SetFolderContents final
{
public:
	TArray<class FName>                           FolderContents;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeDetailsWidget.UpdateFolderFocus
// 0x0004 (0x0004 - 0x0000)
struct JunoRecipeDetailsWidget_UpdateFolderFocus final
{
public:
	struct FGameplayTag                           FolderTag;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeDetailsWidget.UpdateRecipeFocus
// 0x0004 (0x0004 - 0x0000)
struct JunoRecipeDetailsWidget_UpdateRecipeFocus final
{
public:
	class FName                                   Recipe;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeDetailsWidget.GetCurrentFolder
// 0x0004 (0x0004 - 0x0000)
struct JunoRecipeDetailsWidget_GetCurrentFolder final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeDetailsWidget.GetCurrentRecipe
// 0x0004 (0x0004 - 0x0000)
struct JunoRecipeDetailsWidget_GetCurrentRecipe final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBuildingRecipeDetails.OnLoadingBuildingActorAssetComplete
// 0x000C (0x000C - 0x0000)
struct JunoBuildingRecipeDetails_OnLoadingBuildingActorAssetComplete final
{
public:
	struct FJunoGuidedBuildingUIData              GuidedBuildingUIData;                              // 0x0000(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoBuildingRecipeDetails.SetGuidedBuildIngredientsToPreviewCount
// 0x0004 (0x0004 - 0x0000)
struct JunoBuildingRecipeDetails_SetGuidedBuildIngredientsToPreviewCount final
{
public:
	int32                                         InGuidedBuildIngredientsToPreviewCount;            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoDisassemblingScreen.HandleCraftingFormulaChanged
// 0x0010 (0x0010 - 0x0000)
struct JunoDisassemblingScreen_HandleCraftingFormulaChanged final
{
public:
	class AActor*                                 CraftingObjectActor;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewFormula;                                        // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoUI.JunoDisassemblingScreen.OnCrafringFormulaResultsChanged
// 0x0010 (0x0010 - 0x0000)
struct JunoDisassemblingScreen_OnCrafringFormulaResultsChanged final
{
public:
	TArray<struct FItemAndCount>                  CraftingResults;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoDisassemblingScreen.OnSlotItemSelected
// 0x0008 (0x0008 - 0x0000)
struct JunoDisassemblingScreen_OnSlotItemSelected final
{
public:
	const class UFortItem*                        Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoDisassemblingScreen.OnUpdateStationCraftingState
// 0x0001 (0x0001 - 0x0000)
struct JunoDisassemblingScreen_OnUpdateStationCraftingState final
{
public:
	EStationInventoryState                        NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoComposterScreen.HandleCraftingProcessesBlocked
// 0x0008 (0x0008 - 0x0000)
struct JunoComposterScreen_HandleCraftingProcessesBlocked final
{
public:
	class AActor*                                 CraftingObjectRaw;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoComposterScreen.HandleCraftingProcessesFinished
// 0x0008 (0x0008 - 0x0000)
struct JunoComposterScreen_HandleCraftingProcessesFinished final
{
public:
	class AActor*                                 CraftingObjectRaw;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoComposterScreen.OnProceessingSlotsChanged
// 0x0004 (0x0004 - 0x0000)
struct JunoComposterScreen_OnProceessingSlotsChanged final
{
public:
	int32                                         NumberOfOccupiedSlots;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationMarker.OnConversationInteractionUpdated
// 0x0002 (0x0002 - 0x0000)
struct JunoConversationMarker_OnConversationInteractionUpdated final
{
public:
	EDialogMarkerInteractionState                 NewInteractionState;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewCanInteract;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationMarker.OnMessageUpdated
// 0x0010 (0x0010 - 0x0000)
struct JunoConversationMarker_OnMessageUpdated final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationMarker.OnParticipantNameChanged
// 0x0010 (0x0010 - 0x0000)
struct JunoConversationMarker_OnParticipantNameChanged final
{
public:
	class FText                                   InParticipantName;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationMarker.SetNPCStatus
// 0x0048 (0x0048 - 0x0000)
struct JunoConversationMarker_SetNPCStatus final
{
public:
	struct FJunoNPCStateUIData                    NPCStateData;                                      // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationMarker.GetInteractionState
// 0x0001 (0x0001 - 0x0000)
struct JunoConversationMarker_GetInteractionState final
{
public:
	EDialogMarkerInteractionState                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationMarker.OnCanInteract
// 0x0001 (0x0001 - 0x0000)
struct JunoConversationMarker_OnCanInteract final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationOption.GetConversationOption
// 0x0068 (0x0068 - 0x0000)
struct JunoConversationOption_GetConversationOption final
{
public:
	struct FClientConversationOptionEntry         ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationOption.OnConversationOptionUpdated
// 0x0068 (0x0068 - 0x0000)
struct JunoConversationOption_OnConversationOptionUpdated final
{
public:
	struct FClientConversationOptionEntry         InOption;                                          // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationOption.OnDisplayAssetLoaded
// 0x0008 (0x0008 - 0x0000)
struct JunoConversationOption_OnDisplayAssetLoaded final
{
public:
	class UObject*                                ResolvedAsset;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationOption.OnDisplayItemDefLoaded
// 0x0008 (0x0008 - 0x0000)
struct JunoConversationOption_OnDisplayItemDefLoaded final
{
public:
	const class UItemDefinitionBase*              ResolvedItemDef;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationScreen.HandleParticipantIconChanged
// 0x0020 (0x0020 - 0x0000)
struct JunoConversationScreen_HandleParticipantIconChanged final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationScreen.OnConversationMessageUpdated
// 0x0038 (0x0038 - 0x0000)
struct JunoConversationScreen_OnConversationMessageUpdated final
{
public:
	struct FClientConversationMessage             ConversationMessage;                               // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoConversationScreen.OnParticipantIconChanged
// 0x0020 (0x0020 - 0x0000)
struct JunoConversationScreen_OnParticipantIconChanged final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoDebugWatermark.ShouldShowSeed
// 0x0001 (0x0001 - 0x0000)
struct JunoDebugWatermark_ShouldShowSeed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoDebugWatermark.GetWorldID
// 0x0010 (0x0010 - 0x0000)
struct JunoDebugWatermark_GetWorldID final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoDynamicControlPromptsWidget.AddEntry
// 0x0020 (0x0020 - 0x0000)
struct JunoDynamicControlPromptsWidget_AddEntry final
{
public:
	struct FJunoInputAlternateDisplayText         DisplayText;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoDynamicControlPromptsWidget.InitializeEntry
// 0x0028 (0x0028 - 0x0000)
struct JunoDynamicControlPromptsWidget_InitializeEntry final
{
public:
	struct FJunoInputAlternateDisplayText         DisplayText;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UUserWidget*                            EntryWidget;                                       // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.HandleCraftingSuccess
// 0x0030 (0x0030 - 0x0000)
struct JunoEnchantmentScreen_HandleCraftingSuccess final
{
public:
	struct FCraftingObjectSuccessEvent            Event;                                             // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.OnEnchantableItemSlotsCreated
// 0x0001 (0x0001 - 0x0000)
struct JunoEnchantmentScreen_OnEnchantableItemSlotsCreated final
{
public:
	bool                                          bNothingToEnchant;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.OnEnchantButtonStateChanged
// 0x0001 (0x0001 - 0x0000)
struct JunoEnchantmentScreen_OnEnchantButtonStateChanged final
{
public:
	EJunoEnchantButtonState                       InButtonState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.OnEnchantmentStationHeaderData
// 0x00F0 (0x00F0 - 0x0000)
struct JunoEnchantmentScreen_OnEnchantmentStationHeaderData final
{
public:
	struct FJunoCraftingStationUIDataEntry        InEntry;                                           // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct JunoEnchantmentScreen_OnInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.OnInventoryItemChosen
// 0x0008 (0x0008 - 0x0000)
struct JunoEnchantmentScreen_OnInventoryItemChosen final
{
public:
	const class UFortItem*                        ChosenInventoryItem;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.OnInventoryItemHovered
// 0x0008 (0x0008 - 0x0000)
struct JunoEnchantmentScreen_OnInventoryItemHovered final
{
public:
	const class UFortItem*                        HoveredInventoryItem;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.OnItemEnchanted
// 0x0018 (0x0018 - 0x0000)
struct JunoEnchantmentScreen_OnItemEnchanted final
{
public:
	const class UFortItem*                        Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortItemDefinition*              PreviewAlteration;                                 // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UpdatedAlterationIndex;                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoUI.JunoEnchantmentScreen.OnRecipeEntryHovered
// 0x0008 (0x0008 - 0x0000)
struct JunoEnchantmentScreen_OnRecipeEntryHovered final
{
public:
	class UFortAlterationItemDefinition*          PreviewEnchantment;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.OnRecipeEntrySelected
// 0x0008 (0x0008 - 0x0000)
struct JunoEnchantmentScreen_OnRecipeEntrySelected final
{
public:
	class UFortAlterationItemDefinition*          PreviewEnchantment;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.SelectInventorySlot
// 0x0008 (0x0008 - 0x0000)
struct JunoEnchantmentScreen_SelectInventorySlot final
{
public:
	class UJunoInventorySlot*                     InventorySlot;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentScreen.GetCurrentScreenState
// 0x0001 (0x0001 - 0x0000)
struct JunoEnchantmentScreen_GetCurrentScreenState final
{
public:
	EJunoEnchantmentScreenState                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentsWidget.OnEnchantmentsUpdated
// 0x0001 (0x0001 - 0x0000)
struct JunoEnchantmentsWidget_OnEnchantmentsUpdated final
{
public:
	bool                                          bHasEnchantments;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentsWidget.SetPreviewEnchantment
// 0x0008 (0x0008 - 0x0000)
struct JunoEnchantmentsWidget_SetPreviewEnchantment final
{
public:
	class UFortAlterationItemDefinition*          InEnchantment;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentsWidget.SetRepresentedItem
// 0x0008 (0x0008 - 0x0000)
struct JunoEnchantmentsWidget_SetRepresentedItem final
{
public:
	class UFortItem*                              InRepresentedItem;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoEnchantmentsWidget.SetUpdatedEnchantmentIndex
// 0x0004 (0x0004 - 0x0000)
struct JunoEnchantmentsWidget_SetUpdatedEnchantmentIndex final
{
public:
	int32                                         UpdatedIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoFolderRecipeWidget.OnSetExtraRecipesInfo
// 0x0004 (0x0004 - 0x0000)
struct JunoFolderRecipeWidget_OnSetExtraRecipesInfo final
{
public:
	int32                                         NumExtraRecipes;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoFolderRecipeWidget.OnSetRecipeInfo
// 0x0008 (0x0008 - 0x0000)
struct JunoFolderRecipeWidget_OnSetRecipeInfo final
{
public:
	const class UItemDefinitionBase*              CraftedItemDef;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoFTUEPinnedQuestInfo.HandleTrackedFTUEQuestsChanged
// 0x0008 (0x0008 - 0x0000)
struct JunoFTUEPinnedQuestInfo_HandleTrackedFTUEQuestsChanged final
{
public:
	const class UJunoControllerComponent_FTUEQuestTracker* FTUEQuestTrackerComponent;                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoFullScreenMap.IsMapTabAllowed
// 0x0001 (0x0001 - 0x0000)
struct JunoFullScreenMap_IsMapTabAllowed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoGameStateComponent_UIData.OnPlaylistDataReady
// 0x0030 (0x0030 - 0x0000)
struct JunoGameStateComponent_UIData_OnPlaylistDataReady final
{
public:
	class AFortGameStateAthena*                   GameState;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortPlaylist*                    Playlist;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoHudMenuBase.OnInitDataSet
// 0x0008 (0x0008 - 0x0000)
struct JunoHudMenuBase_OnInitDataSet final
{
public:
	class UJunoHudMenuBaseInitData*               InInitData;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoHUDMenuTabButton.GetNumUnviewedItems
// 0x0004 (0x0004 - 0x0000)
struct JunoHUDMenuTabButton_GetNumUnviewedItems final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoIngredientWidget.OnSetHasEnough
// 0x0001 (0x0001 - 0x0000)
struct JunoIngredientWidget_OnSetHasEnough final
{
public:
	bool                                          bHasEnough;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoIngredientWidget.OnSetIngredientCounts
// 0x0008 (0x0008 - 0x0000)
struct JunoIngredientWidget_OnSetIngredientCounts final
{
public:
	int32                                         OwnedCount;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequiredCount;                                     // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoIngredientWidget.OnSetIngredientData
// 0x0038 (0x0038 - 0x0000)
struct JunoIngredientWidget_OnSetIngredientData final
{
public:
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortRarity                                   ItemRarity;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EntryIndex;                                        // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ItemDescription;                                   // 0x0028(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoItemSpawnerEntrySlot.GetContextMenu
// 0x0008 (0x0008 - 0x0000)
struct JunoItemSpawnerEntrySlot_GetContextMenu final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoItemSpawnerEntrySlot.HandleOnMenuOpenChanged
// 0x0001 (0x0001 - 0x0000)
struct JunoItemSpawnerEntrySlot_HandleOnMenuOpenChanged final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoItemSpawnerEntrySlot.OnEnterContextMenuMode
// 0x0001 (0x0001 - 0x0000)
struct JunoItemSpawnerEntrySlot_OnEnterContextMenuMode final
{
public:
	bool                                          bIsCurrentlySelectedSlot;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoItemSpawnerEntrySlot.UpdateItemDisplay
// 0x0008 (0x0008 - 0x0000)
struct JunoItemSpawnerEntrySlot_UpdateItemDisplay final
{
public:
	const class UFortItemDefinition*              FortItemDefinition;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoItemSpawnerScreen.HandleTabSelected
// 0x0004 (0x0004 - 0x0000)
struct JunoItemSpawnerScreen_HandleTabSelected final
{
public:
	class FName                                   TabID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoItemSpawnerScreen.UpdateItemDetails
// 0x0008 (0x0008 - 0x0000)
struct JunoItemSpawnerScreen_UpdateItemDetails final
{
public:
	const class UFortItemDefinition*              FortItemDefinition;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoItemStatsList.GetWeaponEssencesBonusDamage
// 0x0010 (0x0010 - 0x0000)
struct JunoItemStatsList_GetWeaponEssencesBonusDamage final
{
public:
	const class UFortItem*                        WeaponItem;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoUI.JunoGuidedBuildingHudStateWidget.OnCurrentStageUpdate
// 0x0040 (0x0040 - 0x0000)
struct JunoGuidedBuildingHudStateWidget_OnCurrentStageUpdate final
{
public:
	struct FGuidedBuildingUpdate                  UpdateData;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoGuidedBuildingHudStateWidget.OnSectionComplete
// 0x0040 (0x0040 - 0x0000)
struct JunoGuidedBuildingHudStateWidget_OnSectionComplete final
{
public:
	struct FGuidedBuildingUpdate                  UpdateData;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoGuidedBuildingHudStateWidget.OnSetComplete
// 0x0040 (0x0040 - 0x0000)
struct JunoGuidedBuildingHudStateWidget_OnSetComplete final
{
public:
	struct FGuidedBuildingUpdate                  UpdateData;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoGuidedBuildingHudStateWidget.OnSnapsUpdated
// 0x0010 (0x0010 - 0x0000)
struct JunoGuidedBuildingHudStateWidget_OnSnapsUpdated final
{
public:
	TArray<int32>                                 UpdatedSnaps;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoGuidedBuildingHudStateWidget.OnStageComplete
// 0x0040 (0x0040 - 0x0000)
struct JunoGuidedBuildingHudStateWidget_OnStageComplete final
{
public:
	struct FGuidedBuildingUpdate                  UpdateData;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoSelectionModal.OnSelectionButtonCreated
// 0x0018 (0x0018 - 0x0000)
struct JunoSelectionModal_OnSelectionButtonCreated final
{
public:
	class UCommonButtonBase*                      NewButton;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   SelectionTitle;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoSelectionModal.OnSetTitleAndDescription
// 0x0020 (0x0020 - 0x0000)
struct JunoSelectionModal_OnSetTitleAndDescription final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoNPCStatusWidgetBase.OnActorHealthChanged
// 0x0008 (0x0008 - 0x0000)
struct JunoNPCStatusWidgetBase_OnActorHealthChanged final
{
public:
	float                                         NewHealth;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewMaxHealth;                                      // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoQuickBuildRadialPicker.OnQuickBuildSlotSelected
// 0x0030 (0x0030 - 0x0000)
struct JunoQuickBuildRadialPicker_OnQuickBuildSlotSelected final
{
public:
	struct FJunoQuickBuildSlotData                SelectedQuickBuildSlotData;                        // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.GetCanCraft
// 0x0001 (0x0001 - 0x0000)
struct JunoRecipeListEntry_GetCanCraft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.GetPopupMenu
// 0x0008 (0x0008 - 0x0000)
struct JunoRecipeListEntry_GetPopupMenu final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.OnCurrentStageUpdate
// 0x0040 (0x0040 - 0x0000)
struct JunoRecipeListEntry_OnCurrentStageUpdate final
{
public:
	struct FGuidedBuildingUpdate                  UpdateData;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.OnEnterContextMenuMode
// 0x0001 (0x0001 - 0x0000)
struct JunoRecipeListEntry_OnEnterContextMenuMode final
{
public:
	bool                                          bIsCurrentlySelectedSlot;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.OnLeaveContextMenuMode
// 0x0001 (0x0001 - 0x0000)
struct JunoRecipeListEntry_OnLeaveContextMenuMode final
{
public:
	bool                                          bUnselectSlot;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.OnRecipePinned
// 0x0001 (0x0001 - 0x0000)
struct JunoRecipeListEntry_OnRecipePinned final
{
public:
	bool                                          bIsPinned;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.OnSetFolderInfo
// 0x0038 (0x0038 - 0x0000)
struct JunoRecipeListEntry_OnSetFolderInfo final
{
public:
	struct FGameplayTag                           FolderTag;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FolderText;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              SourceIcon;                                        // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.OnSetRecipeInfo
// 0x00D0 (0x00D0 - 0x0000)
struct JunoRecipeListEntry_OnSetRecipeInfo final
{
public:
	const class UItemDefinitionBase*              CraftedItemDef;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CraftCount;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SourceIcon;                                        // 0x0010(0x00C0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.OnUpdateBangVisibility
// 0x0001 (0x0001 - 0x0000)
struct JunoRecipeListEntry_OnUpdateBangVisibility final
{
public:
	EJunoBangVisibility                           BangType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.SetPartsRemaining
// 0x000C (0x000C - 0x0000)
struct JunoRecipeListEntry_SetPartsRemaining final
{
public:
	struct FJunoGuidedBuildRemainingPartsInfo     RemainingParts;                                    // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoRecipeListEntry.GetKnowledgeState
// 0x0001 (0x0001 - 0x0000)
struct JunoRecipeListEntry_GetKnowledgeState final
{
public:
	EJunoKnowledgeState                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoStandaloneCraftingContainer.HandleCraftingObjectDeath
// 0x0158 (0x0158 - 0x0000)
struct JunoStandaloneCraftingContainer_HandleCraftingObjectDeath final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                Momentum;                                          // 0x0028(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitInfo;                                           // 0x0040(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AFortPawn*                              InstigatedBy;                                      // 0x0130(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0138(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0140(0x0018)(Parm, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoStandaloneCraftingContainer.HandleCraftingStationRecipeChanged
// 0x0004 (0x0004 - 0x0000)
struct JunoStandaloneCraftingContainer_HandleCraftingStationRecipeChanged final
{
public:
	class FName                                   FormulaRowName;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoUI.JunoStandaloneCraftingContainer.HandleCraftingSuccess
// 0x0030 (0x0030 - 0x0000)
struct JunoStandaloneCraftingContainer_HandleCraftingSuccess final
{
public:
