#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCoreUI

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum JunoCoreUI.EJunoPlayerCardStatus
// NumValues: 0x0004
enum class EJunoPlayerCardStatus : uint8
{
	InWorld                                  = 0,
	NotInWorld                               = 1,
	Count                                    = 2,
	EJunoPlayerCardStatus_MAX                = 3,
};

// Enum JunoCoreUI.EJunoContextMenuAction
// NumValues: 0x0013
enum class EJunoContextMenuAction : uint8
{
	None                                     = 0,
	Swap                                     = 1,
	Drop                                     = 2,
	Craft                                    = 3,
	Equip                                    = 4,
	Unequip                                  = 5,
	Split                                    = 6,
	DepositStack                             = 7,
	Deposit                                  = 8,
	TakeStack                                = 9,
	Take                                     = 10,
	MoveToInventory                          = 11,
	MoveToMainHand                           = 12,
	MoveToOffHand                            = 13,
	SmartTransfer                            = 14,
	OpenInventory                            = 15,
	Spawn                                    = 16,
	SpawnMultiple                            = 17,
	EJunoContextMenuAction_MAX               = 18,
};

// Enum JunoCoreUI.EJunoContextMenuActionState
// NumValues: 0x0004
enum class EJunoContextMenuActionState : uint8
{
	Shown                                    = 0,
	Disabled                                 = 1,
	Hidden                                   = 2,
	EJunoContextMenuActionState_MAX          = 3,
};

// Enum JunoCoreUI.EJunoWorldSettingCategory
// NumValues: 0x0004
enum class EJunoWorldSettingCategory : uint8
{
	None                                     = 0,
	Basic                                    = 1,
	Advanced                                 = 2,
	EJunoWorldSettingCategory_MAX            = 3,
};

// Enum JunoCoreUI.EJunoWorldSanctionType
// NumValues: 0x0004
enum class EJunoWorldSanctionType : uint8
{
	MultiplayerBan                           = 0,
	CompleteBan                              = 1,
	None                                     = 2,
	EJunoWorldSanctionType_MAX               = 3,
};

// Enum JunoCoreUI.EMatchmakingErrorType
// NumValues: 0x0005
enum class EMatchmakingErrorType : uint8
{
	NotEnoughWorldSpotsForParty              = 0,
	NotAllPartyMembersHaveWorldAccess        = 1,
	LookingForPartyIsEnabled                 = 2,
	None                                     = 3,
	EMatchmakingErrorType_MAX                = 4,
};

// Enum JunoCoreUI.ESanctionType
// NumValues: 0x0006
enum class ESanctionType : uint8
{
	OwnerWithoutPartyMultiplayerBan          = 0,
	OwnerWithPartyMultiplayerBan             = 1,
	KeyHolderBan                             = 2,
	CompleteBan                              = 3,
	None                                     = 4,
	ESanctionType_MAX                        = 5,
};

// ScriptStruct JunoCoreUI.JunoContextMenuInfo
// 0x0008 (0x0008 - 0x0000)
struct FJunoContextMenuInfo final
{
public:
	EJunoContextMenuAction                        MenuAction;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QuantityCount;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoCoreUI.JunoContextMenuQuantityChange
// 0x0008 (0x0008 - 0x0000)
struct FJunoContextMenuQuantityChange final
{
public:
	EJunoContextMenuAction                        MenuAction;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QuantityCount;                                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoCoreUI.JunoSettingOptionRow
// 0x0028 (0x0028 - 0x0000)
struct FJunoSettingOptionRow final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoCoreUI.JunoSettingDataRow
// 0x0040 (0x0048 - 0x0008)
struct FJunoSettingDataRow final : public FTableRowBase
{
public:
	class FText                                   SettingName;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EJunoWorldSettingCategory                     category;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 DefaultOptionPerMode;                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoSettingOptionRow>          Options;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCanBeLocked;                                      // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoCoreUI.JunoWorldImageDataRow
// 0x0020 (0x0028 - 0x0008)
struct FJunoWorldImageDataRow final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UTexture2D>              WorldImage;                                        // 0x0008(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

