#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoCreature_TamingRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "DataRegistry_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "JunoCreature_TamingRuntime_structs.hpp"
#include "WorldConditions_classes.hpp"


namespace SDK
{

// Class JunoCreature_TamingRuntime.JunoAnimalProcessorComponent
// 0x0078 (0x0118 - 0x00A0)
class UJunoAnimalProcessorComponent final : public UGameFrameworkComponent
{
public:
	class UJunoAnimalProcessorFriendshipModifierMappings* DefaultFriendshipModifiers;                // 0x00A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataRegistryType                      AnimalProcessorConfigRegistryType;                 // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  UnassignedCraftingTags;                            // 0x00B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           AssignedAnimalDescriptorTag;                       // 0x00D0(0x0004)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AssignedFriendshipStateTag;                        // 0x00D8(0x0004)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentCraftingSpeedModifier;                      // 0x00DC(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x38];                                      // 0x00E0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnimalProcessorComponent">();
	}
	static class UJunoAnimalProcessorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimalProcessorComponent>();
	}
};

// Class JunoCreature_TamingRuntime.JunoAnimalProcessorFriendshipModifierMappings
// 0x0050 (0x0080 - 0x0030)
class UJunoAnimalProcessorFriendshipModifierMappings final : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FDataTableRowHandle> FriendshipModifierMap;                     // 0x0030(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnimalProcessorFriendshipModifierMappings">();
	}
	static class UJunoAnimalProcessorFriendshipModifierMappings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimalProcessorFriendshipModifierMappings>();
	}
};

// Class JunoCreature_TamingRuntime.JunoAnimalProcessorWorldConditionSchema
// 0x0008 (0x0040 - 0x0038)
class UJunoAnimalProcessorWorldConditionSchema final : public UWorldConditionSchema
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoAnimalProcessorWorldConditionSchema">();
	}
	static class UJunoAnimalProcessorWorldConditionSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoAnimalProcessorWorldConditionSchema>();
	}
};

// Class JunoCreature_TamingRuntime.JunoBarnAssignmentMenuInitData
// 0x0028 (0x0050 - 0x0028)
class UJunoBarnAssignmentMenuInitData final : public UObject
{
public:
	class AActor*                                 BarnActor;                                         // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 AnimalActor;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBarnAssignmentMode                       BarnAssignmentMode;                                // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           UniqueAIIdentifier;                                // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ExistingName;                                      // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoBarnAssignmentMenuInitData">();
	}
	static class UJunoBarnAssignmentMenuInitData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoBarnAssignmentMenuInitData>();
	}
};

// Class JunoCreature_TamingRuntime.JunoControllerComponent_Taming
// 0x0038 (0x00E0 - 0x00A8)
class UJunoControllerComponent_Taming final : public UFortControllerComponent
{
public:
	uint8                                         Pad_A8[0x30];                                      // 0x00A8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FollowingAnimalAIDescriptorTag;                    // 0x00D8(0x0004)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_HandleBarnInteractionEnded();
	void BP_HandleBarnInteractionStarted();
	void OnConvertFollowingAnimal(class AFortPawn* ConvertedPawn);
	void OnRep_FollowingAnimalAIDescriptorTag();
	void OnUnconvertFollowingAnimal(class AFortPawn* UnconvertedPawn, EUnconvertReason UnconvertReason);
	void Server_AssignAnimalToBarn(const class AFortPlayerController* TriggeringPlayer, class AActor* BarnActor, class AActor* AnimalActor, const class FText& CustomName);
	void Server_BarnInteractionEnded();
	void Server_BarnInteractionStarted();
	void Server_ReassignAnimalToBarn(const class AFortPlayerController* TriggeringPlayer, class AActor* BarnActor, const struct FGameplayTag& UniqueAIIdentifier, const class FText& ExistingName);
	void Server_RenameAnimal(const class AFortPlayerController* TriggeringPlayer, const struct FGameplayTag& UniqueAIIdentifier, const class FText& NewName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerComponent_Taming">();
	}
	static class UJunoControllerComponent_Taming* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerComponent_Taming>();
	}
};

}

