#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoFrontendUI

#include "Basic.hpp"

#include "ModelViewViewModel_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "EpicMediaBasePlayer_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// Class JunoFrontendUI.JunoFrontendExperienceFlow
// 0x00E0 (0x0108 - 0x0028)
class UJunoFrontendExperienceFlow final : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   VideoPlayerClass;                                  // 0x0060(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         FlowStepArray;                                     // 0x0080(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	bool                                          bEnableTrailer;                                    // 0x0090(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CinematicTrailerVUID;                              // 0x0098(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CinematicTrailerString;                            // 0x00A8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            CinematicTrailerRating;                            // 0x00B0(0x0050)(Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleFinishTrailerStep();
	void HandleTrailerTerminalError(EBaseMediaTerminalErrorReason Reason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoFrontendExperienceFlow">();
	}
	static class UJunoFrontendExperienceFlow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoFrontendExperienceFlow>();
	}
};

// Class JunoFrontendUI.MatchmakingWidgetErrorVisualsForJuno
// 0x0000 (0x0068 - 0x0068)
class UMatchmakingWidgetErrorVisualsForJuno final : public UMatchmakingWidgetErrorVisualsContainer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchmakingWidgetErrorVisualsForJuno">();
	}
	static class UMatchmakingWidgetErrorVisualsForJuno* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchmakingWidgetErrorVisualsForJuno>();
	}
};

// Class JunoFrontendUI.JunoMatchmakingUtilityExtension
// 0x0000 (0x0028 - 0x0028)
class UJunoMatchmakingUtilityExtension final : public UMatchmakingUtilityExtensionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMatchmakingUtilityExtension">();
	}
	static class UJunoMatchmakingUtilityExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMatchmakingUtilityExtension>();
	}
};

// Class JunoFrontendUI.JunoMatchmakingWidgetExtension
// 0x0020 (0x0048 - 0x0028)
class UJunoMatchmakingWidgetExtension final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortActivityModeSetSelectionModalBase> GameSelectionOverride;                 // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>                CustomHeadingWidget;                               // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayGameSelectionOnContentStack;               // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMatchmakingWidgetExtension">();
	}
	static class UJunoMatchmakingWidgetExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMatchmakingWidgetExtension>();
	}
};

// Class JunoFrontendUI.JunoTabGroupButtonViewModel
// 0x0000 (0x0090 - 0x0090)
class UJunoTabGroupButtonViewModel final : public UUIKitTabGroupButtonViewModel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoTabGroupButtonViewModel">();
	}
	static class UJunoTabGroupButtonViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoTabGroupButtonViewModel>();
	}
};

// Class JunoFrontendUI.JunoWorldManagementViewModel
// 0x00E0 (0x0148 - 0x0068)
class UJunoWorldManagementViewModel final : public UMVVMViewModelBase
{
public:
	bool                                          bAllowWorldCreation;                               // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxWorldSlots;                                     // 0x006C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowWorldUGCCreation;                            // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowDefaultWorldName;                             // 0x0071(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsModeratorModeEnabled;                           // 0x0072(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWorldLoadingSuccess;                              // 0x0073(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInCabinMode;                                    // 0x0074(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoWorldDataViewModel*>        OwnerWorlds;                                       // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UJunoWorldDataViewModel*>        SharedWorlds;                                      // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UJunoWorldDataViewModel*>        WorldSlots;                                        // 0x0098(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UJunoWorldDataViewModel*                SelectedWorld;                                     // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UJunoWorldDataViewModel*                EmptyWorld;                                        // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DataRefreshFrequency;                              // 0x00D0(0x0004)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0x54];                                      // 0x00D4(0x0054)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             SettingDataTable;                                  // 0x0128(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UJunoWorldImageObject*>          WorldImageList;                                    // 0x0130(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UJunoWorldDataViewModel*                InitWorldManagementVM;                             // 0x0140(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DisableDataRefresh();
	void EnableDataRefresh();
	void FetchWorldData();
	class UJunoWorldDataViewModel* InitWorldData(const TSoftObjectPtr<class UDataTable>& InSettingDataTable, const TSoftObjectPtr<class UDataTable>& InWorldImageDataTable);
	void RemoveSelectedWorldFromList();
	void StartMatchmakingInModeratorMode(const class FString& InWorldId);

	bool GetIsCreateFlowSelected() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoWorldManagementViewModel">();
	}
	static class UJunoWorldManagementViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoWorldManagementViewModel>();
	}
};

}

