#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoMusicRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "JunoMusicRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameFeatures_classes.hpp"
#include "MetasoundFrontend_structs.hpp"


namespace SDK
{

// Class JunoMusicRuntime.ActiveJunoMusicPlayer
// 0x0188 (0x01B0 - 0x0028)
class UActiveJunoMusicPlayer final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CooldownTimer;                                     // 0x0088(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x10];                                      // 0x0090(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundBase*>                     LoadedMusicAssets;                                 // 0x00A0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UJunoMusicPlaylistDataAsset>> JunoMusicElementsToCreate;             // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoActiveMusicElementController_Base* PlayingActiveMusicElementController;               // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoMusicPlaybackConditionsPool*       PlaybackConditionsPool;                            // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UJunoMusicPlaylistDataAsset*, struct FElementControllerArray> AllActiveMusicElementControllers; // 0x00F0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<class UJunoMusicPlaylistDataAsset*>    JunoMusicPlaylistCollection;                       // 0x0140(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UJunoActiveMusicCooldownGroup*> JunoMusicCooldownGroups;                 // 0x0160(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void OnActiveMusicElementControllerFinishedPlaying();
	void OnActiveMusicPlayerCooldownFinished();
	void OnDayNightPhaseChangeSignature(EFortDayPhase CurrentDayPhaseIn, EFortDayPhase PreviousDayPhaseIn, bool bAtCreationIn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActiveJunoMusicPlayer">();
	}
	static class UActiveJunoMusicPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActiveJunoMusicPlayer>();
	}
};

// Class JunoMusicRuntime.GameFeatureAction_BindJunoMusicManagerToPostWorldInit
// 0x0010 (0x0038 - 0x0028)
class UGameFeatureAction_BindJunoMusicManagerToPostWorldInit final : public UGameFeatureAction
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_BindJunoMusicManagerToPostWorldInit">();
	}
	static class UGameFeatureAction_BindJunoMusicManagerToPostWorldInit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_BindJunoMusicManagerToPostWorldInit>();
	}
};

// Class JunoMusicRuntime.GameFeatureAction_RegisterJunoMusicDataAggregatorSettings
// 0x0020 (0x0048 - 0x0028)
class UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings final : public UGameFeatureAction
{
public:
	TArray<struct FSoftObjectPath>                JunoMusicDataAggregatorSettings;                   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterJunoMusicDataAggregatorSettings">();
	}
	static class UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterJunoMusicDataAggregatorSettings>();
	}
};

// Class JunoMusicRuntime.GameFeatureAction_RegisterJunoMusicElementTable
// 0x0060 (0x0088 - 0x0028)
class UGameFeatureAction_RegisterJunoMusicElementTable final : public UGameFeatureAction
{
public:
	TMap<struct FSoftObjectPath, struct FGameplayTagQuery> JunoMusicElementDataTables;               // 0x0028(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterJunoMusicElementTable">();
	}
	static class UGameFeatureAction_RegisterJunoMusicElementTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterJunoMusicElementTable>();
	}
};

// Class JunoMusicRuntime.GameFeatureAction_RegisterJunoMusicPlayspaceProbes
// 0x0020 (0x0048 - 0x0028)
class UGameFeatureAction_RegisterJunoMusicPlayspaceProbes final : public UGameFeatureAction
{
public:
	TArray<struct FSoftObjectPath>                JunoMusicProbesDataAssets;                         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterJunoMusicPlayspaceProbes">();
	}
	static class UGameFeatureAction_RegisterJunoMusicPlayspaceProbes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterJunoMusicPlayspaceProbes>();
	}
};

// Class JunoMusicRuntime.JunoActiveMusicCue
// 0x0098 (0x00C0 - 0x0028)
class UJunoActiveMusicCue final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundBase*                             LoadedMusic;                                       // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetasoundGeneratorHandle*              MetasoundGeneratorHandle;                          // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x40];                                      // 0x0080(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicCue">();
	}
	static class UJunoActiveMusicCue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicCue>();
	}
};

// Class JunoMusicRuntime.JunoActiveMusicCooldownGroup
// 0x0030 (0x0058 - 0x0028)
class UJunoActiveMusicCooldownGroup final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CooldownTimer;                                     // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicCooldownGroup">();
	}
	static class UJunoActiveMusicCooldownGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicCooldownGroup>();
	}
};

// Class JunoMusicRuntime.JunoActiveMusicElement_Base
// 0x00C8 (0x00F0 - 0x0028)
class UJunoActiveMusicElement_Base : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoMusicPlaylistElement              JunoMusicPlaylistElement;                          // 0x0038(0x00B8)(Transient, NativeAccessSpecifierPublic)

public:
	void OnFinishedPlaying();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElement_Base">();
	}
	static class UJunoActiveMusicElement_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElement_Base>();
	}
};

// Class JunoMusicRuntime.JunoActiveMusicElement_AudioComponent
// 0x0038 (0x0128 - 0x00F0)
class UJunoActiveMusicElement_AudioComponent final : public UJunoActiveMusicElement_Base
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x00F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             Music;                                             // 0x00F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x18];                                     // 0x0100(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetasoundGeneratorHandle*              MetasoundGeneratorHandle;                          // 0x0118(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElement_AudioComponent">();
	}
	static class UJunoActiveMusicElement_AudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElement_AudioComponent>();
	}
};

// Class JunoMusicRuntime.JunoActiveMusicElementController_Base
// 0x00E8 (0x0110 - 0x0028)
class UJunoActiveMusicElementController_Base : public UObject
{
public:
	struct FTimerHandle                           CooldownTimer;                                     // 0x0028(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SchedulingTimer;                                   // 0x0040(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             OnJunoActiveMusicElementControllerFinishedPlaying; // 0x0058(0x000C)(ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x1C];                                      // 0x0064(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	EJunoActiveMusicElementState                  JunoActiveMusicElementState;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoActiveMusicElement_Base*           JunoActiveMusicElement;                            // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UJunoMusicPlaybackCondition>> JunoMusicPlaybackConditions;              // 0x0090(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CooldownGroups;                                    // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x40];                                      // 0x00D0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElementController_Base">();
	}
	static class UJunoActiveMusicElementController_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElementController_Base>();
	}
};

// Class JunoMusicRuntime.JunoActiveMusicElementController_DayPhaseOffset
// 0x0000 (0x0110 - 0x0110)
class UJunoActiveMusicElementController_DayPhaseOffset final : public UJunoActiveMusicElementController_Base
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElementController_DayPhaseOffset">();
	}
	static class UJunoActiveMusicElementController_DayPhaseOffset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElementController_DayPhaseOffset>();
	}
};

// Class JunoMusicRuntime.JunoActiveMusicElementController_RandomTimeInDayPhase
// 0x0000 (0x0110 - 0x0110)
class UJunoActiveMusicElementController_RandomTimeInDayPhase final : public UJunoActiveMusicElementController_Base
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElementController_RandomTimeInDayPhase">();
	}
	static class UJunoActiveMusicElementController_RandomTimeInDayPhase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElementController_RandomTimeInDayPhase>();
	}
};

// Class JunoMusicRuntime.JunoActiveMusicElementController_RandomTimeInDay
// 0x0010 (0x0120 - 0x0110)
class UJunoActiveMusicElementController_RandomTimeInDay final : public UJunoActiveMusicElementController_Base
{
public:
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElementController_RandomTimeInDay">();
	}
	static class UJunoActiveMusicElementController_RandomTimeInDay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElementController_RandomTimeInDay>();
	}
};

// Class JunoMusicRuntime.JunoActiveMusicElementController_CustomBPCondition
// 0x0030 (0x0140 - 0x0110)
class UJunoActiveMusicElementController_CustomBPCondition final : public UJunoActiveMusicElementController_Base
{
public:
	struct FTimerHandle                           UpdateTimerHandle;                                 // 0x0110(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x20];                                     // 0x0118(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          RandomStream;                                      // 0x0138(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoActiveMusicElementController_CustomBPCondition">();
	}
	static class UJunoActiveMusicElementController_CustomBPCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoActiveMusicElementController_CustomBPCondition>();
	}
};

// Class JunoMusicRuntime.JunoMusicControllerSubsystem
// 0x0038 (0x0068 - 0x0030)
class UJunoMusicControllerSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoMusicElementController*            MusicCueController;                                // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UJunoMusicDataAggregator*               JunoMusicDataAggregator;                           // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void PushMusicState(const struct FGameplayTag& InState);
	void PushMusicStates(const struct FGameplayTagContainer& InStates);
	void RemoveMusicState(const struct FGameplayTag& InState);
	void RemoveMusicStates(const struct FGameplayTagContainer& InStates);

	bool GetCollectedBool(class FName ParameterName, ESetParamResult* Result) const;
	float GetCollectedFloat(class FName ParameterName, ESetParamResult* Result) const;
	int32 GetCollectedInt(class FName ParameterName, ESetParamResult* Result) const;
	class FString GetCollectedString(class FName ParameterName, ESetParamResult* Result) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicControllerSubsystem">();
	}
	static class UJunoMusicControllerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicControllerSubsystem>();
	}
};

// Class JunoMusicRuntime.JunoMusicDataCollector
// 0x0000 (0x0028 - 0x0028)
class UJunoMusicDataCollector : public UObject
{
public:
	void BP_OnRegistered(class UMetasoundParameterPack* AggregatedData);
	void BP_OnUnregistered();
	void BP_OnUpdate(float DeltaSeconds, class UMetasoundParameterPack* AggregatedData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicDataCollector">();
	}
	static class UJunoMusicDataCollector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicDataCollector>();
	}
};

// Class JunoMusicRuntime.JunoMusicDataAggregatorConfig
// 0x0010 (0x0040 - 0x0030)
class UJunoMusicDataAggregatorConfig final : public UPrimaryDataAsset
{
public:
	struct FJunoMusicDataAggregatorSettings       DataAggregatorSettings;                            // 0x0030(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicDataAggregatorConfig">();
	}
	static class UJunoMusicDataAggregatorConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicDataAggregatorConfig>();
	}
};

// Class JunoMusicRuntime.JunoMusicDataAggregator
// 0x0038 (0x0060 - 0x0028)
class UJunoMusicDataAggregator final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoMusicDataCollector*>        DataCollectors;                                    // 0x0048(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMetasoundParameterPack*                AggregatedData;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicDataAggregator">();
	}
	static class UJunoMusicDataAggregator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicDataAggregator>();
	}
};

// Class JunoMusicRuntime.JunoMusicDataCollector_Combat
// 0x0038 (0x0060 - 0x0028)
class UJunoMusicDataCollector_Combat final : public UJunoMusicDataCollector
{
public:
	TArray<class UFortGameplayDataTrackerComponent*> RegisteredDataTrackerComponents;                // 0x0028(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           NumAggressiveEnemiesTag;                           // 0x0038(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           NumAggressiveCreaturesTag;                         // 0x003C(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           NumAggressiveMinifigsTag;                          // 0x0040(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   IsInCombatParameterName;                           // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CombatThreatLevelParameterName;                    // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MinifigWeightParameterName;                        // 0x004C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   CreatureWeightParameterName;                       // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDebug;                                            // 0x0058(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetThreatLevelMultiplier(const float InThreatLevelMultiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicDataCollector_Combat">();
	}
	static class UJunoMusicDataCollector_Combat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicDataCollector_Combat>();
	}
};

// Class JunoMusicRuntime.JunoMusicElementController
// 0x01B8 (0x01E0 - 0x0028)
class UJunoMusicElementController final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UDataTable*, struct FGameplayTagQuery> ElementTables;                                 // 0x0038(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FJunoActiveMusicElement>        ActiveMusicElements;                               // 0x0088(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UJunoActiveMusicCue*> ActiveMusicElementsMap;                    // 0x0098(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0xF8];                                      // 0x00E8(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicElementController">();
	}
	static class UJunoMusicElementController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicElementController>();
	}
};

// Class JunoMusicRuntime.JunoMusicManager
// 0x0168 (0x0198 - 0x0030)
class UJunoMusicManager final : public UGameInstanceSubsystem
{
public:
	TArray<class UJunoMusicPlaylistDataAsset*>    JunoMusicPlaylistCollections;                      // 0x0030(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class UWorld*, struct FJunoWorldMusicSystem> WorldMusicSystems;                             // 0x0040(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x108];                                     // 0x0090(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddJunoMusicPlaylist(class UJunoMusicPlaylistDataAsset* JunoMusicPlaylist);
	void RemoveJunoMusicPlaylist(class UJunoMusicPlaylistDataAsset* JunoMusicPlaylist);
	void SetActiveJunoMusicManagerData(const struct FActiveJunoMusicManagerData& ActiveJunoMusicManagerDataIn);
	void SetSuspendActiveMusicPlayback(bool bSuspendPlayback, bool bStopCurrentlyPlayingMusic);
	void SetSuspendWorldActiveMusicPlayback(class UWorld* World, bool bSuspendPlayback, bool bStopCurrentlyPlayingMusic);
	void StartWorldMusicSystem(class UWorld* World);
	void StopWorldMusicSystem(class UWorld* World);

	bool GetCollectedBool(class UObject* WorldContextObject, class FName ParameterName, ESetParamResult* Result) const;
	float GetCollectedFloat(class UObject* WorldContextObject, class FName ParameterName, ESetParamResult* Result) const;
	int32 GetCollectedInt(class UObject* WorldContextObject, class FName ParameterName, ESetParamResult* Result) const;
	class FString GetCollectedString(class UObject* WorldContextObject, class FName ParameterName, ESetParamResult* Result) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicManager">();
	}
	static class UJunoMusicManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicManager>();
	}
};

// Class JunoMusicRuntime.JunoMusicPlaybackConditionsPool
// 0x0010 (0x0038 - 0x0028)
class UJunoMusicPlaybackConditionsPool final : public UObject
{
public:
	TArray<class UJunoMusicPlaybackCondition*>    CachedPlaybackConditions;                          // 0x0028(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlaybackConditionsPool">();
	}
	static class UJunoMusicPlaybackConditionsPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlaybackConditionsPool>();
	}
};

// Class JunoMusicRuntime.JunoMusicPlaybackCondition
// 0x0008 (0x0030 - 0x0028)
class UJunoMusicPlaybackCondition final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnRegistered();
	void BP_OnUnregistered();
	bool BP_ShouldPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlaybackCondition">();
	}
	static class UJunoMusicPlaybackCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlaybackCondition>();
	}
};

// Class JunoMusicRuntime.JunoMusicPlaylistDataAsset
// 0x0078 (0x00A8 - 0x0030)
class UJunoMusicPlaylistDataAsset final : public UPrimaryDataAsset
{
public:
	struct FJunoMusicPlaylist                     JunoMusicPlaylist;                                 // 0x0030(0x0078)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlaylistDataAsset">();
	}
	static class UJunoMusicPlaylistDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlaylistDataAsset>();
	}
};

// Class JunoMusicRuntime.JunoMusicPlayspaceProbe
// 0x0000 (0x0028 - 0x0028)
class UJunoMusicPlayspaceProbe : public UObject
{
public:
	void BP_OnRegistered();
	void BP_OnUnregistered();
	void BP_OnUpdate(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlayspaceProbe">();
	}
	static class UJunoMusicPlayspaceProbe* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlayspaceProbe>();
	}
};

// Class JunoMusicRuntime.JunoMusicPlayspaceProbeSubsystem
// 0x0038 (0x0068 - 0x0030)
class UJunoMusicPlayspaceProbeSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UJunoMusicPlayspaceProbe*>       DataProbes;                                        // 0x0058(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlayspaceProbeSubsystem">();
	}
	static class UJunoMusicPlayspaceProbeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlayspaceProbeSubsystem>();
	}
};

// Class JunoMusicRuntime.JunoMusicPlayspaceProbeDataAsset
// 0x0010 (0x0040 - 0x0030)
class UJunoMusicPlayspaceProbeDataAsset final : public UPrimaryDataAsset
{
public:
	struct FJunoMusicPlayspaceProbeData           JunoMusicProbes;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlayspaceProbeDataAsset">();
	}
	static class UJunoMusicPlayspaceProbeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlayspaceProbeDataAsset>();
	}
};

// Class JunoMusicRuntime.JunoMusicPlayspaceProbe_Combat
// 0x0018 (0x0040 - 0x0028)
class UJunoMusicPlayspaceProbe_Combat final : public UJunoMusicPlayspaceProbe
{
public:
	class FName                                   IsInCombatParameterName;                           // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           CombatMusicStateTag;                               // 0x002C(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlayspaceProbe_Combat">();
	}
	static class UJunoMusicPlayspaceProbe_Combat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlayspaceProbe_Combat>();
	}
};

// Class JunoMusicRuntime.JunoMusicPlayspaceProbe_Environment
// 0x00B8 (0x00E0 - 0x0028)
class UJunoMusicPlayspaceProbe_Environment final : public UJunoMusicPlayspaceProbe
{
public:
	uint8                                         Pad_28[0xB8];                                      // 0x0028(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CacheFortPlayerPawn(class AFortPawn* NewPawn);
	void HandleEnvironmentChanged(const class AActor* Actor, const struct FJunoBiomeInfoQueryResult& PreviousEnvironmentResult, const struct FJunoBiomeInfoQueryResult& NewEnvironmentResult);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoMusicPlayspaceProbe_Environment">();
	}
	static class UJunoMusicPlayspaceProbe_Environment* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoMusicPlayspaceProbe_Environment>();
	}
};

// Class JunoMusicRuntime.GameFeatureAction_AddJunoMusicPlaylist
// 0x0028 (0x0050 - 0x0028)
class UGameFeatureAction_AddJunoMusicPlaylist final : public UGameFeatureAction
{
public:
	struct FSoftObjectPath                        JunoMusicPlaylist;                                 // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_AddJunoMusicPlaylist">();
	}
	static class UGameFeatureAction_AddJunoMusicPlaylist* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddJunoMusicPlaylist>();
	}
};

// Class JunoMusicRuntime.GameFeatureAction_SetActiveJunoMusicManagerData
// 0x0010 (0x0038 - 0x0028)
class UGameFeatureAction_SetActiveJunoMusicManagerData final : public UGameFeatureAction
{
public:
	struct FActiveJunoMusicManagerData            ActiveJunoMusicManagerData;                        // 0x0028(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_SetActiveJunoMusicManagerData">();
	}
	static class UGameFeatureAction_SetActiveJunoMusicManagerData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_SetActiveJunoMusicManagerData>();
	}
};

}

