#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoMusicRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum JunoMusicRuntime.EJunoActiveMusicElementState
// NumValues: 0x0005
enum class EJunoActiveMusicElementState : uint8
{
	Inactive                                 = 0,
	Scheduled                                = 1,
	Active                                   = 2,
	CoolingDown                              = 3,
	EJunoActiveMusicElementState_MAX         = 4,
};

// Enum JunoMusicRuntime.EJunoMusicCueSelectionBehavior
// NumValues: 0x0005
enum class EJunoMusicCueSelectionBehavior : uint8
{
	Sequential                               = 0,
	Shuffle                                  = 1,
	Random                                   = 2,
	Count                                    = 3,
	EJunoMusicCueSelectionBehavior_MAX       = 4,
};

// Enum JunoMusicRuntime.EMusicScheduleMode
// NumValues: 0x0006
enum class EMusicScheduleMode : uint8
{
	RelativeToDayPhaseChange                 = 0,
	RandomTimeDuringDayPhase                 = 1,
	PlayAtSpecificTimesOfDay                 = 2,
	OnlyBlueprintPlaybackConditions          = 3,
	Count                                    = 4,
	EMusicScheduleMode_MAX                   = 5,
};

// ScriptStruct JunoMusicRuntime.ElementControllerArray
// 0x0010 (0x0010 - 0x0000)
struct FElementControllerArray final
{
public:
	TArray<class UJunoActiveMusicElementController_Base*> ElementControllerArray;                    // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoMusicDataAggregatorSettings
// 0x0010 (0x0010 - 0x0000)
struct FJunoMusicDataAggregatorSettings final
{
public:
	TArray<TSubclassOf<class UJunoMusicDataCollector>> JunoMusicDataCollectors;                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoActiveMusicElement
// 0x0020 (0x0020 - 0x0000)
struct FJunoActiveMusicElement final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UJunoActiveMusicCue*                    MusicCue;                                          // 0x0018(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoMusicElementData
// 0x00E8 (0x00F0 - 0x0008)
struct FJunoMusicElementData final : public FTableRowBase
{
public:
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ElementName;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      ElementConditions;                                 // 0x0010(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      StatePushConditions;                               // 0x0058(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                MusicCues;                                         // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EJunoMusicCueSelectionBehavior                CueSelectionBehavior;                              // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              FadeInOutValues;                                   // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackPriority;                                  // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackProbabilityPercent;                        // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopOnInvalidConditions;                          // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ElementCooldownInSeconds;                          // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReceiveAggregatedData;                            // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoMusicRuntime.JunoWorldMusicSystem
// 0x0018 (0x0018 - 0x0000)
struct FJunoWorldMusicSystem final
{
public:
	class UActiveJunoMusicPlayer*                 ActiveJunoMusicPlayer;                             // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoMusicDataAggregator*               JunoMusicDataAggregator;                           // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoMusicRuntime.ActiveJunoMusicManagerData
// 0x0010 (0x0010 - 0x0000)
struct FActiveJunoMusicManagerData final
{
public:
	struct FVector2D                              MainCooldownTimeInSeconds;                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoMusicPlaylistElement
// 0x00B8 (0x00B8 - 0x0000)
struct FJunoMusicPlaylistElement final
{
public:
	struct FSoftObjectPath                        Music;                                             // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              FadeInOutValues;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMusicScheduleMode                            MusicScheduleMode;                                 // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RangeInSeconds;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortDayPhase                                 DayPhase;                                          // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RangeInGameHours;                                  // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateAtTickRate;                                 // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              UpdatePeriodRange;                                 // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UJunoMusicPlaybackCondition>> CustomPlaybackConditions;                 // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bFlipPlaybackConditions;                           // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackProbabilityPercent;                        // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackPriority;                                  // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterruptible;                                    // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PlaybackCooldownInSeconds;                         // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetCooldownOnFalseConditions;                   // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CooldownGroupNames;                                // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoMusicPlaylist
// 0x0078 (0x0078 - 0x0000)
struct FJunoMusicPlaylist final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoMusicPlaylistElement>      MusicPlaylist;                                     // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVector2D>           CooldownGroups;                                    // 0x0018(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FJunoMusicDataAggregatorSettings       DataAggregatorSettings;                            // 0x0068(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoMusicRuntime.JunoMusicPlayspaceProbeData
// 0x0010 (0x0010 - 0x0000)
struct FJunoMusicPlayspaceProbeData final
{
public:
	TArray<TSubclassOf<class UJunoMusicPlayspaceProbe>> JunoMusicPlayspaceProbes;                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

}

