#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoGameNative

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayGraph_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CraftingRuntime_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GeometryCollectionEngine_structs.hpp"


namespace SDK::Params
{

// Function JunoGameNative.JunoPlayerPersistenceComponent.OnAnyPlayerLoggedIn
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerPersistenceComponent_OnAnyPlayerLoggedIn final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerPersistenceComponent.OnControllerBeginDestroy
// 0x0008 (0x0008 - 0x0000)
struct JunoPlayerPersistenceComponent_OnControllerBeginDestroy final
{
public:
	class AFortPlayerControllerAthena*            FortPCAthena;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingTrackedActorInterface.GetNetRelevanceDistanceOverride
// 0x0004 (0x0004 - 0x0000)
struct JunoBuildingTrackedActorInterface_GetNetRelevanceDistanceOverride final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingTrackedActorInterface.GetNumberOfRelevantActors
// 0x0004 (0x0004 - 0x0000)
struct JunoBuildingTrackedActorInterface_GetNumberOfRelevantActors final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingTrackedActorInterface.ShouldBeTrackedByMetrics
// 0x0001 (0x0001 - 0x0000)
struct JunoBuildingTrackedActorInterface_ShouldBeTrackedByMetrics final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingGameplayActor.BlueprintCanDropResourceOnDeath
// 0x0001 (0x0001 - 0x0000)
struct JunoBuildingGameplayActor_BlueprintCanDropResourceOnDeath final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingGameplayActor.BlueprintCanDropResourceWithTagOnDeath
// 0x0008 (0x0008 - 0x0000)
struct JunoBuildingGameplayActor_BlueprintCanDropResourceWithTagOnDeath final
{
public:
	struct FGameplayTag                           ResourceTag;                                       // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoBuildingGameplayActor.SetAssociatedItem
// 0x0008 (0x0008 - 0x0000)
struct JunoBuildingGameplayActor_SetAssociatedItem final
{
public:
	const class UItemDefinitionBase*              Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingGameplayActor.BlueprintCanDropItemOnDestroy
// 0x0001 (0x0001 - 0x0000)
struct JunoBuildingGameplayActor_BlueprintCanDropItemOnDestroy final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingGameplayActor.GetAssociatedItem
// 0x0008 (0x0008 - 0x0000)
struct JunoBuildingGameplayActor_GetAssociatedItem final
{
public:
	const class UItemDefinitionBase*              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingGameplayActor.HasBeenMigrated
// 0x0001 (0x0001 - 0x0000)
struct JunoBuildingGameplayActor_HasBeenMigrated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnEnergyDrained
// 0x0008 (0x0008 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_OnEnergyDrained final
{
public:
	class UFortComponent_Energy*                  EnergyComponentDrained;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnEnergyFullyRecharged
// 0x0008 (0x0008 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_OnEnergyFullyRecharged final
{
public:
	class UFortComponent_Energy*                  EnergyComponentRecharged;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.OnPlayerHit
// 0x0118 (0x0118 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_OnPlayerHit final
{
public:
	class AActor*                                 HitPlayer;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 HitActor;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0028(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAbility_PlayerPushPhysicsObject.GetMontageToPlay
// 0x0008 (0x0008 - 0x0000)
struct JunoAbility_PlayerPushPhysicsObject_GetMontageToPlay final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAthenaCharacterItemOverrideDefinition.SetBaseAthenaCharacterItemDefinition
// 0x0020 (0x0020 - 0x0000)
struct JunoAthenaCharacterItemOverrideDefinition_SetBaseAthenaCharacterItemDefinition final
{
public:
	TSoftObjectPtr<class UAthenaCharacterItemDefinition> InBaseAthenaCharacterItemDefinition;        // 0x0000(0x0020)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAthenaDanceItemOverrideDefinition.SetBaseAthenaDanceItemDefinition
// 0x0020 (0x0020 - 0x0000)
struct JunoAthenaDanceItemOverrideDefinition_SetBaseAthenaDanceItemDefinition final
{
public:
	TSoftObjectPtr<class UAthenaDanceItemDefinition> InBaseAthenaDanceItemDefinition;                // 0x0000(0x0020)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoActorAttributeOverrideComponent.GetPrimaryLootTier
// 0x0004 (0x0004 - 0x0000)
struct JunoActorAttributeOverrideComponent_GetPrimaryLootTier final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoActorAttributeOverrideComponent.GetSecondaryLootTier
// 0x0004 (0x0004 - 0x0000)
struct JunoActorAttributeOverrideComponent_GetSecondaryLootTier final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPawnComponent_EmotionalState.HandleJunoAwesomeLevelChanged
// 0x0018 (0x0018 - 0x0000)
struct JunoPawnComponent_EmotionalState_HandleJunoAwesomeLevelChanged final
{
public:
	struct FJunoAwesomeLevelChangeData            ChangeData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPawnComponent_EmotionalState.SetCurrentEmotionalState
// 0x0001 (0x0001 - 0x0000)
struct JunoPawnComponent_EmotionalState_SetCurrentEmotionalState final
{
public:
	EJunoPawnEmotionalState                       NewEmotion;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPawnComponent_EmotionalState.SetEmotionalState
// 0x0010 (0x0010 - 0x0000)
struct JunoPawnComponent_EmotionalState_SetEmotionalState final
{
public:
	struct FJunoEmotionalStateData                Emotion;                                           // 0x0000(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPawnComponent_EmotionalState.GetCurrentEmotionalState
// 0x0001 (0x0001 - 0x0000)
struct JunoPawnComponent_EmotionalState_GetCurrentEmotionalState final
{
public:
	EJunoPawnEmotionalState                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPawnComponent_EmotionalState.GetCurrentEmotionalStateValue
// 0x0004 (0x0004 - 0x0000)
struct JunoPawnComponent_EmotionalState_GetCurrentEmotionalStateValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAlterationCraftingComponent.HandleCraftingStateChanged
// 0x0028 (0x0028 - 0x0000)
struct JunoAlterationCraftingComponent_HandleCraftingStateChanged final
{
public:
	struct FCraftingObjectStateChangedEvent       Event;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAlterationCraftingComponent.OnCheckValidItemType
// 0x0010 (0x0010 - 0x0000)
struct JunoAlterationCraftingComponent_OnCheckValidItemType final
{
public:
	class AFortPlayerController*                  Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoAlterationCraftingComponent.OnCraftingSuccess
// 0x0030 (0x0030 - 0x0000)
struct JunoAlterationCraftingComponent_OnCraftingSuccess final
{
public:
	struct FCraftingObjectSuccessEvent            Event;                                             // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAsyncAction_WaitForEventRouter.WaitForEventRouter
// 0x0010 (0x0010 - 0x0000)
struct JunoAsyncAction_WaitForEventRouter_WaitForEventRouter final
{
public:
	class AActor*                                 ContextActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoAsyncAction_WaitForEventRouter*    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAsyncAction_WaitForRootPlayspace.RootPlayspaceReadyAsync
// 0x0010 (0x0010 - 0x0000)
struct JunoAsyncAction_WaitForRootPlayspace_RootPlayspaceReadyAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoAsyncAction_WaitForRootPlayspace*  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuilderToolSelectedActorInterface.ReceiveSelectionSpawnedByBuilderTool
// 0x0110 (0x0110 - 0x0000)
struct JunoBuilderToolSelectedActorInterface_ReceiveSelectionSpawnedByBuilderTool final
{
public:
	class AJunoBuilderTool*                       BuilderTool;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoBuilderToolInteractionBehavior*    Behavior;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoBuilderToolSelectionSpawnParams   SelectionSpawnParameters;                          // 0x0010(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuilderToolSelectedActorInterface.ReceiveSpawnedByBuilderTool
// 0x0010 (0x0010 - 0x0000)
struct JunoBuilderToolSelectedActorInterface_ReceiveSpawnedByBuilderTool final
{
public:
	class AJunoBuilderTool*                       BuilderTool;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoBuilderToolInteractionBehavior*    Behavior;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPlayerState.GetCaveId
// 0x0010 (0x0010 - 0x0000)
struct JunoPlayerState_GetCaveId final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.DebugDrawConnectionLocations
// 0x01E0 (0x01E0 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnectionLocations final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoBuildingConnection                Connection;                                        // 0x0010(0x01D0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.DebugDrawConnections
// 0x0290 (0x0290 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_DebugDrawConnections final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJunoBuildingConnectionPointsResult    Candidates;                                        // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FJunoBuildingConnectionPointsResult    Targets;                                           // 0x0058(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJunoBuildingConnection                ChosenConnection;                                  // 0x00B0(0x01D0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FJunoBuildingConnection>        Connections;                                       // 0x0280(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.GetAtomModelAssetUserData
// 0x0018 (0x0018 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_GetAtomModelAssetUserData final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAtomModelAssetUserData*>        ReturnValue;                                       // 0x0008(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingConnectivityBlueprintLibrary.GetKnobs
// 0x0060 (0x0060 - 0x0000)
struct JunoBuildingConnectivityBlueprintLibrary_GetKnobs final
{
public:
	struct FJunoBuildingConnectionPointsResult    Result;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FJunoBuildingConnectionPoint>   ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPhysicsObjectNavigationComponent.OnAddedToClusterUnion
// 0x0010 (0x0010 - 0x0000)
struct JunoPhysicsObjectNavigationComponent_OnAddedToClusterUnion final
{
public:
	class UClusterUnionComponent*                 ClusterUnion;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPhysicsObjectNavigationComponent.OnClusterUnionPhysicsObjectAwakeChanged
// 0x0010 (0x0010 - 0x0000)
struct JunoPhysicsObjectNavigationComponent_OnClusterUnionPhysicsObjectAwakeChanged final
{
public:
	class UPrimitiveComponent*                    SimulatingComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAwake;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoPhysicsObjectNavigationComponent.OnRemovedFromClusterUnion
// 0x0010 (0x0010 - 0x0000)
struct JunoPhysicsObjectNavigationComponent_OnRemovedFromClusterUnion final
{
public:
	class UClusterUnionComponent*                 ClusterUnion;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoPhysicsObjectNavigationComponent.OnSleep
// 0x0010 (0x0010 - 0x0000)
struct JunoPhysicsObjectNavigationComponent_OnSleep final
{
public:
	class UPrimitiveComponent*                    SimulatingComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoPhysicsObjectNavigationComponent.OnWake
// 0x0010 (0x0010 - 0x0000)
struct JunoPhysicsObjectNavigationComponent_OnWake final
{
public:
	class UPrimitiveComponent*                    SimulatingComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function JunoGameNative.JunoBuildingProp.GetAssociatedItem
// 0x0008 (0x0008 - 0x0000)
struct JunoBuildingProp_GetAssociatedItem final
{
public:
	const class UItemDefinitionBase*              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoBuildingPropTree.BlueprintCanDieInLifecyclePhase
// 0x0002 (0x0002 - 0x0000)
struct JunoBuildingPropTree_BlueprintCanDieInLifecyclePhase final
{
public:
	uint8                                         CurrentPhaseIndex;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoAction.K2_OnExecuteAction
// 0x0010 (0x0010 - 0x0000)
struct JunoAction_K2_OnExecuteAction final
{
public:
	struct FJunoActionTargetPayload               ActionTargetPayload;                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	const class UJunoActionConfig*                Config;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetConfinedSpaceWeight
// 0x0038 (0x0038 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetConfinedSpaceWeight final
{
public:
	double                                        InVerticalHitDistance;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVerticalProbeLength;                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInVerticalProbeBlocked;                           // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InFrontalHitDistance;                              // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InFrontalProbeLength;                              // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInFrontalProbeBlocked;                            // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetDesiredForwardDistance
// 0x00F8 (0x00F8 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetDesiredForwardDistance final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InBuildingPreviewHeightAdditionalZoom;             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InBuildingPreviewSizeScalar;                       // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            InPitchCameraForwardDistanceManager;               // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsTargetInConversation;                         // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCurveFloat*                      InCurvePitchDistance;                              // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InNormalizedCameraPitch;                           // 0x0038(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InCameraPitch;                                     // 0x0040(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InCameraPitchMax;                                  // 0x0048(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsTargetStrafing;                               // 0x0050(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsTargetBuilding;                               // 0x0051(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InExteriorCameraSpaceForwardDistance;              // 0x0058(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InExteriorCameraSpaceForwardDistanceStrafing;      // 0x0060(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInCameraAdjustsWhenStrafing;                      // 0x0068(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBuildPreviewMode;                               // 0x0069(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCurveFloat*                      InBuildPreviewBoundsToForwardDistanceScale;        // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   InBuildPreviewLocalBounds;                         // 0x0078(0x0038)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	double                                        InConfinedSpaceWeight;                             // 0x00B0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        bInteriorCameraSpaceForwardDistance;               // 0x00B8(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVelocityAddMaxDistance;                          // 0x00C0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InFastVelocityThreshold;                           // 0x00C8(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVTVelocity;                                      // 0x00D0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVelocityAddDistanceThreshold;                    // 0x00D8(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InCurrentBuildingScalarDistanceOffset;             // 0x00E0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutCurrentBuildingScalarDistanceOffset;            // 0x00E8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x00F0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetDesiredFOV
// 0x0030 (0x0030 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetDesiredFOV final
{
public:
	double                                        InVelocityWeight;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InConfinedSpaceWeight;                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVelocityAddMaxFOV;                               // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InExteriorFOV;                                     // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InInteriorFOV;                                     // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetFOVAndDistanceInterpSpeed
// 0x0020 (0x0020 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetFOVAndDistanceInterpSpeed final
{
public:
	double                                        InConfinedSpaceWeight;                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InMinInterpSpeed;                                  // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InMaxInterpSpeed;                                  // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetProbeWeight
// 0x0020 (0x0020 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetProbeWeight final
{
public:
	double                                        InHitDistance;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InProbeLength;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInProbeBlocked;                                   // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetVelocityDistanceAdd
// 0x0018 (0x0018 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetVelocityDistanceAdd final
{
public:
	double                                        InWeight;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InAddMaxDistance;                                  // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.GetVelocityWeight
// 0x0020 (0x0020 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_GetVelocityWeight final
{
public:
	double                                        InVelocityAddDistanceThreshold;                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVTVelocity;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InFastVelocityThreshold;                           // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.UpdateProbeChecks
// 0x0098 (0x0098 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_UpdateProbeChecks final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InViewTargetActor;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InProbeCastOrigin;                                 // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InTagIgnoredActors;                                // 0x0028(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InViewTargetBoxExtent;                             // 0x0030(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InVerticalProbeLength;                             // 0x0048(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InVerticalProbeTickSkip;                           // 0x0050(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InFrontalProbeTickSkip;                            // 0x0054(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InFrontalAngledProbeAngle;                         // 0x0058(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InFrontalAngledProbeLength;                        // 0x0060(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InVerticalProbeCurTickNum;                         // 0x0068(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InFrontalProbeCurTickNum;                          // 0x006C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutVerticalProbeCurTickNum;                        // 0x0070(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutFrontalProbeCurTickNum;                         // 0x0074(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutVerticalProbeBlocked;                          // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OutVerticalHitDistance;                            // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutFrontalProbeBlocked;                           // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OutFrontalHitDistance;                             // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCameraMode_OrbitCam_BPFunctions.UpdateViewTargetValues
// 0x08E0 (0x08E0 - 0x0000)
struct JunoCameraMode_OrbitCam_BPFunctions_UpdateViewTargetValues final
{
public:
	struct FTViewTarget                           InViewTarget;                                      // 0x0000(0x0820)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class AActor*                           InViewTargetActor;                                 // 0x0820(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InInteriorFOV;                                     // 0x0828(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InCameraPitchMin;                                  // 0x0830(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InCameraPitchMax;                                  // 0x0838(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAllowChangingHidePercentByPitch;                // 0x0840(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_841[0x7];                                      // 0x0841(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InCurrentFOV;                                      // 0x0848(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutCurrentFOV;                                     // 0x0850(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutVTVelocity;                                     // 0x0858(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutVelocityDirection;                              // 0x0860(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutVTVelDir;                                       // 0x0878(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutViewTargetBoxExtent;                            // 0x0890(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutProbeCastOrigin;                                // 0x08A8(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutVTVelocityDotWithCam;                           // 0x08C0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutCameraPitch;                                    // 0x08C8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutNormalizedCameraPitch;                          // 0x08D0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutHidePawnPenetrationPercent;                     // 0x08D8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampActor.AddGameplayTag
// 0x0004 (0x0004 - 0x0000)
struct JunoCampActor_AddGameplayTag final
{
public:
	struct FGameplayTag                           TagToAdd;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampActor.ApplyPersistentTags
// 0x0020 (0x0020 - 0x0000)
struct JunoCampActor_ApplyPersistentTags final
{
public:
	struct FGameplayTagContainer                  TagsToApply;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampActor.RemoveGameplayTag
// 0x0004 (0x0004 - 0x0000)
struct JunoCampActor_RemoveGameplayTag final
{
public:
	struct FGameplayTag                           TagToRemove;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampActor.RemovePersistentTags
// 0x0020 (0x0020 - 0x0000)
struct JunoCampActor_RemovePersistentTags final
{
public:
	struct FGameplayTagContainer                  TagsToRemove;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampActor.GetCampTag
// 0x0004 (0x0004 - 0x0000)
struct JunoCampActor_GetCampTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampActor.GetOwnedGameplayTags
// 0x0020 (0x0020 - 0x0000)
struct JunoCampActor_GetOwnedGameplayTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampActor.GetPersistentTags
// 0x0020 (0x0020 - 0x0000)
struct JunoCampActor_GetPersistentTags final
{
public:
	struct FGameplayTagContainer                  PersistentTags;                                    // 0x0000(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampActor.GetStaticGameplayTag
// 0x0004 (0x0004 - 0x0000)
struct JunoCampActor_GetStaticGameplayTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.BlockOctreeManager.Towers
// 0x0008 (0x0008 - 0x0000)
struct BlockOctreeManager_Towers final
{
public:
	int32                                         Rows;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Cols;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampCenterComponent.HandleSmartObjectEvent
// 0x0038 (0x0038 - 0x0000)
struct JunoCampCenterComponent_HandleSmartObjectEvent final
{
public:
	struct FSmartObjectEventData                  SmartObjectEventData;                              // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	const class AActor*                           Actor;                                             // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampCenterComponent.NotifyOwnerPlacedByBuilderTool
// 0x0008 (0x0008 - 0x0000)
struct JunoCampCenterComponent_NotifyOwnerPlacedByBuilderTool final
{
public:
	class AFortPlayerController*                  FortPC;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampCenterComponent.OnCampAwesomeLevelChanged
// 0x0028 (0x0028 - 0x0000)
struct JunoCampCenterComponent_OnCampAwesomeLevelChanged final
{
public:
	struct FJunoEvent_CampAwesomeLevelChanged     Payload;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampCenterComponent.OnCampAwesomePointModification
// 0x0038 (0x0038 - 0x0000)
struct JunoCampCenterComponent_OnCampAwesomePointModification final
{
public:
	struct FJunoEvent_CampAwesomePointsModified   Payload;                                           // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampCenterComponent.OnNonResourceRequirementsChanged
// 0x000C (0x000C - 0x0000)
struct JunoCampCenterComponent_OnNonResourceRequirementsChanged final
{
public:
	struct FJunoEvent_NonResourceRequirementsMetChanged Payload;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampAtLocationAndReturnComponent
// 0x0030 (0x0030 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampAtLocationAndReturnComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          WorldContextObject;                                // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0028(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForActor
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AJunoCampActor*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForActorAndReturnComponent
// 0x0018 (0x0018 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForActorAndReturnComponent final
{
public:
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           Actor;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForArea
// 0x0048 (0x0048 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForArea final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   AreaBox;                                           // 0x0008(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AJunoCampActor*                         ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindBindableLocalCampForLocation
// 0x0028 (0x0028 - 0x0000)
struct JunoCampMembershipActorComponent_FindBindableLocalCampForLocation final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AJunoCampActor*                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindCampMembershipActorComponentOnActor
// 0x0010 (0x0010 - 0x0000)
struct JunoCampMembershipActorComponent_FindCampMembershipActorComponentOnActor final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJunoCampMembershipActorComponent*      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function JunoGameNative.JunoCampMembershipActorComponent.FindCampMembershipComponentAndReturnComponent
// 0x0018 (0x0018 - 0x0000)
struct JunoCampMembershipActorComponent_FindCampMembershipComponentAndReturnComponent final
{
