#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoProceduralWorld

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MassEntity_structs.hpp"
#include "JunoGameNative_structs.hpp"
#include "Engine_structs.hpp"
#include "InstancedActors_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "StructUtils_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "NetCore_structs.hpp"
#include "Landscape_structs.hpp"
#include "PCG_structs.hpp"
#include "WorldConditions_structs.hpp"


namespace SDK
{

// Enum JunoProceduralWorld.EJunoGetMergedCaveDataRegistryDataResult
// NumValues: 0x0003
enum class EJunoGetMergedCaveDataRegistryDataResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EJunoGetMergedCaveDataRegistryDataResult_MAX = 2,
};

// Enum JunoProceduralWorld.EJunoCaveGeneratorShellType
// NumValues: 0x0006
enum class EJunoCaveGeneratorShellType : uint8
{
	Room                                     = 0,
	Connector                                = 1,
	Entrance                                 = 2,
	Hero                                     = 3,
	FeatureRoom                              = 4,
	EJunoCaveGeneratorShellType_MAX          = 5,
};

// Enum JunoProceduralWorld.EJunoCaveGeneratorShellSize
// NumValues: 0x0005
enum class EJunoCaveGeneratorShellSize : uint8
{
	Small                                    = 0,
	Medium                                   = 1,
	Large                                    = 2,
	Hallway                                  = 3,
	EJunoCaveGeneratorShellSize_MAX          = 4,
};

// Enum JunoProceduralWorld.EJunoCaveGeneratorShellTags
// NumValues: 0x0008
enum class EJunoCaveGeneratorShellTags : uint8
{
	BearCave                                 = 0,
	WolfCave                                 = 1,
	TreasureCave                             = 2,
	PirateCave                               = 3,
	AnimalDen                                = 4,
	BossRoom                                 = 5,
	MysteryRoom                              = 6,
	EJunoCaveGeneratorShellTags_MAX          = 7,
};

// Enum JunoProceduralWorld.EJunoCaveGeneratorLayoutTags
// NumValues: 0x0002
enum class EJunoCaveGeneratorLayoutTags : uint8
{
	OroMine                                  = 0,
	EJunoCaveGeneratorLayoutTags_MAX         = 1,
};

// Enum JunoProceduralWorld.EJunoCaveGeneratorPCGType
// NumValues: 0x0008
enum class EJunoCaveGeneratorPCGType : uint8
{
	GemsAndOre                               = 0,
	GemsAndOre_HighValue                     = 1,
	Mushroom                                 = 2,
	Plants                                   = 3,
	Ceiling                                  = 4,
	Clutter                                  = 5,
	Rare                                     = 6,
	EJunoCaveGeneratorPCGType_MAX            = 7,
};

// Enum JunoProceduralWorld.EAddChainResult
// NumValues: 0x0007
enum class EAddChainResult : uint8
{
	Success                                  = 0,
	NoMatchingShell                          = 1,
	InvalidAttachIndex                       = 2,
	NoExitsLeft                              = 3,
	CannotFitShell                           = 4,
	NoShellsGenerated                        = 5,
	EAddChainResult_MAX                      = 6,
};

// Enum JunoProceduralWorld.EJunoCaveTheme_DEPRECATED
// NumValues: 0x0006
enum class EJunoCaveTheme_DEPRECATED : uint8
{
	Grassland                                = 0,
	DarkForest                               = 1,
	Tropical                                 = 2,
	Alpine                                   = 3,
	Desert                                   = 4,
	EJunoCaveTheme_MAX                       = 5,
};

// Enum JunoProceduralWorld.EJunoCreateCaveResult
// NumValues: 0x0004
enum class EJunoCreateCaveResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	Disabled                                 = 2,
	EJunoCreateCaveResult_MAX                = 3,
};

// Enum JunoProceduralWorld.EJunoQueryCaveDataResult
// NumValues: 0x0005
enum class EJunoQueryCaveDataResult : uint8
{
	NotReady                                 = 0,
	NotAllowed                               = 1,
	Cached                                   = 2,
	NoEntry                                  = 3,
	EJunoQueryCaveDataResult_MAX             = 4,
};

// Enum JunoProceduralWorld.EJunoQueryCaveSurfaceDataStateResult
// NumValues: 0x0005
enum class EJunoQueryCaveSurfaceDataStateResult : uint8
{
	NotReady                                 = 0,
	NotAllowed                               = 1,
	Cached                                   = 2,
	NoEntry                                  = 3,
	EJunoQueryCaveSurfaceDataStateResult_MAX = 4,
};

// Enum JunoProceduralWorld.EJunoGetCaveSurfaceDataForEntranceResult
// NumValues: 0x0005
enum class EJunoGetCaveSurfaceDataForEntranceResult : uint8
{
	NotReady                                 = 0,
	NotAllowed                               = 1,
	IsACave                                  = 2,
	NotACave                                 = 3,
	EJunoGetCaveSurfaceDataForEntranceResult_MAX = 4,
};

// Enum JunoProceduralWorld.EJunoGetCaveShellInstanceDataResult
// NumValues: 0x0003
enum class EJunoGetCaveShellInstanceDataResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EJunoGetCaveShellInstanceDataResult_MAX  = 2,
};

// Enum JunoProceduralWorld.EJunoGetBestCaveResult
// NumValues: 0x0003
enum class EJunoGetBestCaveResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EJunoGetBestCaveResult_MAX               = 2,
};

// Enum JunoProceduralWorld.EJunoCalculateCaveDistanceResult
// NumValues: 0x0004
enum class EJunoCalculateCaveDistanceResult : uint8
{
	Success                                  = 0,
	ParentIDsNotCorrect                      = 1,
	ShellsAreNotConnected                    = 2,
	EJunoCalculateCaveDistanceResult_MAX     = 3,
};

// Enum JunoProceduralWorld.EJunoGetCaveDataCollectionsFromRegistryResult
// NumValues: 0x0003
enum class EJunoGetCaveDataCollectionsFromRegistryResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EJunoGetCaveDataCollectionsFromRegistryResult_MAX = 2,
};

// Enum JunoProceduralWorld.EJunoPCGVolumeSource
// NumValues: 0x0003
enum class EJunoPCGVolumeSource : uint8
{
	Transient                                = 0,
	Persistent                               = 1,
	EJunoPCGVolumeSource_MAX                 = 2,
};

// Enum JunoProceduralWorld.EJunoFindNextMatchingPOIResourceResult
// NumValues: 0x0003
enum class EJunoFindNextMatchingPOIResourceResult : uint8
{
	Found                                    = 0,
	NotFound                                 = 1,
	EJunoFindNextMatchingPOIResourceResult_MAX = 2,
};

// Enum JunoProceduralWorld.EJunoCreateLevelResult
// NumValues: 0x0003
enum class EJunoCreateLevelResult : uint8
{
	Success                                  = 0,
	Failed                                   = 1,
	EJunoCreateLevelResult_MAX               = 2,
};

// Enum JunoProceduralWorld.EJunoCompareTagSetsResult
// NumValues: 0x0004
enum class EJunoCompareTagSetsResult : uint8
{
	NoMatch                                  = 0,
	PartialMatch                             = 1,
	FullMatch                                = 2,
	EJunoCompareTagSetsResult_MAX            = 3,
};

// Enum JunoProceduralWorld.EJunoResolveWorldSoftObjectPathResult
// NumValues: 0x0004
enum class EJunoResolveWorldSoftObjectPathResult : uint8
{
	Success                                  = 0,
	NotAWorldObject                          = 1,
	InvalidPath                              = 2,
	EJunoResolveWorldSoftObjectPathResult_MAX = 3,
};

// Enum JunoProceduralWorld.EJunoLevelInstanceMode
// NumValues: 0x0004
enum class EJunoLevelInstanceMode : uint8
{
	Disabled                                 = 0,
	StreamingWP                              = 1,
	CellInjection                            = 2,
	EJunoLevelInstanceMode_MAX               = 3,
};

// Enum JunoProceduralWorld.EJunoWorldRegistryType
// NumValues: 0x0004
enum class EJunoWorldRegistryType : uint8
{
	Invalid                                  = 0,
	POI                                      = 1,
	Enemy                                    = 2,
	EJunoWorldRegistryType_MAX               = 3,
};

// Enum JunoProceduralWorld.EJunoGetWorldTileTransformResult
// NumValues: 0x0003
enum class EJunoGetWorldTileTransformResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EJunoGetWorldTileTransformResult_MAX     = 2,
};

// Enum JunoProceduralWorld.EJunoGetWorldTileBoundsResult
// NumValues: 0x0003
enum class EJunoGetWorldTileBoundsResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EJunoGetWorldTileBoundsResult_MAX        = 2,
};

// Enum JunoProceduralWorld.EJunoTileStatus
// NumValues: 0x0007
enum class EJunoTileStatus : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Deprecated                               = 2,
	Instantiated                             = 3,
	Reserved                                 = 4,
	OutOfBounds                              = 5,
	EJunoTileStatus_MAX                      = 6,
};

// Enum JunoProceduralWorld.EJunoTileGenerationType
// NumValues: 0x0003
enum class EJunoTileGenerationType : uint8
{
	Unknown                                  = 0,
	Cooked                                   = 1,
	EJunoTileGenerationType_MAX              = 2,
};

// Enum JunoProceduralWorld.EJunoWorldTilePOIType
// NumValues: 0x0006
enum class EJunoWorldTilePOIType : uint8
{
	Overworld                                = 0,
	Cave                                     = 1,
	CaveEntrance                             = 2,
	Bridge                                   = 3,
	FishingSpot                              = 4,
	EJunoWorldTilePOIType_MAX                = 5,
};

// Enum JunoProceduralWorld.EJunoPOIDistributionMethod
// NumValues: 0x0003
enum class EJunoPOIDistributionMethod : uint8
{
	Random                                   = 0,
	AdditionalPOI                            = 1,
	EJunoPOIDistributionMethod_MAX           = 2,
};

// Enum JunoProceduralWorld.EJunoWorldTileAdditionalPOIType
// NumValues: 0x0005
enum class EJunoWorldTileAdditionalPOIType : uint8
{
	CosmeticPOI                              = 0,
	EncounterPOI                             = 1,
	TransitionCaveEntrance                   = 2,
	TransitionCaveExit                       = 3,
	EJunoWorldTileAdditionalPOIType_MAX      = 4,
};

// Enum JunoProceduralWorld.EJunoWorldTileAdditionalPOIPlacement
// NumValues: 0x0007
enum class EJunoWorldTileAdditionalPOIPlacement : uint8
{
	RandomEventTile                          = 0,
	NearEventTile                            = 1,
	WorldOriginTile                          = 2,
	TaggedTileAndSlot                        = 3,
	SessionOriginTile                        = 4,
	UnitTests                                = 5,
	EJunoWorldTileAdditionalPOIPlacement_MAX = 6,
};

// Enum JunoProceduralWorld.EJunoPOISlotState
// NumValues: 0x0006
enum class EJunoPOISlotState : uint8
{
	Normal                                   = 0,
	Unused                                   = 1,
	Cosmetic                                 = 2,
	CaveEntrance                             = 3,
	UnusedNearWorldStart                     = 4,
	EJunoPOISlotState_MAX                    = 5,
};

// Enum JunoProceduralWorld.EJunoWorldTileInjectedLevelType
// NumValues: 0x0003
enum class EJunoWorldTileInjectedLevelType : uint8
{
	POI                                      = 0,
	Cave                                     = 1,
	EJunoWorldTileInjectedLevelType_MAX      = 2,
};

// Enum JunoProceduralWorld.EPushFrontierResult
// NumValues: 0x000A
enum class EPushFrontierResult : uint8
{
	Continue                                 = 0,
	Success                                  = 1,
	Fail                                     = 2,
	OutOfFrontierNodes                       = 3,
	NoNewFrontierCreated                     = 4,
	ReachedMaxCost                           = 5,
	ReachedMaxSteps                          = 6,
	ReachedDestination                       = 7,
	NoValidResult                            = 8,
	EPushFrontierResult_MAX                  = 9,
};

// Enum JunoProceduralWorld.EPathfinderNodeState
// NumValues: 0x0005
enum class EPathfinderNodeState : uint8
{
	Normal                                   = 0,
	Snap                                     = 1,
	Warp                                     = 2,
	Invalid                                  = 3,
	EPathfinderNodeState_MAX                 = 4,
};

// Enum JunoProceduralWorld.EJunoRepresentation
// NumValues: 0x0004
enum class EJunoRepresentation : uint8
{
	None                                     = 0,
	Actor                                    = 1,
	Instance                                 = 2,
	EJunoRepresentation_MAX                  = 3,
};

// Enum JunoProceduralWorld.EJunoPOISize
// NumValues: 0x000A
enum class EJunoPOISize : uint8
{
	None                                     = 0,
	JPOI_1x1                                 = 1,
	JPOI_2x2                                 = 2,
	JPOI_3x3                                 = 3,
	JPOI_4x4                                 = 4,
	JPOI_5x5                                 = 5,
	JPOI_8x8                                 = 8,
	JPOI_10x10                               = 10,
	JPOI_11x11                               = 11,
	EJunoPOISize_MAX                         = 12,
};

// Enum JunoProceduralWorld.PCGJunoApplyMaskNodeMode
// NumValues: 0x0005
enum class EPCGJunoApplyMaskNodeMode : uint8
{
	Subtract                                 = 0,
	Intersect                                = 1,
	SubtractSmaller                          = 2,
	SubtractLarger                           = 3,
	PCGJunoApplyMaskNodeMode_MAX             = 4,
};

// Enum JunoProceduralWorld.ELandmassRiverTier
// NumValues: 0x0002
enum class ELandmassRiverTier : uint8
{
	Default                                  = 0,
	ELandmassRiverTier_MAX                   = 1,
};

// Enum JunoProceduralWorld.EQueryPOIStateResult
// NumValues: 0x0005
enum class EQueryPOIStateResult : uint8
{
	NotReady                                 = 0,
	NotAllowed                               = 1,
	Cached                                   = 2,
	NoEntry                                  = 3,
	EQueryPOIStateResult_MAX                 = 4,
};

// Enum JunoProceduralWorld.EGeneratePOIResult
// NumValues: 0x0003
enum class EGeneratePOIResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EGeneratePOIResult_MAX                   = 2,
};

// Enum JunoProceduralWorld.EJunoMarkSlotPOIUnusedResult
// NumValues: 0x0003
enum class EJunoMarkSlotPOIUnusedResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EJunoMarkSlotPOIUnusedResult_MAX         = 2,
};

// Enum JunoProceduralWorld.EJunoSetSlotPOIMetaDataResult
// NumValues: 0x0003
enum class EJunoSetSlotPOIMetaDataResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EJunoSetSlotPOIMetaDataResult_MAX        = 2,
};

// Enum JunoProceduralWorld.EJunoGetMatchingPOIsFromDataRegistryResult
// NumValues: 0x0003
enum class EJunoGetMatchingPOIsFromDataRegistryResult : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EJunoGetMatchingPOIsFromDataRegistryResult_MAX = 2,
};

// Enum JunoProceduralWorld.EJunoPOISlotSelectionMode
// NumValues: 0x0004
enum class EJunoPOISlotSelectionMode : uint8
{
	Default                                  = 0,
	EncounterPOI                             = 1,
	CosmeticPOI                              = 2,
	EJunoPOISlotSelectionMode_MAX            = 3,
};

// Enum JunoProceduralWorld.EVerticalDirection
// NumValues: 0x0004
enum class EVerticalDirection : uint8
{
	Both                                     = 0,
	DownwardOnly                             = 1,
	UpwardOnly                               = 2,
	EVerticalDirection_MAX                   = 3,
};

// Enum JunoProceduralWorld.ELandmassRoadTier
// NumValues: 0x0009
enum class ELandmassRoadTier : uint8
{
	Default                                  = 0,
	Dirt                                     = 1,
	Rural                                    = 2,
	Metropolitan                             = 3,
	Suburban                                 = 4,
	Highway                                  = 5,
	BreadCrumbs                              = 6,
	Hidden                                   = 7,
	ELandmassRoadTier_MAX                    = 8,
};

// Enum JunoProceduralWorld.ERouteGenerationState
// NumValues: 0x0004
enum class ERouteGenerationState : uint8
{
	Inactive                                 = 0,
	Active                                   = 1,
	Dormant                                  = 2,
	ERouteGenerationState_MAX                = 3,
};

// Enum JunoProceduralWorld.ERouteAvoidancePrimitiveType
// NumValues: 0x0004
enum class ERouteAvoidancePrimitiveType : uint8
{
	Disc                                     = 0,
	Curve                                    = 1,
	ProceduralRoutes                         = 2,
	ERouteAvoidancePrimitiveType_MAX         = 3,
};

// Enum JunoProceduralWorld.EProceduralRouteGuideSetSelectMethod
// NumValues: 0x0003
enum class EProceduralRouteGuideSetSelectMethod : uint8
{
	UseTileId                                = 0,
	UseTileIndex                             = 1,
	EProceduralRouteGuideSetSelectMethod_MAX = 2,
};

// Enum JunoProceduralWorld.EProceduralRiverAnchorType
// NumValues: 0x0005
enum class EProceduralRiverAnchorType : uint8
{
	Source                                   = 0,
	Lake                                     = 1,
	Coastline                                = 2,
	DeepSea                                  = 3,
	EProceduralRiverAnchorType_MAX           = 4,
};

// Enum JunoProceduralWorld.PCGJunoFractalNoise2DMode
// NumValues: 0x0007
enum class EPCGJunoFractalNoise2DMode : uint32
{
	Perlin                                   = 0,
	Caustic                                  = 1,
	Voronoi                                  = 2,
	TiledVoronoi                             = 3,
	Brownian                                 = 4,
	EdgeMask                                 = 5,
	PCGJunoFractalNoise2DMode_MAX            = 6,
};

// Enum JunoProceduralWorld.PCGJunoFractalNoise2DEdgeMode
// NumValues: 0x0004
enum class EPCGJunoFractalNoise2DEdgeMode : uint32
{
	Perlin                                   = 0,
	Caustic                                  = 1,
	Brownian                                 = 2,
	PCGJunoFractalNoise2DEdgeMode_MAX        = 3,
};

// Enum JunoProceduralWorld.PCGJunoFractalDensityMode
// NumValues: 0x0005
enum class EPCGJunoFractalDensityMode : uint32
{
	Ignore                                   = 0,
	Set                                      = 1,
	Add                                      = 2,
	Multiply                                 = 3,
	PCGJunoFractalDensityMode_MAX            = 4,
};

// ScriptStruct JunoProceduralWorld.JunoBridgePOISelectorParams
// 0x0018 (0x0018 - 0x0000)
struct FJunoBridgePOISelectorParams final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RiverWidth;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorWorldsList
// 0x0010 (0x0010 - 0x0000)
struct FJunoCaveGeneratorWorldsList final
{
public:
	TArray<struct FSoftObjectPath>                Worlds;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorResourceWorlds
// 0x00A8 (0x00A8 - 0x0000)
struct FJunoCaveGeneratorResourceWorlds final
{
public:
	TSet<EJunoBiome>                              ValidBiomes;                                       // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      SlotTagQuery;                                      // 0x0050(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                Worlds;                                            // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoWorldTileAdditionalPOI
// 0x00B0 (0x00B8 - 0x0008)
struct FJunoWorldTileAdditionalPOI final : public FTableRowBase
{
public:
	uint8                                         Pad_8[0x4];                                        // 0x0008(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabled;                                          // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LayerName;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataRegistryId                        POI;                                               // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoWorldTileAdditionalPOIType               Type;                                              // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CaveGeneratorTags;                                 // 0x0020(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EJunoBiome                                    CaveGeneratorBiomeOverride;                        // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CaveGuid;                                          // 0x0044(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreferredBiomePriority;                            // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<EJunoBiome>                              PreferredBiomes;                                   // 0x0058(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   EventName;                                         // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoWorldTileAdditionalPOIPlacement          WorldTilePlacement;                                // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDistance;                                   // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralWorld.JunoWorldRegistryEntry
// 0x0040 (0x0040 - 0x0000)
struct FJunoWorldRegistryEntry final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorPOIMarker
// 0x0110 (0x0110 - 0x0000)
struct FJunoCaveGeneratorPOIMarker final
{
public:
	TSet<EJunoPOISize>                            ValidSizes;                                        // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      POIQuery;                                          // 0x0050(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         SpawnChance;                                       // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x00A0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRandomizeRotation;                                // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenterBounds;                                     // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102[0xE];                                      // 0x0102(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorShellData
// 0x01D0 (0x01D8 - 0x0008)
struct FJunoCaveGeneratorShellData final : public FTableRowBase
{
public:
	class FName                                   Name;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        World;                                             // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<EJunoBiome>                              ValidBiomes;                                       // 0x0028(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSet<EJunoCaveGeneratorShellTags>             ShellTags;                                         // 0x0078(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x00C8(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EJunoCaveGeneratorShellType                   ShellType;                                         // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoCaveGeneratorShellSize                   ShellSize;                                         // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinDepth;                                          // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDepth;                                          // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Version;                                           // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoCaveGeneratorResourceWorlds> ResourceLevels;                                  // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoCaveGeneratorResourceWorlds> VariationResourceLevels;                         // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                ShellBoundsSize;                                   // 0x0120(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ShellBoundsCenter;                                 // 0x0138(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     ExitLocations;                                     // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumOfSpawners;                                     // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoCaveGeneratorPOIMarker>    POIMarkers;                                        // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumOfAIPointProviders;                             // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EJunoCaveGeneratorLayoutTags, struct FJunoCaveGeneratorWorldsList> SupportedLayouts;        // 0x0180(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bHasFixedEntrance;                                 // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PersistenceVersion;                                // 0x01D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoDebugWorldTileState
// 0x0020 (0x0020 - 0x0000)
struct FJunoDebugWorldTileState final
{
public:
	class FString                                 TileName;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Levels;                                            // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.PCGJunoSpawnLivingWorldStaticPointContext
// 0x0028 (0x00F8 - 0x00D0)
struct FPCGJunoSpawnLivingWorldStaticPointContext final : public FPCGContext
{
public:
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    StaticPointClass;                                  // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    PointClusterClass;                                 // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCGManagedActors*                      ManagedActors;                                     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorRule
// 0x0058 (0x0060 - 0x0008)
struct FJunoCaveGeneratorRule final : public FTableRowBase
{
public:
	class FName                                   Name;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectionWeight;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DepthAttemptThreshold;                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumberOfTeleporters;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinPrimaryChainLength;                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPrimaryChainLength;                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AJunoTeleporter>            SpecialEndingTeleporterClass;                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PrimaryChainHallwayChance;                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinNumberOfSecondaryChains;                        // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumberOfSecondaryChains;                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinSecondaryChainLength;                           // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSecondaryChainLength;                           // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinStartingDepthOfSecondaryChains;                 // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxStartingDepthOfSecondaryChains;                 // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanSpawnOnSecondaryChains;                        // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SecondaryChainHallwayChance;                       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumberOfPOIs;                                   // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BasePOISpawnChance;                                // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowPOIsInTeleporterRooms;                       // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorTypeData
// 0x01F0 (0x01F8 - 0x0008)
struct FJunoCaveGeneratorTypeData final : public FTableRowBase
{
public:
	class FName                                   TypeName;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoCaveGeneratorRule>         Rules;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<class FName>                             SharedRules;                                       // 0x0020(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EJunoCaveType                                 Type;                                              // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<EJunoBiome>                              ValidBiomes;                                       // 0x0078(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      SlotTagQuery;                                      // 0x00C8(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSet<EJunoCaveGeneratorShellTags>             ShellTags;                                         // 0x0110(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      ShellQuery;                                        // 0x0160(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSet<EJunoCaveGeneratorLayoutTags>            LayoutTags;                                        // 0x01A8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorPCGResourceMap
// 0x0050 (0x0050 - 0x0000)
struct FJunoCaveGeneratorPCGResourceMap final
{
public:
	TMap<class FName, int32>                      ResourceWeight;                                    // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorThemeEntry
// 0x01A0 (0x01A8 - 0x0008)
struct FJunoCaveGeneratorThemeEntry final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UMaterialInterface>      CaveMaterial;                                      // 0x0008(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      DestructibleCaveMaterial;                          // 0x0028(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              ThemeResourceDataTable;                            // 0x0048(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              POIDataTable;                                      // 0x0068(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EJunoCaveGeneratorPCGType, struct FJunoCaveGeneratorPCGResourceMap> PCGTypeWeights;         // 0x0088(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<EJunoBiome>                              Biomes;                                            // 0x00E0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      SlotTagQuery;                                      // 0x0130(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bExportTheme;                                      // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThemeExportName;                                   // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ThemeExportPath;                                   // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   TeleporterClass;                                   // 0x0188(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorData
// 0x0030 (0x0038 - 0x0008)
struct FJunoCaveGeneratorData final : public FTableRowBase
{
public:
	TArray<struct FJunoCaveGeneratorShellData>    Shells;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoCaveGeneratorThemeEntry>   Themes;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FJunoCaveGeneratorTypeData>     Types;                                             // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoCaveGeneratorResult
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FJunoCaveGeneratorResult final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralWorld.JunoCaveConditionalTags
// 0x0028 (0x0028 - 0x0000)
struct FJunoCaveConditionalTags final
{
public:
	EJunoCaveType                                 Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBiome                                    Biome;                                             // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TagsToApply;                                       // 0x0008(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoCaveTeleporterLink
// 0x00E0 (0x00E0 - 0x0000)
struct FJunoCaveTeleporterLink final
{
public:
	struct FTransform                             SurfaceTransform;                                  // 0x0000(0x0060)(Edit, BlueprintVisible, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             CaveTransform;                                     // 0x0060(0x0060)(Edit, BlueprintVisible, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AJunoTeleporter>            SurfaceTeleporterClass;                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AJunoTeleporter>            CaveTeleporterClass;                               // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SurfacePOISlotGuid;                                // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoCaveSurfaceData
// 0x0030 (0x0030 - 0x0000)
struct FJunoCaveSurfaceData final
{
public:
	struct FGuid                                  CaveGuid;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          Entrances;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     EntranceTeleporterTransforms;                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoCaveShellInstanceData
// 0x0060 (0x0060 - 0x0000)
struct FJunoCaveShellInstanceData final
{
public:
	int32                                         ExitsUsedMask;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Depth;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Tier;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChainID;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoCaveType                                 Type;                                              // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThemeName;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 ThemeObject;                                       // 0x0018(0x0020)(Edit, BlueprintVisible, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BranchParentShellID;                               // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EntranceZ;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJunoBiome                                    EntranceBiome;                                     // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FJunoCaveTeleporterLink>        Teleporters;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoPOIBucketWeightEntry
// 0x000C (0x000C - 0x0000)
struct FJunoPOIBucketWeightEntry final
{
public:
	struct FGameplayTag                           POITag;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EncounterWeight;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CosmeticWeight;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoGeneratedCaveShellData
// 0x0110 (0x0110 - 0x0000)
struct FJunoGeneratedCaveShellData final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoundsOffset;                                      // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ShellID;                                           // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                Levels;                                            // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FJunoCaveShellInstanceData             InstanceData;                                      // 0x00A8(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         PersistenceVersion;                                // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct JunoProceduralWorld.JunoCaveShellGameplayVolumeTeleporterLink
// 0x0010 (0x0010 - 0x0000)
struct FJunoCaveShellGameplayVolumeTeleporterLink final
{
public:
	class AJunoTeleporter*                        SurfaceTeleporter;                                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AJunoTeleporter*                        CaveTeleporter;                                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct JunoProceduralWorld.JunoLifecyclePhase
// 0x00B0 (0x00B0 - 0x0000)
struct FJunoLifecyclePhase final
{
public:
	struct FScalableFloat                         duration;                                          // 0x0000(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bOverrideMesh;                                     // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             Mesh;                                              // 0x0030(0x0020)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideMaterials;                                // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bOverrideCollisionEnabled;                         // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionEnabled                             CollisionEnabled;                                  // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideHealth;                                   // 0x006A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Health;                                            // 0x0070(0x0028)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
