#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JunoQuestsRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "JunoQuestsRuntime_structs.hpp"


namespace SDK
{

// Class JunoQuestsRuntime.JunoQuestCheatManager
// 0x0000 (0x0028 - 0x0028)
class UJunoQuestCheatManager final : public UChildCheatManager
{
public:
	void SetJunoFTUEQuestTrackingEnabled(bool bEnabled, bool bSaveSetting);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoQuestCheatManager">();
	}
	static class UJunoQuestCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoQuestCheatManager>();
	}
};

// Class JunoQuestsRuntime.JunoControllerComponent_FTUEQuestTracker
// 0x0048 (0x00F0 - 0x00A8)
class UJunoControllerComponent_FTUEQuestTracker final : public UFortControllerComponent
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bIsEnabled)> OnTrackedFTUEQuestsEnabled;                      // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UFortQuestItem>>  TrackedFTUEQuests;                                 // 0x00C8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FFTUEQuestBundleWithRequiredTag> FTUEQuestBundles;                                 // 0x00D8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCurrentQuestsChanged();
	void OnQuestCompleted(TScriptInterface<class IQuestInstanceInterface>* QuestInstance);
	void SetTrackingEnabled(bool bEnabled, bool bSaveSetting);

	bool IsTrackingEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerComponent_FTUEQuestTracker">();
	}
	static class UJunoControllerComponent_FTUEQuestTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerComponent_FTUEQuestTracker>();
	}
};

// Class JunoQuestsRuntime.JunoControllerComponent_QuestPersistence
// 0x0000 (0x00A8 - 0x00A8)
class UJunoControllerComponent_QuestPersistence final : public UFortControllerComponent
{
public:
	void ControllerBeginDestroy(class AFortPlayerControllerAthena* FortPCAthena);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JunoControllerComponent_QuestPersistence">();
	}
	static class UJunoControllerComponent_QuestPersistence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJunoControllerComponent_QuestPersistence>();
	}
};

}

