#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KatanaGameplayRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum KatanaGameplayRuntime.EFortKatanaPrimaryAttackVariation
// NumValues: 0x0004
enum class EFortKatanaPrimaryAttackVariation : uint8
{
	OnGroundFirst                            = 0,
	OnGroundSecond                           = 1,
	InAir                                    = 2,
	EFortKatanaPrimaryAttackVariation_MAX    = 3,
};

// ScriptStruct KatanaGameplayRuntime.FortKatanaPrimaryAttackVariationInfo
// 0x0098 (0x0098 - 0x0000)
struct FFortKatanaPrimaryAttackVariationInfo final
{
public:
	struct FScalableFloat                         Range;                                             // 0x0000(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         OffsetFromTarget;                                  // 0x0028(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFortAbilityTargetSelectionList        TargetSelectionList;                               // 0x0050(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct KatanaGameplayRuntime.FortKatanaDashTargetingInfo
// 0x0040 (0x0040 - 0x0000)
struct FFortKatanaDashTargetingInfo final
{
public:
	struct FVector                                DashDirection;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DashDistance;                                      // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  DashBlockingActor;                                 // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasDashDirectionAdjusted;                         // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         DamagedActors;                                     // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         OutOfRangePercent;                                 // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

