#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LimeNative

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LimeNative_structs.hpp"


namespace SDK::Params
{

// Function LimeNative.LimeOverrideManager.OnEndPlay
// 0x0010 (0x0010 - 0x0000)
struct LimeOverrideManager_OnEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function LimeNative.LimeCameraMode_OrbitCam.OnBecomeActiveBP
// 0x0008 (0x0008 - 0x0000)
struct LimeCameraMode_OrbitCam_OnBecomeActiveBP final
{
public:
	class AActor*                                 ViewTarget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LimeNative.LimeCameraMode_OrbitCam.UpdateCameraBP
// 0x0830 (0x0830 - 0x0000)
struct LimeCameraMode_OrbitCam_UpdateCameraBP final
{
public:
	class AActor*                                 ViewTarget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTViewTarget                           OutVT;                                             // 0x0010(0x0820)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function LimeNative.LimePawnComponentMood.GetCurrentMoodState
// 0x0004 (0x0004 - 0x0000)
struct LimePawnComponentMood_GetCurrentMoodState final
{
public:
	struct FLimeMoodStateData                     ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LimeNative.LimePawnComponent_EmotionalState.HandleLimeAwesomeLevelChanged
// 0x0004 (0x0004 - 0x0000)
struct LimePawnComponent_EmotionalState_HandleLimeAwesomeLevelChanged final
{
public:
	int32                                         NewAwesomeLevel;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LimeNative.LimePawnComponent_EmotionalState.SetCurrentEmotionalState
// 0x0001 (0x0001 - 0x0000)
struct LimePawnComponent_EmotionalState_SetCurrentEmotionalState final
{
public:
	ELimePawnEmotionalState                       NewEmotion;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LimeNative.LimePawnComponent_EmotionalState.SetEmotionalState
// 0x0010 (0x0010 - 0x0000)
struct LimePawnComponent_EmotionalState_SetEmotionalState final
{
public:
	struct FLimeEmotionalStateData                Emotion;                                           // 0x0000(0x0010)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LimeNative.LimePawnComponent_EmotionalState.GetCurrentEmotionalState
// 0x0001 (0x0001 - 0x0000)
struct LimePawnComponent_EmotionalState_GetCurrentEmotionalState final
{
public:
	ELimePawnEmotionalState                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function LimeNative.LimePawnComponent_EmotionalState.GetCurrentEmotionalStateValue
// 0x0004 (0x0004 - 0x0000)
struct LimePawnComponent_EmotionalState_GetCurrentEmotionalStateValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

