#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveEditObject

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "LiveEditObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class LiveEditObject.LiveEditNetworkStreamChannel
// 0x0000 (0x0068 - 0x0068)
class ULiveEditNetworkStreamChannel : public UChannel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditNetworkStreamChannel">();
	}
	static class ULiveEditNetworkStreamChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditNetworkStreamChannel>();
	}
};

// Class LiveEditObject.LiveEditLargeNetworkMessageChannel
// 0x0048 (0x00B0 - 0x0068)
class ULiveEditLargeNetworkMessageChannel : public ULiveEditNetworkStreamChannel
{
public:
	uint8                                         Pad_68[0x48];                                      // 0x0068(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditLargeNetworkMessageChannel">();
	}
	static class ULiveEditLargeNetworkMessageChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditLargeNetworkMessageChannel>();
	}
};

// Class LiveEditObject.LiveEditObjectChannel
// 0x00F8 (0x01A8 - 0x00B0)
class ULiveEditObjectChannel final : public ULiveEditLargeNetworkMessageChannel
{
public:
	uint8                                         Pad_B0[0xF8];                                      // 0x00B0(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditObjectChannel">();
	}
	static class ULiveEditObjectChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectChannel>();
	}
};

// Class LiveEditObject.LiveEditObjectConnection
// 0x0338 (0x0360 - 0x0028)
class ULiveEditObjectConnection final : public UObject
{
public:
	uint8                                         Pad_28[0x338];                                     // 0x0028(0x0338)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditObjectConnection">();
	}
	static class ULiveEditObjectConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectConnection>();
	}
};

// Class LiveEditObject.LiveEditObjectSubsystemState
// 0x0280 (0x02A8 - 0x0028)
class ULiveEditObjectSubsystemState final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULiveEditObjectConnection*>      Connections;                                       // 0x0038(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x260];                                     // 0x0048(0x0260)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditObjectSubsystemState">();
	}
	static class ULiveEditObjectSubsystemState* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectSubsystemState>();
	}
};

// Class LiveEditObject.LiveEditObjectSubsystem
// 0x0170 (0x01A0 - 0x0030)
class ULiveEditObjectSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBytesQueuedForReplication;                      // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumPackageMapBunchesToDelayTickFor;                // 0x003C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ULiveEditObjectSubsystemState*>  NetDriverStates;                                   // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x150];                                     // 0x0050(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditObjectSubsystem">();
	}
	static class ULiveEditObjectSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectSubsystem>();
	}
};

// Class LiveEditObject.LiveEditObjectTestObject
// 0x0150 (0x0178 - 0x0028)
class ULiveEditObjectTestObject final : public UObject
{
public:
	int32                                         int32_0[0x3];                                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLiveEditObjectTestStruct              StructProperty;                                    // 0x0038(0x0140)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LiveEditObjectTestObject">();
	}
	static class ULiveEditObjectTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveEditObjectTestObject>();
	}
};

}

