#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocomotionInitiativeRuntime

#include "Basic.hpp"

#include "LocomotionInitiativeRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LocomotionInitiativeRuntime.FortLocomotionLayerMaskDataAsset.ApplyTo
// 0x0020 (0x0020 - 0x0000)
struct FortLocomotionLayerMaskDataAsset_ApplyTo final
{
public:
	struct FFortLocomotionLayerMaskDataSet        DataAsset;                                         // 0x0000(0x0020)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LocomotionInitiativeRuntime.FortPlayerMotionMatchingLocomotionAnimInstance.OnUpdateIdleBreaks
// 0x0020 (0x0020 - 0x0000)
struct FortPlayerMotionMatchingLocomotionAnimInstance_OnUpdateIdleBreaks final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LocomotionInitiativeRuntime.FortPlayerMotionMatchingLocomotionAnimInstance.OnUpdateMotionMatching
// 0x0020 (0x0020 - 0x0000)
struct FortPlayerMotionMatchingLocomotionAnimInstance_OnUpdateMotionMatching final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LocomotionInitiativeRuntime.FortPlayerMotionMatchingLocomotionAnimInstance.OnUpdateMotionMatchingState
// 0x0020 (0x0020 - 0x0000)
struct FortPlayerMotionMatchingLocomotionAnimInstance_OnUpdateMotionMatchingState final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function LocomotionInitiativeRuntime.FortPlayerMotionMatchingLocomotionAnimInstance.GetMotionMatchingBlendProfile
// 0x0008 (0x0008 - 0x0000)
struct FortPlayerMotionMatchingLocomotionAnimInstance_GetMotionMatchingBlendProfile final
{
public:
	class UBlendProfile*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

