#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MantisRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "IrisCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Enum MantisRuntime.EFortMantisTechniqueActivationInputType
// NumValues: 0x0005
enum class EFortMantisTechniqueActivationInputType : uint8
{
	None                                     = 0,
	Primary                                  = 1,
	Secondary                                = 2,
	Max_Invalid                              = 3,
	EFortMantisTechniqueActivationInputType_MAX = 4,
};

// Enum MantisRuntime.EFortMantisTechniqueActivationTimingType
// NumValues: 0x0004
enum class EFortMantisTechniqueActivationTimingType : uint8
{
	None                                     = 0,
	Pressed                                  = 1,
	Released                                 = 2,
	EFortMantisTechniqueActivationTimingType_MAX = 3,
};

// Enum MantisRuntime.EFortMantisTechniqueAnimationType
// NumValues: 0x0004
enum class EFortMantisTechniqueAnimationType : uint8
{
	SingleMontage                            = 0,
	DynamicMontage                           = 1,
	AnimInstance                             = 2,
	EFortMantisTechniqueAnimationType_MAX    = 3,
};

// Enum MantisRuntime.EFortMantisTechniqueRootMotionType
// NumValues: 0x0004
enum class EFortMantisTechniqueRootMotionType : uint8
{
	None                                     = 0,
	ExtractFromMontageAndWarp                = 1,
	HoldPosition                             = 2,
	EFortMantisTechniqueRootMotionType_MAX   = 3,
};

// Enum MantisRuntime.EFortMantisNotifyEvent
// NumValues: 0x0004
enum class EFortMantisNotifyEvent : uint8
{
	Invalid                                  = 0,
	Branch                                   = 1,
	EndTechnique                             = 2,
	EFortMantisNotifyEvent_MAX               = 3,
};

// Enum MantisRuntime.EFortMantisNotifyWindow
// NumValues: 0x0006
enum class EFortMantisNotifyWindow : uint8
{
	Invalid                                  = 0,
	Input                                    = 1,
	Execution                                = 2,
	Damage                                   = 3,
	RootMotionWarp                           = 4,
	EFortMantisNotifyWindow_MAX              = 5,
};

// Enum MantisRuntime.EFortMantisNotifyTranslationWarpLimitRule
// NumValues: 0x0005
enum class EFortMantisNotifyTranslationWarpLimitRule : uint8
{
	None                                     = 0,
	Window                                   = 1,
	Animation                                = 2,
	Custom                                   = 3,
	EFortMantisNotifyTranslationWarpLimitRule_MAX = 4,
};

// Enum MantisRuntime.EFortMantisNotifyRotationWarpRateRule
// NumValues: 0x0003
enum class EFortMantisNotifyRotationWarpRateRule : uint8
{
	Snap                                     = 0,
	WindowDurationLerp                       = 1,
	EFortMantisNotifyRotationWarpRateRule_MAX = 2,
};

// Enum MantisRuntime.EFortMantisBranchRule
// NumValues: 0x0004
enum class EFortMantisBranchRule : uint8
{
	Off                                      = 0,
	Any                                      = 1,
	Starter                                  = 2,
	EFortMantisBranchRule_MAX                = 3,
};

// Enum MantisRuntime.EFortMantisBranchPath
// NumValues: 0x0008
enum class EFortMantisBranchPath : uint8
{
	Default                                  = 0,
	Path_1                                   = 1,
	Path_2                                   = 2,
	Path_3                                   = 3,
	Path_4                                   = 4,
	Path_5                                   = 5,
	Blocked                                  = 6,
	EFortMantisBranchPath_MAX                = 7,
};

// Enum MantisRuntime.EFortMantisWarpTranslationMethod
// NumValues: 0x0007
enum class EFortMantisWarpTranslationMethod : uint8
{
	None                                     = 0,
	OffsetFromTargetActor                    = 1,
	StaticLocation                           = 2,
	Reorient                                 = 3,
	ScaledBasedOnInput                       = 4,
	ReorientAndScaledBasedOnInput            = 5,
	EFortMantisWarpTranslationMethod_MAX     = 6,
};

// Enum MantisRuntime.EFortMantisWarpRotationMethod
// NumValues: 0x0004
enum class EFortMantisWarpRotationMethod : uint8
{
	None                                     = 0,
	FaceTargetActor                          = 1,
	StaticRotation                           = 2,
	EFortMantisWarpRotationMethod_MAX        = 3,
};

// ScriptStruct MantisRuntime.FortMantisRootMotionWarpInfo
// 0x0068 (0x0068 - 0x0000)
struct FFortMantisRootMotionWarpInfo final
{
public:
	TWeakObjectPtr<class AActor>                  WarpTarget;                                        // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class USceneComponent>         BaseComponentForRelativeTargetLocation;            // 0x0008(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector_NetQuantize                    BaseRelativeWarpTargetLocation;                    // 0x0010(0x0018)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector_NetQuantize                    LastValidWarpTargetLocation;                       // 0x0028(0x0018)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         BitPad_40_0 : 1;                                   // 0x0040(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bAllowTranslationWarp : 1;                         // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bAllowRotationWarp : 1;                            // 0x0040(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bSnapshotTargetLocation : 1;                       // 0x0040(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	bool                                          bUseAlternativeWarpingBehavior;                    // 0x0041(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortMantisWarpTranslationMethod              WarpTranslationMethod;                             // 0x0042(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantize                    WarpTranslationVector;                             // 0x0048(0x0018)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortMantisWarpRotationMethod                 WarpRotationMethod;                                // 0x0060(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WarpRotationYaw;                                   // 0x0064(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct MantisRuntime.FortMantisTechniqueMetadata
// 0x0140 (0x0140 - 0x0000)
struct FFortMantisTechniqueMetadata final
{
public:
	TMap<struct FGameplayTag, int32>              IntValues;                                         // 0x0000(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, float>              FloatValues;                                       // 0x0050(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FVector>     VectorValues;                                      // 0x00A0(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, class FString>      StringValues;                                      // 0x00F0(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct MantisRuntime.FortRootMotionSource_Mantis
// 0x00C0 (0x01A0 - 0x00E0)
struct FFortRootMotionSource_Mantis final : public FRootMotionSource
{
public:
	float                                         CurrentTechniqueTime;                              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           TechniqueMontage;                                  // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMantisRootMotionWarpInfo          WarpInfo;                                          // 0x00E8(0x0068)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                LatestRepMovementLocation;                         // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x38];                                     // 0x0168(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MantisRuntime.FortMantisTargetData
// 0x01C8 (0x01D0 - 0x0008)
struct FFortMantisTargetData final : public FGameplayAbilityTargetData
{
public:
	struct FFortMantisRootMotionWarpInfo          TechniqueWarpInfo;                                 // 0x0008(0x0068)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         TechniqueDataIndex;                                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLockedOn;                                       // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DynamicMontageName;                                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMantisTechniqueMetadata           TechniqueMetadata;                                 // 0x0080(0x0140)(NativeAccessSpecifierPublic)
	uint8                                         TechniqueContext[0xD];                             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MantisRuntime.FortMantisTechniqueCharacterSettings
// 0x001C (0x001C - 0x0000)
struct FFortMantisTechniqueCharacterSettings final
{
public:
	bool                                          bDetachCharacterRotationFromCamera;                // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReattachCharacterRotationBlendTime;                // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReattachCharacterRotationBlendExponent;            // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReattachCharacterRotationIfNoMovementInput;       // 0x000C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WindupCharacterRotationRate;                       // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExecutionCharacterRotationRate;                    // 0x0014(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecoveryCharacterRotationRate;                     // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MantisRuntime.FortMantisTechniqueData
// 0x0158 (0x0158 - 0x0000)
struct FFortMantisTechniqueData final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartsSequence;                                   // 0x0004(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEndsSequence;                                     // 0x0005(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBranchesToBlockedOnZeroDamage;                    // 0x0006(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxConsecutiveBranchesToSelf;                      // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisTechniqueAnimationType             AnimationType;                                     // 0x000C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UAnimMontage*>        DynamicMontages;                                   // 0x0018(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	class FName                                   DefaultDynamicMontageName;                         // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisTechniqueRootMotionType            RootMotionType;                                    // 0x006C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputWindowDelay;                                  // 0x0070(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisTechniqueActivationInputType       ActivationInputType;                               // 0x0074(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisTechniqueActivationTimingType      ActivationTimingType;                              // 0x0075(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinInputHoldDuration;                              // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxInputHoldDuration;                              // 0x007C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ActivationGameplayCues;                            // 0x0080(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      ActivationTagQuery;                                // 0x00A0(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      OngoingTagQuery;                                   // 0x00E8(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivationApplicationTag;                          // 0x0130(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DamageApplicationTag;                              // 0x0134(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMantisTechniqueCharacterSettings  CharacterSettings;                                 // 0x0138(0x001C)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MantisRuntime.FortMantisTechniqueBranch
// 0x000C (0x000C - 0x0000)
struct FFortMantisTechniqueBranch final
{
public:
	class FName                                   FromTechnique;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ToTechnique;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisBranchPath                         BranchPath;                                        // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MantisRuntime.FortMantisMontageData
// 0x0018 (0x0018 - 0x0000)
struct FFortMantisMontageData final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MantisRuntime.FortMantisReplicatedAnimInstanceInfo
// 0x0010 (0x0010 - 0x0000)
struct FFortMantisReplicatedAnimInstanceInfo final
{
public:
	bool                                          bIsTechniqueActive;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActiveTechniqueName;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActiveTechniqueIndex;                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActiveTechniqueConsecutiveBranchesToSelf;          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MantisRuntime.FortMantisRootMotionWarpInfoNetSerializerConfig
// 0x0000 (0x0010 - 0x0010)
struct FFortMantisRootMotionWarpInfoNetSerializerConfig final : public FNetSerializerConfig
{
};

}

