#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchQuestsRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct MatchQuestsRuntime.SquadMemberSelection
// 0x0010 (0x0010 - 0x0000)
struct FSquadMemberSelection final
{
public:
	class AFortPlayerState*                       SquadMember;                                       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OfferQuestIndex;                                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MatchQuestsRuntime.SquadMatchQuests
// 0x0020 (0x0020 - 0x0000)
struct FSquadMatchQuests final
{
public:
	TArray<TScriptInterface<class IQuestDefinitionInterface>> SquadOffer;                            // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FSquadMemberSelection>          SquadSelections;                                   // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MatchQuestsRuntime.MatchQuestsActiveBucketsTableRow
// 0x0008 (0x0010 - 0x0008)
struct FMatchQuestsActiveBucketsTableRow final : public FTableRowBase
{
public:
	struct FGameplayTag                           BucketTag;                                         // 0x0008(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

