#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchQuestsRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "DataRegistry_structs.hpp"
#include "MatchQuestsRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class MatchQuestsRuntime.FortGameStateComponent_SquadMatchQuests
// 0x00B8 (0x0158 - 0x00A0)
class UFortGameStateComponent_SquadMatchQuests final : public UFortGameStateComponent
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataRegistryType                      DataRegistryType_ActiveMatchQuestBuckets;          // 0x00B8(0x0004)(ZeroConstructor, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   ActiveBuckets;                                     // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<uint8, struct FSquadMatchQuests>         SquadQuestsMap;                                    // 0x00D0(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x38];                                     // 0x0120(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameStateComponent_SquadMatchQuests">();
	}
	static class UFortGameStateComponent_SquadMatchQuests* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameStateComponent_SquadMatchQuests>();
	}
};

// Class MatchQuestsRuntime.FortPlayerStateComponent_MatchQuests
// 0x0090 (0x0130 - 0x00A0)
class UFortPlayerStateComponent_MatchQuests final : public UFortPlayerStateComponent
{
public:
	uint8                                         Pad_A0[0x30];                                      // 0x00A0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class IQuestDefinitionInterface>> QuestOffering;                         // 0x00D0(0x0010)(Net, ZeroConstructor, RepNotify, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FSquadMemberSelection>          SquadSelections;                                   // 0x00E0(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x40];                                      // 0x00F0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLandedFromBus(class AFortPlayerControllerZone* PlayerController);
	void Server_SetSelectedQuest(const TScriptInterface<class IQuestDefinitionInterface>& Quest);
	void TryToGrantSelectedQuest(const struct FFortGamePhaseUpdatedEvent& FortGamePhaseUpdatedEvent);

	void OnRep_QuestOffering() const;
	void OnRep_SquadSelections() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPlayerStateComponent_MatchQuests">();
	}
	static class UFortPlayerStateComponent_MatchQuests* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerStateComponent_MatchQuests>();
	}
};

// Class MatchQuestsRuntime.FortQuestDefinitionComponent_MatchQuests
// 0x0000 (0x0078 - 0x0078)
class UFortQuestDefinitionComponent_MatchQuests final : public UFortQuestDefinitionComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuestDefinitionComponent_MatchQuests">();
	}
	static class UFortQuestDefinitionComponent_MatchQuests* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestDefinitionComponent_MatchQuests>();
	}
};

// Class MatchQuestsRuntime.FortQuestItemComponent_MatchQuests
// 0x0010 (0x0040 - 0x0030)
class UFortQuestItemComponent_MatchQuests final : public UFortQuestItemComponent
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuestItemComponent_MatchQuests">();
	}
	static class UFortQuestItemComponent_MatchQuests* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestItemComponent_MatchQuests>();
	}
};

// Class MatchQuestsRuntime.MatchQuestsCheatManager
// 0x0000 (0x0028 - 0x0028)
class UMatchQuestsCheatManager final : public UChildCheatManager
{
public:
	void MatchQuests_LogAvailableQuestsPool();
	void MatchQuests_LogRNGSeeds();

	void MatchQuests_ForceQuestInOffer(const class FString& QuestName) const;
	void MatchQuests_LogReportSimulatedRolls(const int32 RollsToSimulate) const;
	void MatchQuests_LogSquadSelections() const;
	void MatchQuests_RollNewOffer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchQuestsCheatManager">();
	}
	static class UMatchQuestsCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchQuestsCheatManager>();
	}
};

}

