#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaPlate

#include "Basic.hpp"


namespace SDK
{

// Enum MediaPlate.EMediaPlateResourceType
// NumValues: 0x0004
enum class EMediaPlateResourceType : uint8
{
	Playlist                                 = 0,
	External                                 = 1,
	Asset                                    = 2,
	EMediaPlateResourceType_MAX              = 3,
};

// Enum MediaPlate.EMediaPlateEventState
// NumValues: 0x0008
enum class EMediaPlateEventState : uint8
{
	Play                                     = 0,
	Open                                     = 1,
	Close                                    = 2,
	Pause                                    = 3,
	Reverse                                  = 4,
	Forward                                  = 5,
	Rewind                                   = 6,
	MAX                                      = 7,
};

// ScriptStruct MediaPlate.MediaPlateResource
// 0x0068 (0x0068 - 0x0000)
struct FMediaPlateResource final
{
public:
	EMediaPlateResourceType                       Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ExternalMediaPath;                                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaSource*                           ExternalMedia;                                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMediaSource>            MediaAsset;                                        // 0x0020(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMediaPlaylist>          SourcePlaylist;                                    // 0x0040(0x0020)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaPlaylist*                         ActivePlaylist;                                    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct MediaPlate.MediaTextureResourceSettings
// 0x0002 (0x0002 - 0x0000)
struct FMediaTextureResourceSettings final
{
public:
	bool                                          bEnableGenMips;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CurrentNumMips;                                    // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

