#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoonFlaxWarBusUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function MoonFlaxWarBusUI.MoonFlaxWarBusActionWidget.BP_ActionTagChanged
// 0x0001 (0x0001 - 0x0000)
struct MoonFlaxWarBusActionWidget_BP_ActionTagChanged final
{
public:
	bool                                          bIsActionAvailable;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MoonFlaxWarBusUI.MoonFlaxWarBusActionWidget.BP_CooldownTagChanged
// 0x000C (0x000C - 0x0000)
struct MoonFlaxWarBusActionWidget_BP_CooldownTagChanged final
{
public:
	bool                                          bIsInCooldown;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TotalDuration;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeRemaining;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MoonFlaxWarBusUI.MoonFlaxWarBusActionWidget.GetCooldownTimeRemaining
// 0x0004 (0x0004 - 0x0000)
struct MoonFlaxWarBusActionWidget_GetCooldownTimeRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

