#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieSceneGameplayEventTrack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StructUtils_structs.hpp"
#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct MovieSceneGameplayEventTrack.MovieSceneGameplayEvent
// 0x0040 (0x0040 - 0x0000)
struct FMovieSceneGameplayEvent final
{
public:
	struct FMemberReference                       GameplayEventFunctionProperty;                     // 0x0000(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FInstancedPropertyBag                  Payload;                                           // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct MovieSceneGameplayEventTrack.MovieSceneGameplayEventChannel
// 0x00A8 (0x00F8 - 0x0050)
struct FMovieSceneGameplayEventChannel final : public FMovieSceneChannel
{
public:
	TArray<struct FFrameNumber>                   KeyTimes;                                          // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneGameplayEvent>       KeyValues;                                         // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FMovieSceneKeyHandleMap                KeyHandles;                                        // 0x0070(0x0088)(Transient, NativeAccessSpecifierPrivate)
};

// ScriptStruct MovieSceneGameplayEventTrack.MovieSceneGameplayEventTriggerData
// 0x0060 (0x0060 - 0x0000)
struct FMovieSceneGameplayEventTriggerData final
{
public:
	struct FMemberReference                       GameplayEventFunctionProperty;                     // 0x0000(0x0030)(NativeAccessSpecifierPublic)
	struct FInstancedPropertyBag                  Payload;                                           // 0x0030(0x0010)(NativeAccessSpecifierPublic)
	struct FGuid                                  ObjectBindingID;                                   // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

