#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NearestNeighborModel

#include "Basic.hpp"

#include "MLDeformerFramework_classes.hpp"
#include "NearestNeighborModel_structs.hpp"
#include "ComputeFramework_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "OptimusCore_classes.hpp"


namespace SDK
{

// Class NearestNeighborModel.NearestNeighborModelVizSettings
// 0x0000 (0x0038 - 0x0038)
class UNearestNeighborModelVizSettings final : public UMLDeformerMorphModelVizSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborModelVizSettings">();
	}
	static class UNearestNeighborModelVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborModelVizSettings>();
	}
};

// Class NearestNeighborModel.NearestNeighborNetworkLayer
// 0x0018 (0x0040 - 0x0028)
class UNearestNeighborNetworkLayer : public UObject
{
public:
	int32                                         NumInputs;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumOutputs;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNearestNeighborNetworkParameter> Parameters;                                      // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborNetworkLayer">();
	}
	static class UNearestNeighborNetworkLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborNetworkLayer>();
	}
};

// Class NearestNeighborModel.NearestNeighborNetworkLayer_Gemm_Prelu
// 0x0000 (0x0040 - 0x0040)
class UNearestNeighborNetworkLayer_Gemm_Prelu final : public UNearestNeighborNetworkLayer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborNetworkLayer_Gemm_Prelu">();
	}
	static class UNearestNeighborNetworkLayer_Gemm_Prelu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborNetworkLayer_Gemm_Prelu>();
	}
};

// Class NearestNeighborModel.NearestNeighborNetworkLayer_Gemm
// 0x0000 (0x0040 - 0x0040)
class UNearestNeighborNetworkLayer_Gemm final : public UNearestNeighborNetworkLayer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborNetworkLayer_Gemm">();
	}
	static class UNearestNeighborNetworkLayer_Gemm* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborNetworkLayer_Gemm>();
	}
};

// Class NearestNeighborModel.NearestNeighborOptimizedNetwork
// 0x0030 (0x0058 - 0x0028)
class UNearestNeighborOptimizedNetwork final : public UObject
{
public:
	class UNNEModelData*                          ModelData;                                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumInputs;                                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumOutputs;                                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UNearestNeighborNetworkLayer*>   Layers;                                            // 0x0048(0x0010)(ZeroConstructor, Deprecated, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void Empty();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborOptimizedNetwork">();
	}
	static class UNearestNeighborOptimizedNetwork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborOptimizedNetwork>();
	}
};

// Class NearestNeighborModel.NearestNeighborOptimizedNetworkInstance
// 0x0038 (0x0060 - 0x0028)
class UNearestNeighborOptimizedNetworkInstance final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UNearestNeighborOptimizedNetwork*       Network;                                           // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborOptimizedNetworkInstance">();
	}
	static class UNearestNeighborOptimizedNetworkInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborOptimizedNetworkInstance>();
	}
};

// Class NearestNeighborModel.NearestNeighborOptimizedNetworkLoader
// 0x0008 (0x0030 - 0x0028)
class UNearestNeighborOptimizedNetworkLoader final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool LoadOptimizedNetwork(const class FString& OnnxPath);

	class UNearestNeighborOptimizedNetwork* GetOptimizedNetwork() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborOptimizedNetworkLoader">();
	}
	static class UNearestNeighborOptimizedNetworkLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborOptimizedNetworkLoader>();
	}
};

// Class NearestNeighborModel.NearestNeighborModelSection
// 0x0028 (0x0050 - 0x0028)
class UNearestNeighborModelSection final : public UObject
{
public:
	int32                                         NumPCACoeffs;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumVertices;                                       // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RuntimeNumNeighbors;                               // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 RuntimeNeighborCoeffs;                             // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsReadyForTraining;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsReadyForInference;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetNumBasis() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborModelSection">();
	}
	static class UNearestNeighborModelSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborModelSection>();
	}
};

// Class NearestNeighborModel.NearestNeighborModel
// 0x0098 (0x0240 - 0x01A8)
class UNearestNeighborModel final : public UMLDeformerMorphModel
{
public:
	int32                                         InputDim;                                          // 0x01A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OutputDim;                                         // 0x01AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseInputMultipliers;                              // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector3f>                      InputMultipliers;                                  // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 InputsMin;                                         // 0x01C8(0x0010)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 InputsMax;                                         // 0x01D8(0x0010)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bUsePCA;                                           // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumBasisPerSection;                                // 0x01EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseDualQuaternionDeltas;                          // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecayFactor;                                       // 0x01F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NearestNeighborOffsetWeight;                       // 0x01F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseRBF;                                           // 0x01FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RBFSigma;                                          // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNearestNeighborModelSection*>   Sections;                                          // 0x0208(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<int32>                                 PCACoeffStarts;                                    // 0x0218(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bIsReadyForTraining;                               // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsReadyForInference;                              // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNearestNeighborOptimizedNetwork*       OptimizedNetwork;                                  // 0x0230(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool DoesUsePCA() const;
	int32 GetNumSections() const;
	const TArray<int32> GetPCACoeffStarts() const;
	const class UNearestNeighborModelSection* GetSectionPtr(int32 Index_0) const;
	int32 GetTotalNumBasis() const;
	bool IsReadyForInference() const;
	bool IsReadyForTraining() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborModel">();
	}
	static class UNearestNeighborModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborModel>();
	}
};

// Class NearestNeighborModel.NearestNeighborModelInputInfo
// 0x0010 (0x0078 - 0x0068)
class UNearestNeighborModelInputInfo final : public UMLDeformerMorphModelInputInfo
{
public:
	TArray<struct FQuat>                          RefBoneRotations;                                  // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborModelInputInfo">();
	}
	static class UNearestNeighborModelInputInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborModelInputInfo>();
	}
};

// Class NearestNeighborModel.NearestNeighborModelInstance
// 0x0030 (0x00C0 - 0x0090)
class UNearestNeighborModelInstance final : public UMLDeformerMorphModelInstance
{
public:
	uint8                                         Pad_90[0x28];                                      // 0x0090(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UNearestNeighborOptimizedNetworkInstance* OptimizedNetworkInstance;                        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	TArray<float> Eval(const TArray<float>& InputData);
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NearestNeighborModelInstance">();
	}
	static class UNearestNeighborModelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNearestNeighborModelInstance>();
	}
};

// Class NearestNeighborModel.OptimusSkeletonWithQuatsDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusSkeletonWithQuatsDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkeletonWithQuatsDataInterface">();
	}
	static class UOptimusSkeletonWithQuatsDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletonWithQuatsDataInterface>();
	}
};

// Class NearestNeighborModel.OptimusSkeletonWithQuatsDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusSkeletonWithQuatsDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusSkeletonWithQuatsDataProvider">();
	}
	static class UOptimusSkeletonWithQuatsDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletonWithQuatsDataProvider>();
	}
};

}

