#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitroUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class NitroUI.NitroPlayerInfoWidget
// 0x0010 (0x0330 - 0x0320)
class UNitroPlayerInfoWidget final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_320[0x10];                                     // 0x0320(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerDeadStateChanged(class AFortPlayerStateAthena* PlayerState, bool bIsDead);
	void OnPlayerStateSet(class AFortPlayerStateAthena* InPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitroPlayerInfoWidget">();
	}
	static class UNitroPlayerInfoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitroPlayerInfoWidget>();
	}
};

// Class NitroUI.NitroVehicleFuelGaugeWidget
// 0x00A0 (0x0358 - 0x02B8)
class UNitroVehicleFuelGaugeWidget final : public UUserWidget
{
public:
	uint8                                         Pad_2B8[0x88];                                     // 0x02B8(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           NitroActiveTag;                                    // 0x0340(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           NitroEffectTag;                                    // 0x0344(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortVehicleFuelGauge*                  TargetFuelGauge;                                   // 0x0348(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_350[0x8];                                      // 0x0350(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnFuelValueChanged(float NewFuelValue, bool bIsFuelLow);
	void BP_OnNitroStateChanged(bool bNitroActive);
	void FuelValueChangedHandler(float NewFuelValue, bool bIsFuelLow);
	void OnRefuelingCosmeticsFinished();
	void OnRefuelingCosmeticsStarted(const bool bIsTankFull);
	void OnTankFull();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitroVehicleFuelGaugeWidget">();
	}
	static class UNitroVehicleFuelGaugeWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitroVehicleFuelGaugeWidget>();
	}
};

}

