#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitroGameplayRuntime

#include "Basic.hpp"

#include "ModularGameplay_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "TargetingSystem_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class NitroGameplayRuntime.FortGA_NitroBashBase
// 0x0008 (0x0B48 - 0x0B40)
class UFortGA_NitroBashBase final : public UFortGameplayAbility
{
public:
	TWeakObjectPtr<class AFortAthenaVehicle>      VehicleOnwer;                                      // 0x0B40(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_OnVehicleDestroyedBuiding();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGA_NitroBashBase">();
	}
	static class UFortGA_NitroBashBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGA_NitroBashBase>();
	}
};

// Class NitroGameplayRuntime.FortGCNL_Nitro_Active_Base
// 0x0058 (0x0A08 - 0x09B0)
class AFortGCNL_Nitro_Active_Base final : public AFortGameplayCueNotify_Loop
{
public:
	float                                         IntervalToUpdateTimerHandleForVFX;                 // 0x09B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9B4[0x4];                                      // 0x09B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  NitroStateEffectTags;                              // 0x09B8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          UseEffectDuration;                                 // 0x09D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D9[0x3];                                      // 0x09D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            NitroStateEffectHandle;                            // 0x09DC(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9E4[0x4];                                      // 0x09E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x09E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemainingDuration;                                 // 0x09F0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UFortAbilitySystemComponent> OwnerAbilitySystemComponent;                   // 0x09F4(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9FC[0xC];                                      // 0x09FC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateCurrentSpeed(float NewCurrentSpeed);
	void UpdateDurationAndVFXParameters();
	void UpdateRemainingDuration(float NewRemainingDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGCNL_Nitro_Active_Base">();
	}
	static class AFortGCNL_Nitro_Active_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortGCNL_Nitro_Active_Base>();
	}
};

// Class NitroGameplayRuntime.FortMovementMode_PlayerNitroStateRuntimeData
// 0x0010 (0x0048 - 0x0038)
class UFortMovementMode_PlayerNitroStateRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_PlayerNitroStateRuntimeData">();
	}
	static class UFortMovementMode_PlayerNitroStateRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_PlayerNitroStateRuntimeData>();
	}
};

// Class NitroGameplayRuntime.FortMovementMode_ExtLogicNitroState
// 0x0140 (0x0250 - 0x0110)
class UFortMovementMode_ExtLogicNitroState final : public UFortMovementMode_BaseExtLogic
{
public:
	struct FScalableFloat                         SwimSpeedSpeedMultiplier;                          // 0x0110(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         LandSpeedMultiplier;                               // 0x0138(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         JumpZVelocityMultiplier;                           // 0x0160(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         JumpHorizontalVelocityOverride;                    // 0x0188(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         JumpHorizontalAccelerationOverride;                // 0x01B0(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScalableFloat                         DotThresholdToApplyJumpBoostTag;                   // 0x01D8(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequiredTagsToApplyHorizontalJumpBoost;            // 0x0200(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   GameplayCuesTagsToPush;                            // 0x0220(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_230[0x20];                                     // 0x0230(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_ExtLogicNitroState">();
	}
	static class UFortMovementMode_ExtLogicNitroState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_ExtLogicNitroState>();
	}
};

// Class NitroGameplayRuntime.FortPawnComponent_NitroPlayerState
// 0x0020 (0x00C8 - 0x00A8)
class UFortPawnComponent_NitroPlayerState final : public UFortPawnComponent
{
public:
	TSubclassOf<class UFortMovementMode_ExtLogicNitroState> NitroStateMovementModeExtension;         // 0x00A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           NitroPlayerStateMovementTag;                       // 0x00B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x14];                                      // 0x00B4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndNitroState();
	void HandleControllerChanged(class APawn* Pawn, class AController* OldController, class AController* NewController);
	void StartNitroPlayerStateMovement();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPawnComponent_NitroPlayerState">();
	}
	static class UFortPawnComponent_NitroPlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPawnComponent_NitroPlayerState>();
	}
};

// Class NitroGameplayRuntime.FortWeaponNitroGauntlets
// 0x0038 (0x1DA0 - 0x1D68)
class AFortWeaponNitroGauntlets final : public AFortWeaponRanged
{
public:
	TMulticastInlineDelegate<void(bool bFoundTarget, bool bGroundPunch)> OnUpdatePunchPreview;       // 0x1D68(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FTargetingRequestHandle                PunchPreviewAsyncTargetingHandle;                  // 0x1D78(0x0004)(BlueprintVisible, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D7C[0x4];                                     // 0x1D7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTargetingPreset*                       GroundPunchTargetingPreset;                        // 0x1D80(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTargetingPreset*                       AirPunchTargetingPreset;                           // 0x1D88(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D90[0x10];                                    // 0x1D90(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CleanupAsyncTargeting();
	void UpdatePunchPreviewNative();

	bool IsAirPunch() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortWeaponNitroGauntlets">();
	}
	static class AFortWeaponNitroGauntlets* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortWeaponNitroGauntlets>();
	}
};

// Class NitroGameplayRuntime.NirtroBashLayerAnimInstance
// 0x0050 (0x1420 - 0x13D0)
class UNirtroBashLayerAnimInstance final : public UFortPlayerAnimInstanceProxy
{
public:
	bool                                          bIsBash_01;                                        // 0x13C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBash_02;                                        // 0x13C9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsExitBash;                                       // 0x13CA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBounceBack;                                     // 0x13CB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTacSprintOrBashing;                             // 0x13CC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCurrentlyBashing;                               // 0x13CD(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13CE[0x2];                                     // 0x13CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          UpperBodyBash;                                     // 0x13D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          FullBodyBash;                                      // 0x13D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          UpperBodyBashSequenceA;                            // 0x13E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          UpperBodyBashSequenceB;                            // 0x13E8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          FullBodyBashSequenceA;                             // 0x13F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          FullBodyBashSequenceB;                             // 0x13F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TacticalSprintTag;                                 // 0x1400(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           BounceBackTag;                                     // 0x1404(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           IsBashingTag;                                      // 0x1408(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_140C[0x14];                                    // 0x140C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NirtroBashLayerAnimInstance">();
	}
	static class UNirtroBashLayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNirtroBashLayerAnimInstance>();
	}
};

// Class NitroGameplayRuntime.NitroGameplayAnalytics
// 0x0070 (0x0110 - 0x00A0)
class UNitroGameplayAnalytics final : public UGameStateComponent
{
public:
	uint8                                         Pad_A0[0x70];                                      // 0x00A0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void RegisterNitroAnalytics(const class AFortPlayerController* FortPlayerController, const class FString& Source);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NitroGameplayAnalytics">();
	}
	static class UNitroGameplayAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitroGameplayAnalytics>();
	}
};

}

