#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitroDromeRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum NitroDromeRuntime.ENitroDromeRewardStatus
// NumValues: 0x0005
enum class ENitroDromeRewardStatus : uint8
{
	Inactive                                 = 0,
	Active                                   = 1,
	Paused                                   = 2,
	Finished                                 = 3,
	ENitroDromeRewardStatus_MAX              = 4,
};

// Enum NitroDromeRuntime.EFortNitroDromeParticipationState
// NumValues: 0x0004
enum class EFortNitroDromeParticipationState : uint8
{
	None                                     = 0,
	Entered                                  = 1,
	Exited                                   = 2,
	EFortNitroDromeParticipationState_MAX    = 3,
};

// ScriptStruct NitroDromeRuntime.FortEventReaction_NitroDrome_AffectRewardTimer
// 0x0048 (0x0050 - 0x0008)
struct FFortEventReaction_NitroDrome_AffectRewardTimer final : public FEventReactionBase
{
public:
	struct FScalableFloat                         TimeDelta;                                         // 0x0008(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  ContextTags;                                       // 0x0030(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
};

// ScriptStruct NitroDromeRuntime.FortEventReaction_NitroDrome_PlayAudio
// 0x0008 (0x0010 - 0x0008)
struct FFortEventReaction_NitroDrome_PlayAudio final : public FEventReactionBase
{
public:
	class USoundBase*                             Sound;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct NitroDromeRuntime.FortMaterialParamLerpData
// 0x0040 (0x0040 - 0x0000)
struct FFortMaterialParamLerpData final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         TimeToCompleteCurve;                               // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
	class UCurveFloat*                            Curve;                                             // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialParameterCollection*           ParamCollection;                                   // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NitroDromeRuntime.FortEventReaction_NitroDrome_SetMaterialCollectionFloatOverTime
// 0x0040 (0x0048 - 0x0008)
struct FFortEventReaction_NitroDrome_SetMaterialCollectionFloatOverTime final : public FEventReactionBase
{
public:
	struct FFortMaterialParamLerpData             LerpData;                                          // 0x0008(0x0040)(Edit, NativeAccessSpecifierPrivate)
};

// ScriptStruct NitroDromeRuntime.FortEventReaction_NitroDrome_TriggerTagEvent
// 0x0008 (0x0010 - 0x0008)
struct FFortEventReaction_NitroDrome_TriggerTagEvent final : public FEventReactionBase
{
public:
	struct FGameplayTag                           ReactionTag;                                       // 0x0008(0x0004)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct NitroDromeRuntime.FortNitroDromeReactionData
// 0x0010 (0x0010 - 0x0000)
struct FFortNitroDromeReactionData final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeAdded;                                         // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  WeakEventAuthor;                                   // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NitroDromeRuntime.FortMaterialParamLerpTimerData
// 0x0058 (0x0058 - 0x0000)
struct FFortMaterialParamLerpTimerData final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandle;                                       // 0x0010(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortMaterialParamLerpData             LerpData;                                          // 0x0018(0x0040)(Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct NitroDromeRuntime.OnNitroDromeEventTriggered
// 0x0004 (0x0004 - 0x0000)
struct FOnNitroDromeEventTriggered final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NitroDromeRuntime.OnNitroDromeReactableEventHappened
// 0x0020 (0x0020 - 0x0000)
struct FOnNitroDromeReactableEventHappened final
{
public:
	struct FGameplayTagContainer                  EventTagContainer;                                 // 0x0000(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct NitroDromeRuntime.FortNitroDromeEventReactionsTableRow
// 0x0010 (0x0080 - 0x0070)
struct FFortNitroDromeEventReactionsTableRow final : public FFortEventReactionsTableRow
{
public:
	int32                                         Priority;                                          // 0x0070(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cooldown;                                          // 0x0074(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDropIfNotImmediatelyTriggerable;                  // 0x0078(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct NitroDromeRuntime.NitroDromeRewardStatusData
// 0x000C (0x000C - 0x0000)
struct FNitroDromeRewardStatusData final
{
public:
	ENitroDromeRewardStatus                       RewardStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ServerTimeStatusChanged;                           // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeRemaining;                                     // 0x0008(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NitroDromeRuntime.OnDromeTimeAffectingActionHappened
// 0x0030 (0x0030 - 0x0000)
struct FOnDromeTimeAffectingActionHappened final
{
public:
	float                                         TimeDelta;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Author;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  EventTags;                                         // 0x0010(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
};

// ScriptStruct NitroDromeRuntime.OnDromeRewardStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct FOnDromeRewardStatusChanged final
{
public:
	ENitroDromeRewardStatus                       Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENitroDromeRewardStatus                       OldStatus;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortNitroDromeRewardManager*           RewardManager;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct NitroDromeRuntime.DromeTimeAffectingData
// 0x0038 (0x0038 - 0x0000)
struct FDromeTimeAffectingData final
{
public:
	float                                         ServerAffectTime;                                  // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnDromeTimeAffectingActionHappened    Data;                                              // 0x0008(0x0030)(Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct NitroDromeRuntime.FortVerbFilter_NitroDromeParticipationChanged
// 0x0008 (0x01C0 - 0x01B8)
struct FFortVerbFilter_NitroDromeParticipationChanged final : public FFortObjectiveFilter_VehicleBase
{
public:
	uint8                                         bRequireDromeParticipationState : 1;               // 0x01B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EFortNitroDromeParticipationState             ParticipationState;                                // 0x01B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct NitroDromeRuntime.FortVerbFilter_NitroDromeReactiveEventHappened
// 0x0048 (0x00E8 - 0x00A0)
struct FFortVerbFilter_NitroDromeReactiveEventHappened final : public FObjectiveFilter
{
public:
	struct FGameplayTagQuery                      EventTagQuery;                                     // 0x00A0(0x0048)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct NitroDromeRuntime.FortVerbMessage_NitroDromeParticipationChanged
// 0x0008 (0x0110 - 0x0108)
struct FFortVerbMessage_NitroDromeParticipationChanged final : public FFortVerbMessage_VehicleBase
{
public:
	EFortNitroDromeParticipationState             ParticipationState;                                // 0x0108(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct NitroDromeRuntime.FortVerbMessage_NitroDromeReactiveEventHappened
// 0x0020 (0x0098 - 0x0078)
struct FFortVerbMessage_NitroDromeReactiveEventHappened final : public FVerbMessage
{
public:
	struct FGameplayTagContainer                  EventTagContainer;                                 // 0x0078(0x0020)(Edit, EditConst, NativeAccessSpecifierPrivate)
};

}

