#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitroUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function NitroUI.NitroPlayerInfoWidget.OnPlayerDeadStateChanged
// 0x0010 (0x0010 - 0x0000)
struct NitroPlayerInfoWidget_OnPlayerDeadStateChanged final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDead;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NitroUI.NitroPlayerInfoWidget.OnPlayerStateSet
// 0x0008 (0x0008 - 0x0000)
struct NitroPlayerInfoWidget_OnPlayerStateSet final
{
public:
	class AFortPlayerStateAthena*                 InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroUI.NitroVehicleFuelGaugeWidget.BP_OnFuelValueChanged
// 0x0008 (0x0008 - 0x0000)
struct NitroVehicleFuelGaugeWidget_BP_OnFuelValueChanged final
{
public:
	float                                         NewFuelValue;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFuelLow;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NitroUI.NitroVehicleFuelGaugeWidget.BP_OnNitroStateChanged
// 0x0001 (0x0001 - 0x0000)
struct NitroVehicleFuelGaugeWidget_BP_OnNitroStateChanged final
{
public:
	bool                                          bNitroActive;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroUI.NitroVehicleFuelGaugeWidget.FuelValueChangedHandler
// 0x0008 (0x0008 - 0x0000)
struct NitroVehicleFuelGaugeWidget_FuelValueChangedHandler final
{
public:
	float                                         NewFuelValue;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFuelLow;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NitroUI.NitroVehicleFuelGaugeWidget.OnRefuelingCosmeticsStarted
// 0x0001 (0x0001 - 0x0000)
struct NitroVehicleFuelGaugeWidget_OnRefuelingCosmeticsStarted final
{
public:
	bool                                          bIsTankFull;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

