#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitroDromeRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteAI_structs.hpp"
#include "NitroDromeRuntime_structs.hpp"


namespace SDK::Params
{

// Function NitroDromeRuntime.FortCheatManager_NitroDrome.AddNitroDromeReactionToQueue
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_NitroDrome_AddNitroDromeReactionToQueue final
{
public:
	class FName                                   ReactionRowName;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeAnalyticsComponent.OnVehicleBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct FortNitroDromeAnalyticsComponent_OnVehicleBeginOverlap final
{
public:
	class AFortAthenaVehicle*                     OverlappingVehicle;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeAnalyticsComponent.OnVehicleEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct FortNitroDromeAnalyticsComponent_OnVehicleEndOverlap final
{
public:
	class AFortAthenaVehicle*                     OverlappingVehicle;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeAnalyticsComponent.OnVehicleOutOfHealth
// 0x0038 (0x0038 - 0x0000)
struct FortNitroDromeAnalyticsComponent_OnVehicleOutOfHealth final
{
public:
	class AFortAthenaVehicle*                     DeadVehicle;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InTags;                                            // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AController*                            EventInstigator;                                   // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeAnalyticsComponent.GetMidMatchObjectiveAnalyticsAttributeList
// 0x0010 (0x0010 - 0x0000)
struct FortNitroDromeAnalyticsComponent_GetMidMatchObjectiveAnalyticsAttributeList final
{
public:
	TArray<struct FFortAnalyticsEventAttribute>   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeAnalyticsComponent.WasNitroDromeCaptured
// 0x0001 (0x0001 - 0x0000)
struct FortNitroDromeAnalyticsComponent_WasNitroDromeCaptured final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeDirector.BroadcastNitroDromeReactableEvent
// 0x0020 (0x0020 - 0x0000)
struct FortNitroDromeDirector_BroadcastNitroDromeReactableEvent final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeDirector.OnBossAlertLevelChanged
// 0x0010 (0x0010 - 0x0000)
struct FortNitroDromeDirector_OnBossAlertLevelChanged final
{
public:
	class AFortAthenaAIBotController*             BotController;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlertLevel                                   OldAlertLevel;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlertLevel                                   NewAlertLevel;                                     // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function NitroDromeRuntime.FortNitroDromeDirector.OnEventFinishedCooldown
// 0x0004 (0x0004 - 0x0000)
struct FortNitroDromeDirector_OnEventFinishedCooldown final
{
public:
	class FName                                   ReactionRow;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeDirector.OnEventTriggered
// 0x0004 (0x0004 - 0x0000)
struct FortNitroDromeDirector_OnEventTriggered final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeDirector.PlaySoundOnLoudSpeakers
// 0x0008 (0x0008 - 0x0000)
struct FortNitroDromeDirector_PlaySoundOnLoudSpeakers final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeRewardManager.AffectTimer
// 0x0030 (0x0030 - 0x0000)
struct FortNitroDromeRewardManager_AffectTimer final
{
public:
	struct FOnDromeTimeAffectingActionHappened    AffectingData;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeRewardManager.BP_OnRewardStatusChanged
// 0x0018 (0x0018 - 0x0000)
struct FortNitroDromeRewardManager_BP_OnRewardStatusChanged final
{
public:
	struct FNitroDromeRewardStatusData            OldRewardStatus;                                   // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FNitroDromeRewardStatusData            NewRewardStatus;                                   // 0x000C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeRewardManager.BP_OnTimerAffected
// 0x0030 (0x0030 - 0x0000)
struct FortNitroDromeRewardManager_BP_OnTimerAffected final
{
public:
	struct FOnDromeTimeAffectingActionHappened    AffectingData;                                     // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeRewardManager.OnRep_CurrentRewardStatus
// 0x000C (0x000C - 0x0000)
struct FortNitroDromeRewardManager_OnRep_CurrentRewardStatus final
{
public:
	struct FNitroDromeRewardStatusData            OldStatus;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeRewardManager.StartTimer
// 0x0004 (0x0004 - 0x0000)
struct FortNitroDromeRewardManager_StartTimer final
{
public:
	float                                         StartTimeDelta;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeRewardManager.GetCurrentRewardStatus
// 0x0001 (0x0001 - 0x0000)
struct FortNitroDromeRewardManager_GetCurrentRewardStatus final
{
public:
	ENitroDromeRewardStatus                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeRewardManager.GetLootTierForCurrentPlaylist
// 0x0004 (0x0004 - 0x0000)
struct FortNitroDromeRewardManager_GetLootTierForCurrentPlaylist final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeRewardManager.GetProgressPercentage
// 0x0004 (0x0004 - 0x0000)
struct FortNitroDromeRewardManager_GetProgressPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function NitroDromeRuntime.FortNitroDromeRewardManager.GetRewardTimerHandle
// 0x0008 (0x0008 - 0x0000)
struct FortNitroDromeRewardManager_GetRewardTimerHandle final
{
public:
	struct FTimerHandle                           ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

