#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ORS

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct ORS.ClassTuple
// 0x0040 (0x0040 - 0x0000)
struct FClassTuple final
{
public:
	class UClass*                                 _Classes[0x7];                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ORS.ORSClassTupleList
// 0x0010 (0x0010 - 0x0000)
struct FORSClassTupleList final
{
public:
	TArray<class UORSClassTuple*>                 ClassTuples;                                       // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct ORS.ORSGroupObjectList
// 0x0010 (0x0010 - 0x0000)
struct FORSGroupObjectList final
{
public:
	TArray<class UObject*>                        BuiltObjects;                                      // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct ORS.ORSGroupRef
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x04) FORSGroupRef final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ORS.ORSInstanceRef
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FORSInstanceRef final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ORS.ORSNetSerializableReplicationProxy
// 0x0038 (0x0038 - 0x0000)
struct FORSNetSerializableReplicationProxy final
{
public:
	TScriptInterface<class IORSNetSerializable>   Object;                                            // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UObject>                    ObjectClass;                                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<uint8>                                 ObjectData;                                        // 0x0018(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UPackageMap*                            ClientPackageMap;                                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ORS.ORSObjectArray
// 0x0038 (0x0038 - 0x0000)
struct FORSObjectArray final
{
public:
	class UObject*                                _Objects[0x7];                                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct ORS.ORSObjectTuple
// 0x0040 (0x0040 - 0x0000)
struct FORSObjectTuple final
{
public:
	struct FORSObjectArray                        _Objects;                                          // 0x0000(0x0038)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct ORS.ORSTransactionCache
// 0x0028 (0x0028 - 0x0000)
struct FORSTransactionCache final
{
public:
	class UORSInstance*                           Instance;                                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

