#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerformanceCaptureCore

#include "Basic.hpp"

#include "IKRig_structs.hpp"
#include "LiveLinkInterface_structs.hpp"


namespace SDK::Params
{

// Function PerformanceCaptureCore.CaptureCharacter.GetCustomRetargetProfile
// 0x0100 (0x0100 - 0x0000)
struct CaptureCharacter_GetCustomRetargetProfile final
{
public:
	struct FRetargetProfile                       ReturnValue;                                       // 0x0000(0x0100)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.CaptureCharacter.SetCustomRetargetProfile
// 0x0100 (0x0100 - 0x0000)
struct CaptureCharacter_SetCustomRetargetProfile final
{
public:
	struct FRetargetProfile                       InProfile;                                         // 0x0000(0x0100)(Parm, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.CaptureCharacter.SetForceAllSkeletalMeshesToFollowLeader
// 0x0001 (0x0001 - 0x0000)
struct CaptureCharacter_SetForceAllSkeletalMeshesToFollowLeader final
{
public:
	bool                                          InFollowLeader;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.CaptureCharacter.SetRetargetAsset
// 0x0008 (0x0008 - 0x0000)
struct CaptureCharacter_SetRetargetAsset final
{
public:
	class UIKRetargeter*                          InRetargetAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.CaptureCharacter.SetSourcePerformer
// 0x0008 (0x0008 - 0x0000)
struct CaptureCharacter_SetSourcePerformer final
{
public:
	class ACapturePerformer*                      InPerformer;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.CapturePerformer.GetEvaluateLiveLinkData
// 0x0001 (0x0001 - 0x0000)
struct CapturePerformer_GetEvaluateLiveLinkData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.CapturePerformer.SetEvaluateLiveLinkData
// 0x0001 (0x0001 - 0x0000)
struct CapturePerformer_SetEvaluateLiveLinkData final
{
public:
	bool                                          bEvaluateLinkLink;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.CapturePerformer.SetLiveLinkSubject
// 0x0004 (0x0004 - 0x0000)
struct CapturePerformer_SetLiveLinkSubject final
{
public:
	struct FLiveLinkSubjectName                   Subject;                                           // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.CapturePerformer.SetMocapMesh
// 0x0008 (0x0008 - 0x0000)
struct CapturePerformer_SetMocapMesh final
{
public:
	class USkeletalMesh*                          MocapMesh;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.CapturePerformer.GetLiveLinkSubject
// 0x0004 (0x0004 - 0x0000)
struct CapturePerformer_GetLiveLinkSubject final
{
public:
	struct FLiveLinkSubjectName                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.PerformerComponent.GetEvaluateLiveLinkData
// 0x0001 (0x0001 - 0x0000)
struct PerformerComponent_GetEvaluateLiveLinkData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.PerformerComponent.SetEvaluateLiveLinkData
// 0x0001 (0x0001 - 0x0000)
struct PerformerComponent_SetEvaluateLiveLinkData final
{
public:
	bool                                          bEvaluateLinkLink;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.PerformerComponent.SetLiveLinkSubject
// 0x0004 (0x0004 - 0x0000)
struct PerformerComponent_SetLiveLinkSubject final
{
public:
	struct FLiveLinkSubjectName                   Subject;                                           // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.PerformerComponent.GetLiveLinkSubject
// 0x0004 (0x0004 - 0x0000)
struct PerformerComponent_GetLiveLinkSubject final
{
public:
	struct FLiveLinkSubjectName                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.RetargetComponent.GetCustomRetargetProfile
// 0x0100 (0x0100 - 0x0000)
struct RetargetComponent_GetCustomRetargetProfile final
{
public:
	struct FRetargetProfile                       ReturnValue;                                       // 0x0000(0x0100)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.RetargetComponent.SetControlledMesh
// 0x0008 (0x0008 - 0x0000)
struct RetargetComponent_SetControlledMesh final
{
public:
	class USkeletalMeshComponent*                 InControlledMesh;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.RetargetComponent.SetCustomRetargetProfile
// 0x0100 (0x0100 - 0x0000)
struct RetargetComponent_SetCustomRetargetProfile final
{
public:
	struct FRetargetProfile                       InProfile;                                         // 0x0000(0x0100)(Parm, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.RetargetComponent.SetRetargetAsset
// 0x0008 (0x0008 - 0x0000)
struct RetargetComponent_SetRetargetAsset final
{
public:
	class UIKRetargeter*                          InRetargetAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PerformanceCaptureCore.RetargetComponent.SetSourcePerformerMesh
// 0x0008 (0x0008 - 0x0000)
struct RetargetComponent_SetSourcePerformerMesh final
{
public:
	class USkeletalMeshComponent*                 InPerformerMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

