#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PictureInPictureUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "PictureInPictureDescriptors_structs.hpp"


namespace SDK::Params
{

// Function PictureInPictureUI.PictureInPictureBladeMenuButton.HandlePiPEnabled
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureBladeMenuButton_HandlePiPEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureUI.PictureInPictureBladeMenuButton.UpdatePiPStatusBP
// 0x0003 (0x0003 - 0x0000)
struct PictureInPictureBladeMenuButton_UpdatePiPStatusBP final
{
public:
	bool                                          LoggedIn;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ParentalControlsEnabled;                           // 0x0002(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureUI.PictureInPicturePanelWidget.FlipPIPAudioSubmix
// 0x0078 (0x0078 - 0x0000)
struct PictureInPicturePanelWidget_FlipPIPAudioSubmix final
{
public:
	bool                                          bInDefault;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMediaEventsStreamAssets           InStreamAssets;                                    // 0x0008(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PictureInPictureUI.PictureInPicturePanelWidget.HandleIsPictureInPictureEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct PictureInPicturePanelWidget_HandleIsPictureInPictureEnabledChanged final
{
public:
	bool                                          bIsPiPEnabled;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureUI.PictureInPicturePanelWidget.HandleOnPartnerChanged
// 0x0008 (0x0008 - 0x0000)
struct PictureInPicturePanelWidget_HandleOnPartnerChanged final
{
public:
	class UPictureInPicturePartnerControls*       NewPartnerControls;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureUI.PictureInPicturePanelWidget.HandleOnPartnerSourceChanged
// 0x01F0 (0x01F0 - 0x0000)
struct PictureInPicturePanelWidget_HandleOnPartnerSourceChanged final
{
public:
	struct FPiPPartnerSource                      InSelectedSource;                                  // 0x0000(0x01F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function PictureInPictureUI.PictureInPicturePanelWidget.HandleToggleFullscreenMap
// 0x0001 (0x0001 - 0x0000)
struct PictureInPicturePanelWidget_HandleToggleFullscreenMap final
{
public:
	bool                                          bFullscreenMapVisible;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureUI.PictureInPicturePanelWidget.SetupPIPSoundComponent
// 0x0068 (0x0068 - 0x0000)
struct PictureInPicturePanelWidget_SetupPIPSoundComponent final
{
public:
	struct FFortMediaEventsStreamAssets           InStreamAssets;                                    // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PictureInPictureUI.PictureInPicturePanelWidget.ShowDebugInfo
// 0x0001 (0x0001 - 0x0000)
struct PictureInPicturePanelWidget_ShowDebugInfo final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureUI.PictureInPictureSourcePicker.HandleOnPartnerChanged
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSourcePicker_HandleOnPartnerChanged final
{
public:
	class UPictureInPicturePartnerControls*       NewPartner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PictureInPictureUI.PictureInPictureSourcePicker.HandleOnPartnerSourceChanged
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSourcePicker_HandleOnPartnerSourceChanged final
{
public:
	TArray<struct FPiPPartnerSource>              CurrentSources;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

}

