#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PictureInPictureDescriptors

#include "Basic.hpp"

#include "PictureInPictureDescriptors_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PictureInPictureDescriptors.PictureInPicturePartnerDataAsset
// 0x00C0 (0x00F0 - 0x0030)
class UPictureInPicturePartnerDataAsset final : public UPrimaryDataAsset
{
public:
	class FString                                 PartnerName;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 ClientImage;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MediaHeight;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MediaWidth;                                        // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonActivatableWidget>   MetadataOverlayClass;                              // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPictureInPictureActionConfig>  Actions;                                           // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPIPVideoPlayerAssetConfig             AssetConfig;                                       // 0x0068(0x0088)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPicturePartnerDataAsset">();
	}
	static class UPictureInPicturePartnerDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPicturePartnerDataAsset>();
	}
};

// Class PictureInPictureDescriptors.PictureInPictureActionData
// 0x0138 (0x0160 - 0x0028)
class UPictureInPictureActionData : public UObject
{
public:
	class FString                                 PartnerName;                                       // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ActionBrush;                                       // 0x0040(0x00C0)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ActionText;                                        // 0x0100(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	EPictureInPictureAction                       ActionType;                                        // 0x0110(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ActionEvent;                                       // 0x0118(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TMulticastInlineDelegate<void(bool bSuccess)> InCallback)> ActionFiredEvent; // 0x0128(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_138[0x18];                                     // 0x0138(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bSuccess)> CallbackEvent;                                     // 0x0150(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void CallEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPictureActionData">();
	}
	static class UPictureInPictureActionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureActionData>();
	}
};

// Class PictureInPictureDescriptors.PictureInPictureSourceActionData
// 0x0020 (0x0180 - 0x0160)
class UPictureInPictureSourceActionData final : public UPictureInPictureActionData
{
public:
	class FString                                 SourceName;                                        // 0x0160(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& SourceActionSelected)> SourceActionEvent;     // 0x0170(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPictureSourceActionData">();
	}
	static class UPictureInPictureSourceActionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureSourceActionData>();
	}
};

// Class PictureInPictureDescriptors.PictureInPictureAnalyticsManager
// 0x0050 (0x0078 - 0x0028)
class UPictureInPictureAnalyticsManager final : public UObject
{
public:
	TMap<class FString, struct FPictureInPictureAnalyticsPayload> PartnerAnalytics;                  // 0x0028(0x0050)(Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PictureInPictureAnalyticsManager">();
	}
	static class UPictureInPictureAnalyticsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureAnalyticsManager>();
	}
};

}

