#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimCoreRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PilgrimCoreRuntime_structs.hpp"
#include "SparksDanceEmotesRuntime_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "GameplayEventRouter_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "EpicMediaBasePlayer_structs.hpp"
#include "SparksCosmeticsRuntime_classes.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "Harmonix_structs.hpp"
#include "CommonInput_structs.hpp"
#include "SparksMidiParser_structs.hpp"
#include "SparksMidiParser_classes.hpp"
#include "SparksMusicPlayspaceRuntime_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SparksCMS_structs.hpp"
#include "FMCoreRuntime_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class PilgrimCoreRuntime.NetworkedMusicClockManager
// 0x0268 (0x0308 - 0x00A0)
class UNetworkedMusicClockManager final : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_A0[0x88];                                      // 0x00A0(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnStartSongSyncCountdown;                          // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 BeatNumber, int32 BeatInBar)> OnBeatEvent;                   // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 BarNumber)> OnBarEvent;                                      // 0x0148(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMusicClockComponent*                   OwnedMusicClockComponent;                          // 0x0158(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UAudioComponent>         WeakMetasoundPlayer;                               // 0x0160(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UAudioComponent>         WeakMetasoundMixer;                                // 0x0168(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ServerStartTime;                                   // 0x0170(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSongTimestampData                     CurrentSongServerTimestamp;                        // 0x0178(0x0048)(Net, Transient, RepNotify, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         TimeToStartSyncedClock;                            // 0x01C0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           ClientLatencyCatchupTimerHandle;                   // 0x01E8(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           ServerTimestampRecordingTimerHandle;               // 0x01F0(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         ServerTimestampRecordingFrequency;                 // 0x01F8(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinDeltaForSeek;                                   // 0x0220(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinDeltaForSpeedAdjust;                            // 0x0248(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         EndCorrectionDelta;                                // 0x0270(0x0028)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         SpeedAdjustmentFactor;                             // 0x0298(0x0028)(Edit, NativeAccessSpecifierPrivate)
	float                                         CurrentSpeed;                                      // 0x02C0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MetasoundSpeedParamName;                           // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MetasoundSeekParamName;                            // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MetasoundTriggerName;                              // 0x02CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MetasoundOuputPinName;                             // 0x02D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetasoundGeneratorHandle*              MetasoundPlayerGeneratorHandle;                    // 0x02D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMetasoundParameterPack*                MetasoundPlayerSeekParamPack;                      // 0x02E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPilgrimSongPlayMethod                        PlayMethod;                                        // 0x02E8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventListenerHandle           SongLoadedGameplayEventHandle;                     // 0x02EC(0x001C)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnBar(int32 BarNumber);
	void OnBeat(int32 BeatNumber, int32 BeatInBar);
	void OnRep_CurrentSongServerTimestamp();
	void OnRep_ServerStartTime();
	void PlayServerAuthoritativeSong(class UPilgrimSongMetadata* SongToPlay);
	void SetClientAudioComponentsToUse(class UAudioComponent* InMetasoundPlayer, class UAudioComponent* InMetasoundMixer);

	class UMusicClockComponent* GetOwnedMusicClock() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetworkedMusicClockManager">();
	}
	static class UNetworkedMusicClockManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkedMusicClockManager>();
	}
};

// Class PilgrimCoreRuntime.PilgramGuitarTiltOverdriveTrigger
// 0x0000 (0x0050 - 0x0050)
class UPilgramGuitarTiltOverdriveTrigger final : public UInputTrigger
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgramGuitarTiltOverdriveTrigger">();
	}
	static class UPilgramGuitarTiltOverdriveTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgramGuitarTiltOverdriveTrigger>();
	}
};

// Class PilgrimCoreRuntime.PilgrimAbilityTask_WaitForBars
// 0x0020 (0x0098 - 0x0078)
class UPilgrimAbilityTask_WaitForBars final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnBarHit;                                          // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         BarCount;                                          // 0x0088(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TargetBar;                                         // 0x008C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         EndAfterHits;                                      // 0x0090(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CurrentIteration;                                  // 0x0094(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UPilgrimAbilityTask_WaitForBars* WaitForBars(class UGameplayAbility* OwningAbility, int32 BarsToWaitFor, int32 LoopFor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimAbilityTask_WaitForBars">();
	}
	static class UPilgrimAbilityTask_WaitForBars* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimAbilityTask_WaitForBars>();
	}
};

// Class PilgrimCoreRuntime.PilgrimAbilityTask_WaitForBeats
// 0x0020 (0x0098 - 0x0078)
class UPilgrimAbilityTask_WaitForBeats final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnBeatHit;                                         // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         BeatCount;                                         // 0x0088(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TargetBeat;                                        // 0x008C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         EndAfterHits;                                      // 0x0090(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CurrentIteration;                                  // 0x0094(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UPilgrimAbilityTask_WaitForBeats* WaitForBeats(class UGameplayAbility* OwningAbility, int32 BeatsToWaitFor, int32 LoopFor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimAbilityTask_WaitForBeats">();
	}
	static class UPilgrimAbilityTask_WaitForBeats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimAbilityTask_WaitForBeats>();
	}
};

// Class PilgrimCoreRuntime.PilgrimAbilityTask_WaitForSection
// 0x0028 (0x00A0 - 0x0078)
class UPilgrimAbilityTask_WaitForSection final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnSectionStarted;                                  // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 TargetSectionName;                                 // 0x0088(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bWaitForNextSection;                               // 0x0098(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPilgrimAbilityTask_WaitForSection* WaitForSection(class UGameplayAbility* OwningAbility, bool bShouldWaitForNextSection, const class FString& SectionName);

	void OnSectionEvent(const class FString& SectionName, float SectionStartMs, float SectionLengthMs);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimAbilityTask_WaitForSection">();
	}
	static class UPilgrimAbilityTask_WaitForSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimAbilityTask_WaitForSection>();
	}
};

// Class PilgrimCoreRuntime.PilgrimActorPool
// 0x00B0 (0x00D8 - 0x0028)
class UPilgrimActorPool final : public UObject
{
public:
	struct FPilgrimActorPoolParams                ActorPoolParams;                                   // 0x0028(0x0010)(NoDestructor, NativeAccessSpecifierPrivate)
	TSet<class AActor*>                           AvailableActors;                                   // 0x0038(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TSet<class AActor*>                           InUseActors;                                       // 0x0088(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	void InitPool(const struct FPilgrimActorPoolParams& PilgrimActorPoolParams);
	void ReturnAllWidgets();
	bool TryReturnItem(class AActor* ActorToPutBack);

	int32 GetNumAvailableItems() const;
	int32 GetNumInUseItems() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimActorPool">();
	}
	static class UPilgrimActorPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimActorPool>();
	}
};

// Class PilgrimCoreRuntime.PilgrimAnalytics
// 0x00A8 (0x0148 - 0x00A0)
class UPilgrimAnalytics final : public UPlayspaceComponent
{
public:
	struct FMusicClockCatchUpData                 CurrentCatchUpSession;                             // 0x00A0(0x0018)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x90];                                      // 0x00B8(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimAnalytics">();
	}
	static class UPilgrimAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimAnalytics>();
	}
};

// Class PilgrimCoreRuntime.PilgrimAsyncAction_RequestLeaderboard
// 0x00E8 (0x0118 - 0x0030)
class UPilgrimAsyncAction_RequestLeaderboard final : public UCancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(const struct FPilgrimLeaderboardPage& ResultPage, const struct FPilgrimLeaderboardRequestParams& RequestParams)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Error, const struct FPilgrimLeaderboardRequestParams& RequestParams)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0xC8];                                      // 0x0050(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPilgrimAsyncAction_RequestLeaderboard* PilgrimRequestLeaderboard(class UObject* WorldContextObject, const class FName SongShortName, const class FString& SpotlightGroup, EPilgrimLeaderboardType LeaderboardType, class AFortPlayerController* RequestingPlayer, bool bFriendsOnly, bool bCenteredOnRequestingPlayer, int32 Page, bool bIsSpotlightCompetition, bool bUseCache);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimAsyncAction_RequestLeaderboard">();
	}
	static class UPilgrimAsyncAction_RequestLeaderboard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimAsyncAction_RequestLeaderboard>();
	}
};

// Class PilgrimCoreRuntime.PilgrimAsyncAction_RequestPersonalBest
// 0x0260 (0x0290 - 0x0030)
class UPilgrimAsyncAction_RequestPersonalBest final : public UCancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(const struct FPilgrimPersonalBestResult& PersonalBestResult, const struct FPilgrimPersonalBestParams& RequestParams)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Error, const struct FPilgrimPersonalBestParams& RequestParams)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x240];                                     // 0x0050(0x0240)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPilgrimAsyncAction_RequestPersonalBest* PilgrimRequestPersonalBest(class UObject* WorldContextObject, class AFortPlayerController* RequestingPlayer, const struct FUniqueNetIdRepl& PlayerAccountId, const class FName SongShortName, EPilgrimTrackType InstrumentType, int32 BandSize, int32 SetlistIndex, bool bUseCache);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimAsyncAction_RequestPersonalBest">();
	}
	static class UPilgrimAsyncAction_RequestPersonalBest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimAsyncAction_RequestPersonalBest>();
	}
};

// Class PilgrimCoreRuntime.PilgrimAsyncAction_RequestPlayerFeed
// 0x00D0 (0x0100 - 0x0030)
class UPilgrimAsyncAction_RequestPlayerFeed final : public UCancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(const struct FPilgrimPlayerFeedResult& FeedResult, const struct FPilgrimPlayerFeedParams& RequestParams)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FText Error, const struct FPilgrimPlayerFeedParams& RequestParams)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0xB0];                                      // 0x0050(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPilgrimAsyncAction_RequestPlayerFeed* PilgrimRequestPlayerFeed(class UObject* WorldContextObject, class AFortPlayerController* RequestingPlayer, const struct FGameplayTagQuery& SongQuery, const struct FSongShortNameMatcher& SongShortNameMatcher, const TArray<EPilgrimLeaderboardType>& Leaderboards, const TArray<struct FUniqueNetIdRepl>& FriendIds, EPilgrimPlayerFeedSortType SortType, bool bAllScores, bool bRequirePlayerScore);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimAsyncAction_RequestPlayerFeed">();
	}
	static class UPilgrimAsyncAction_RequestPlayerFeed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimAsyncAction_RequestPlayerFeed>();
	}
};

// Class PilgrimCoreRuntime.PilgrimBeatMarker
// 0x0060 (0x02F0 - 0x0290)
class APilgrimBeatMarker final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class APilgrimNowBar>          ParentNowBarPtr;                                   // 0x0298(0x0020)(BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x38];                                     // 0x02B8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBeatMarkerPassedNowBar();
	void OnPlacedOnTrack();
	void SetupNumLanes(int32 NumLanes);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimBeatMarker">();
	}
	static class APilgrimBeatMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<APilgrimBeatMarker>();
	}
};

// Class PilgrimCoreRuntime.PilgrimTrackItemMgr
// 0x0038 (0x00D8 - 0x00A0)
class UPilgrimTrackItemMgr : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x4];                                       // 0x00A0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class APilgrimTrack>           Track;                                             // 0x00A4(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimActorPool*                      ItemPool;                                          // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UPilgrimGame>            PilgrimGame;                                       // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x18];                                      // 0x00C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimTrackItemMgr">();
	}
	static class UPilgrimTrackItemMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimTrackItemMgr>();
	}
};

// Class PilgrimCoreRuntime.PilgrimBeatMarkerTrackItemMgr
// 0x0018 (0x00F0 - 0x00D8)
class UPilgrimBeatMarkerTrackItemMgr final : public UPilgrimTrackItemMgr
{
public:
	TArray<class APilgrimBeatMarker*>             ActiveBeatMarkers;                                 // 0x00D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimBeatMarkerTrackItemMgr">();
	}
	static class UPilgrimBeatMarkerTrackItemMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimBeatMarkerTrackItemMgr>();
	}
};

// Class PilgrimCoreRuntime.PilgrimBeatValidatedAbility
// 0x0088 (0x0BC8 - 0x0B40)
class UPilgrimBeatValidatedAbility final : public UFortGameplayAbility
{
public:
	struct FScalableFloat                         MaxTimeDelta;                                      // 0x0B40(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinClosenessToBeatMsForBonus;                      // 0x0B68(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinServerClosenessToBeatMsForBonus;                // 0x0B90(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UGameplayAbility>           AbilityToRunForOnBeat;                             // 0x0BB8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UGameplayAbility>           AbilityToRunForOffBeat;                            // 0x0BC0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnBeatAbilityActivated(bool bOnBeat);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimBeatValidatedAbility">();
	}
	static class UPilgrimBeatValidatedAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimBeatValidatedAbility>();
	}
};

// Class PilgrimCoreRuntime.PilgrimClientSettingRecordPartition
// 0x00D8 (0x0100 - 0x0028)
class UPilgrimClientSettingRecordPartition final : public UFortClientSettingRecordPartition
{
public:
	float                                         TrackSpeedMultiplier;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TrackBackgroundOpacity;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseAlternative5LaneTouchLayout;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseGuitarLeftyFlip;                               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseProColorsForAllParts;                          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNonProTrackInputButtonVisibility;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProTrackInputButtonVisibility;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         KeyboardAndMouseGeneralPresetIndex;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KeyboardAndMouseExpertPresetIndex;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ControllerGeneralPresetIndex;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ControllerExpertPresetIndex;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimPresetConfiguration*            PilgrimPresetConfiguration;                        // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SelectedGeneralControllerPreset;                   // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<uint8, int32>                            SelectedControllerPresetIndices;                   // 0x0060(0x0050)(NativeAccessSpecifierPublic)
	TMap<uint8, int32>                            SelectedKeyboardAndMousePresetIndices;             // 0x00B0(0x0050)(NativeAccessSpecifierPublic)

public:
	void SetControllerExpertPresetIndex(int32 NewIndex);
	void SetControllerGeneralPresetIndex(int32 NewIndex);
	void SetIsGuitarLeftyFlip(bool bNewUseGuitarLeftyFlip);
	void SetKeyboardAndMouseExpertPresetIndex(int32 NewIndex);
	void SetKeyboardAndMouseGeneralPresetIndex(int32 NewIndex);
	void SetNonProTrackInputButtonVisibility(bool bNewNonProTrackInputButtonVisibility);
	void SetProTrackInputButtonVisibility(bool bNewProTrackInputButtonVisibility);
	void SetSelectedGeneralControllerPreset(const class FString& NewSelectedGeneralControllerPreset);
	void SetTrackBackgroundOpacity(float NewOpacity);
	void SetTrackSpeedMultiplier(float NewMultiplier);
	void SetUseAlternative5LaneTouchLayout(bool NewUseAlternative5LaneTouchLayout);
	void SetUseProColorsForAllParts(bool bNewUseProColorsForAllParts);

	int32 GetControllerExpertPresetIndex() const;
	int32 GetControllerGeneralPresetIndex() const;
	bool GetIsGuitarLeftyFlip() const;
	int32 GetKeyboardAndMouseExpertPresetIndex() const;
	int32 GetKeyboardAndMouseGeneralPresetIndex() const;
	bool GetNonProTrackInputButtonVisibility() const;
	bool GetProTrackInputButtonVisibility() const;
	class FString GetSelectedGeneralControllerPreset() const;
	float GetTrackBackgroundOpacity() const;
	float GetTrackSpeedMultiplier() const;
	bool GetUseAlternative5LaneTouchLayout() const;
	bool GetUseProColorsForAllParts() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimClientSettingRecordPartition">();
	}
	static class UPilgrimClientSettingRecordPartition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimClientSettingRecordPartition>();
	}
};

// Class PilgrimCoreRuntime.PilgrimCoreBandStateComponent
// 0x0010 (0x00B0 - 0x00A0)
class UPilgrimCoreBandStateComponent : public UPlayspaceComponent
{
public:
	TArray<class FName>                           OwnedSongs;                                        // 0x00A0(0x0010)(Net, ZeroConstructor, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_OwnedSongs();

	class UPilgrimSongMetadata* GetCurrentSong() const;
	class UPilgrimSongMetadata* GetNextSong() const;
	class UPilgrimSongMetadata* GetSongAtIndex(int32 Index_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimCoreBandStateComponent">();
	}
	static class UPilgrimCoreBandStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimCoreBandStateComponent>();
	}
};

// Class PilgrimCoreRuntime.PilgrimCorePlayerStateComponent
// 0x0018 (0x00C0 - 0x00A8)
class UPilgrimCorePlayerStateComponent : public USparksPlayerStateComponent
{
public:
	TMulticastInlineDelegate<void(EPilgrimPeripheralInputMode PlasticInstrumentInputMode)> OnPeripheralInputModeChanged; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EPilgrimSongDifficulty                        SongDifficulty;                                    // 0x00B8(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPilgrimTrackType                             InstrumentChoice;                                  // 0x00B9(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsReady;                                          // 0x00BA(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPregameChoicesLocked;                             // 0x00BB(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPilgrimCorePlayerStateComponent* GetPilgrimCorePlayerStateComponent(const class APlayerState* PlayerState);

	void OnRep_InstrumentChoice(EPilgrimTrackType PrevInstrument);
	void OnRep_IsReady(bool bPrevIsReady);
	void OnRep_SongDifficulty(EPilgrimSongDifficulty PrevDifficulty);
	void ServerSetIsReady(bool bInIsReady);
	void SetInstrumentChoice(EPilgrimTrackType Instrument);
	void SetSongDifficulty(EPilgrimSongDifficulty Difficulty);

	EPilgrimTrackType GetInstrumentChoice() const;
	bool GetIsReady() const;
	EPilgrimSongDifficulty GetSongDifficulty() const;
	EPilgrimTrackType GetTrackTypeForGameplay() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimCorePlayerStateComponent">();
	}
	static class UPilgrimCorePlayerStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimCorePlayerStateComponent>();
	}
};

// Class PilgrimCoreRuntime.PilgrimCore_BPFL
// 0x0000 (0x0028 - 0x0028)
class UPilgrimCore_BPFL final : public UBlueprintFunctionLibrary
{
public:
	static float GetPlatformTimeSeconds();
	static bool InstrumentTypesAreEqual(ESparksInstrumentType SparksType, EPilgrimTrackType PilgrimType);
	static bool IsGuitarPeripheralAllowed(const class UObject* WorldContextObject);
	static EPilgrimTrackType MidiTrackNameToPilgrimTrackType(const class FString& MidiTrackName);
	static class FString PilgrimTrackTypeToMidiTrackName(EPilgrimTrackType PilgrimType);
	static ESparksInstrumentType PilgrimTrackTypeToSparksInstrument(EPilgrimTrackType PilgrimType);
	static bool ShouldUseTouchUIForLocalPlayer(const class UObject* WorldContextObject);
	static EPilgrimTrackType SparksInstrumentToPilgrimTrackType(ESparksInstrumentType SparksType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimCore_BPFL">();
	}
	static class UPilgrimCore_BPFL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimCore_BPFL>();
	}
};

// Class PilgrimCoreRuntime.PilgrimCustomSetlist
// 0x0048 (0x00E8 - 0x00A0)
class UPilgrimCustomSetlist final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UPilgrimCustomSetlist* Setlist, bool bIsLocked)> OnLockedStateChanged; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FPilgrimCustomSetlistEntry>     SetlistEntries;                                    // 0x00D0(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	int32                                         MaxSongsPerPlayer;                                 // 0x00E0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSetlistLocked;                                  // 0x00E4(0x0001)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_MaxSongsPerPlayer(int32 PrevMax);
	void OnRep_SetlistEntries();
	void ServerAddSongForPlayer(class FName SongShortName, class APlayerState* Player);
	void ServerRemoveAllSongs();
	void ServerRemoveAllSongsForPlayer(class APlayerState* Player);
	void ServerRemoveSongAtIndex(int32 Index_0, class FName SongShortName, class APlayerState* Player);
	void ServerRemoveSongForPlayer(class FName SongShortName, class APlayerState* Player, bool bRemoveAll);
	void ServerSetIsSetlistLocked(bool bInIsLocked);
	void ServerSetMaxSongsPerPlayer(int32 NewMax);

	bool CanAddSongForPlayer(class FName SongShortName, class APlayerState* Player, EPilgrimCantAddSongReason* OutReason, class APlayerState** OutAddedByPlayer) const;
	void FindEntriesForPlayer(class APlayerState* Player, TArray<int32>* OutMatchingEntryIndicies) const;
	void FindEntriesForSong(class FName SongShortName, TArray<int32>* OutMatchingEntryIndicies) const;
	void FindEntriesForSongAndPlayer(class FName SongShortName, class APlayerState* Player, TArray<int32>* OutMatchingEntryIndicies) const;
	bool GetIsSetlistLocked() const;
	int32 GetMaxSongsPerPlayer() const;
	void GetSetlistEntryAtIndex(int32 Index_0, class FName* OutSongShortName, class APlayerState** OutAddedByPlayer) const;
	TArray<class FName> GetSongsAddedByPlayer(class APlayerState* Player) const;
	bool HasAnyoneAddedSong(class FName SongShortName, class APlayerState** OutAddedByPlayer) const;
	bool HasPlayerAddedSong(class FName SongShortName, class APlayerState* Player) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimCustomSetlist">();
	}
	static class UPilgrimCustomSetlist* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimCustomSetlist>();
	}
};

// Class PilgrimCoreRuntime.PilgrimDanceSynchronizerComponent
// 0x0038 (0x0130 - 0x00F8)
class UPilgrimDanceSynchronizerComponent final : public USparksDanceSynchronizerComponent
{
public:
	uint8                                         Pad_F8[0x38];                                      // 0x00F8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimDanceSynchronizerComponent">();
	}
	static class UPilgrimDanceSynchronizerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimDanceSynchronizerComponent>();
	}
};

// Class PilgrimCoreRuntime.PilgrimDelayUntilTimeBeforeMidiTick
// 0x0030 (0x0060 - 0x0030)
class UPilgrimDelayUntilTimeBeforeMidiTick final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UObject* PassthroughObject)> OnFinished;                     // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimGame*                           PilgrimGame;                                       // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                Passthrough;                                       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UPilgrimDelayUntilTimeBeforeMidiTick* PilgrimDelayUntilTimeBeforeMidiTick(class UObject* PassthroughObject, class UPilgrimGame* PilgrimGameContext, int32 MidiTick, float SecondsBeforeTick, ECalibratedMusicTimebase Timebase);

	void TimerTick();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimDelayUntilTimeBeforeMidiTick">();
	}
	static class UPilgrimDelayUntilTimeBeforeMidiTick* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimDelayUntilTimeBeforeMidiTick>();
	}
};

// Class PilgrimCoreRuntime.PilgrimGame
// 0x0640 (0x06E0 - 0x00A0)
class UPilgrimGame final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FPilgrimGameProgress& Score)> OnGameScoreUpdated;     // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSongEnded;                                       // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool Enabled)>  OnAutoplayUpdated;                                 // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool Enabled)>  OnDisableMissUpdated;                              // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         CurrentSeekMs;                                     // 0x0100(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpMarkerStart;                                   // 0x0104(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpMarkerEnd;                                     // 0x0108(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimScoringModel*                   ScoringModel;                                      // 0x0110(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPilgrimGameConfig*                     PilgrimGameConfig;                                 // 0x0118(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_120[0x10];                                     // 0x0120(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimPlayerControllerComponent*      OwnerControllerComponent;                          // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        MetasoundPlayer;                                   // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        MetasoundMixer;                                    // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMusicClockComponent*                   MusicClock;                                        // 0x0148(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMetasoundGeneratorHandle*              MetasoundPlayerGeneratorHandle;                    // 0x0150(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMetasoundParameterPack*                MetasoundPlayerSeekParamPack;                      // 0x0158(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPilgrimMediaStreamer*                  PilgrimMediaStreamer;                              // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APilgrimTrack*                          MainTrack;                                         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundBase*                             MissSound;                                         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPilgrimGameEvaluator*                  PilgrimGameEvaluator;                              // 0x0178(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<EPilgrimTrackLane, struct FPilgrimGameInProgressSustain> InProgressSustains;                // 0x0180(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D0[0x438];                                    // 0x01D0(0x0438)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimSongData*                       SongData;                                          // 0x0608(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_610[0x18];                                     // 0x0610(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UPilgrimMidiEventRouter*                MidiEventRouter;                                   // 0x0628(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_630[0xB0];                                     // 0x0630(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTrack(class APilgrimTrack* Track);
	void ApplySettingsFromConfig(const class UPilgrimGameConfig* GameConfig);
	void CheatEndSong();
	void CheatSetJumpMarkers(const class FString& FromTime, const class FString& ToTime);
	void CheatSetPerformanceData(const struct FPilgrimCheatPerformanceArgument& PerformanceArgument);
	void EndGame(bool bFadeOut, float FadeOutDurationSeconds);
	const struct FPilgrimGameConfigSettings GetGameConfigSettings();
	int32 GetNumLanes();
	void OnControlMappingsRebuilt();
	void OnEndedByServer();
	void OnInputMethodChanged(ECommonInputType CurrentInputType);
	void OnMusicReachedEndOfPlayback();
	void OnMusicResumed();
	void PlaySong(class UAudioComponent* InMetasoundPlayer, class UAudioComponent* InMetasoundMixer, class UMusicClockComponent* InMusicClock, class UPilgrimSongMetadata* InSong);
	void PlaySongStreamed(class UAudioComponent* InMetasoundPlayer, class UAudioComponent* InMetasoundMixer, class UMusicClockComponent* InMusicClock, class UPilgrimMediaStreamer* InStreamer);
	void ProcessSwing(EPilgrimTrackLane Lane, bool bIsPress);
	void SeekToTime(int32 Milliseconds);
	void SetDifficultyAndTrackType(EPilgrimSongDifficulty Difficulty, EPilgrimTrackType TrackType);
	void SetJumpMarkers(const int32 FromMillisecnods, const int32 ToMilliseconds);
	void SetLocalPlayer(class APlayerController* OwnerPC);
	void StopSong();

	struct FPilgrimSongMeasurePosition GetCurrentMeasureBeatTick() const;
	float GetCurrentODValue() const;
	float GetCurrentSongMs(ECalibratedMusicTimebase InTimebase) const;
	float GetCurrentSongTick(ECalibratedMusicTimebase InTimebase) const;
	bool GetGemBreakForTrackDifficulty(EPilgrimTrackType Track, EPilgrimSongDifficulty Difficulty, struct FPilgrimGemBreak* FoundBreak, float* BarsLeftInBreak, struct FPilgrimGemBreak* NextBreak, float* BarsTillNextBreak) const;
	float GetHitOffsetAverage() const;
	class FName GetInputNameForLane(EPilgrimTrackLane Lane) const;
	struct FKey GetKeyBoundToLane(EPilgrimTrackLane Lane) const;
	class APlayerController* GetLocalPlayerController() const;
	class APilgrimTrack* GetMainTrack() const;
	class UMusicClockComponent* GetMusicClock() const;
	EPilgrimSongDifficulty GetSelectedDifficulty() const;
	EPilgrimTrackType GetSelectedTrackType() const;
	float GetSongLengthMs() const;
	float GetTotalSecondsSinceGameEnd() const;
	bool IsAutoplayEnabled() const;
	bool IsDisableMissEnabled() const;
	bool IsGameEnded() const;
	bool IsInputSpecificGemShapesEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimGame">();
	}
	static class UPilgrimGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimGame>();
	}
};

// Class PilgrimCoreRuntime.PilgrimGameConfig
// 0x0438 (0x0468 - 0x0030)
class UPilgrimGameConfig final : public UPrimaryDataAsset
{
public:
	struct FPilgrimSongSettings                   SongSettings;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FPilgrimGameConfigSettings             ConfigSettings;                                    // 0x0040(0x0398)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	class USoundBase*                             MissSound;                                         // 0x03D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHp;                                             // 0x03E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamagePerHit;                                      // 0x03E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EFortRarity, float>                      WeaponRarityToNoteDamage;                          // 0x03E8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FPilgrimStreakInfo>             StreakDefinitions;                                 // 0x0438(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAnimBoneCompressionSettings*>   SideloadLipsyncAnim_BoneCompressionSettings;       // 0x0448(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UAnimCurveCompressionSettings*>  SideloadLipsyncAnim_CurveCompressionSettings;      // 0x0458(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimGameConfig">();
	}
	static class UPilgrimGameConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimGameConfig>();
	}
};

// Class PilgrimCoreRuntime.PilgrimInstrumentConfig
// 0x00B8 (0x00E8 - 0x0030)
class UPilgrimInstrumentConfig final : public UPrimaryDataAsset
{
public:
	TArray<struct FPilgrimScoreMultiplierInfo>    ScoreMultiplierDefinitions;                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TOptional<int32>                              SustainScorePerBeat;                               // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EPilgrimSongDifficulty, struct FStarPercentageThresholds> IndividualStarPercentageThresholds; // 0x0048(0x0050)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	TMap<EPilgrimSongDifficulty, float>           BaseGemScoreValue;                                 // 0x0098(0x0050)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimInstrumentConfig">();
	}
	static class UPilgrimInstrumentConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimInstrumentConfig>();
	}
};

// Class PilgrimCoreRuntime.PilgrimGameDeveloperSettings
// 0x0018 (0x0048 - 0x0030)
class UPilgrimGameDeveloperSettings final : public UDeveloperSettings
{
public:
	struct FPilgrimSongSettings                   SongOverrides;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnforceSongEntitlements;                          // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimGameDeveloperSettings">();
	}
	static class UPilgrimGameDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimGameDeveloperSettings>();
	}
};

// Class PilgrimCoreRuntime.PilgrimGameUserSettings
// 0x0008 (0x0030 - 0x0028)
class UPilgrimGameUserSettings final : public UObject
{
public:
	EPilgrimSongDifficulty                        SongDifficulty;                                    // 0x0028(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             SelectedInstrument;                                // 0x0029(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetSelectedInstrument(EPilgrimTrackType NewInstrument);
	void SetSongDifficulty(EPilgrimSongDifficulty NewDifficulty);

	EPilgrimTrackType GetSelectedInstrument() const;
	EPilgrimSongDifficulty GetSongDifficulty() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimGameUserSettings">();
	}
	static class UPilgrimGameUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimGameUserSettings>();
	}
};

// Class PilgrimCoreRuntime.PilgrimGem
// 0x0088 (0x0318 - 0x0290)
class APilgrimGem final : public AActor
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class APilgrimGem* Gem)> OnGemSmashFinished;                       // 0x0298(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APilgrimGem* Gem)> OnGemEnteredSlopWindow;                   // 0x02A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APilgrimGem* Gem)> OnGemExitedSlopWindow;                    // 0x02B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class APilgrimGemSmasher>      ParentSmasherPtr;                                  // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UPilgrimGame>            ParentGamePtr;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APilgrimTrackSustain*                   RelatedSustain;                                    // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x38];                                     // 0x02E0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AllowHitByInput(bool bIsPressInput, EPilgrimTrackLane Lane);
	void FinishGemSmash();
	void OnGemInputUpdated(const struct FKey& BoundKey);
	void OnGemPassed();
	void OnGemSmashed();
	void OnLaneSet(const struct FTrackItemInfo& Gem);
	void UpdateGemInput();

	EPilgrimTrackLane GetLane() const;
	bool IsOverdriveGem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimGem">();
	}
	static class APilgrimGem* GetDefaultObj()
	{
		return GetDefaultObjImpl<APilgrimGem>();
	}
};

// Class PilgrimCoreRuntime.PilgrimGemAnalyzer
// 0x0138 (0x01D8 - 0x00A0)
class UPilgrimGemAnalyzer final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FParsedMidiTextEvent& EventData)> OnGameplayEventStarted; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FPilgrimDifficultyTrackTypePair, struct FPilgrimGemDensityDataArray> SongSectionGemDensityDataMap; // 0x00C0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<struct FPilgrimDifficultyTrackTypePair, struct FPilgrimGemDensityDataArray> GameplaySectionGemDensityDataMap; // 0x0110(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x50];                                     // 0x0160(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinimumEmptyBarsForBreak;                          // 0x01B0(0x0028)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UPilgrimGemAnalyzer* GetPilgrimGemAnalyzer(class UObject* WorldContextObject);
	static const class UPilgrimSongData* GetPilgrimSongData(class UObject* WorldContextObject);

	void GetGemBreaks(EPilgrimTrackType TrackType, EPilgrimSongDifficulty Difficulty, TArray<struct FPilgrimGemBreak>* OutGemBreaks);
	void GetGemDensityDataForAllGameplaySections(EPilgrimSongDifficulty Difficulty, EPilgrimTrackType TrackType, TArray<struct FPilgrimGemDensityData>* OutGemDensityData);
	void GetGemDensityDataForAllSongSections(EPilgrimSongDifficulty Difficulty, EPilgrimTrackType TrackType, TArray<struct FPilgrimGemDensityData>* OutGemDensityData);
	const struct FPilgrimGemDensityData GetGemDensityDataForGameplaySection(EPilgrimSongDifficulty Difficulty, EPilgrimTrackType TrackType, int32 SectionIndexToFind);
	const struct FPilgrimGemDensityData GetGemDensityDataForSongSection(EPilgrimSongDifficulty Difficulty, EPilgrimTrackType TrackType, int32 SectionIndexToFind);

	bool GetGemBreakForTrackDifficultyMs(EPilgrimTrackType Track, EPilgrimSongDifficulty Difficulty, float SongMs, struct FPilgrimGemBreak* FoundBreak, struct FPilgrimGemBreak* NextBreak) const;
	const class UPilgrimSongData* GetSongData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimGemAnalyzer">();
	}
	static class UPilgrimGemAnalyzer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimGemAnalyzer>();
	}
};

// Class PilgrimCoreRuntime.PilgrimGemBreakListener
// 0x0098 (0x00C0 - 0x0028)
class UPilgrimGemBreakListener final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ForActor;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimSongDifficulty                        Difficulty;                                        // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             TrackType;                                         // 0x0041(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
