#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimCoreUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "UMG_classes.hpp"
#include "PilgrimCoreRuntime_classes.hpp"
#include "CommonUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelViewViewModel_classes.hpp"


namespace SDK
{

// Class PilgrimCoreUI.FortSettingRegistryExtension_Pilgrim
// 0x0058 (0x0080 - 0x0028)
class UFortSettingRegistryExtension_Pilgrim final : public UFortGameSettingRegistryExtension
{
public:
	class UPilgrimPresetSelector*                 PilgrimPresetSelectorInstance;                     // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSettingRegistryExtension_Pilgrim">();
	}
	static class UFortSettingRegistryExtension_Pilgrim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSettingRegistryExtension_Pilgrim>();
	}
};

// Class PilgrimCoreUI.PilgrimPlayerInfoWidgetBase
// 0x0000 (0x02B8 - 0x02B8)
class UPilgrimPlayerInfoWidgetBase final : public UUserWidget
{
public:
	void HookUpVoiceIcon(class UFortVoiceChatStatusIcon* Icon, class AFortPlayerStateAthena* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimPlayerInfoWidgetBase">();
	}
	static class UPilgrimPlayerInfoWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPlayerInfoWidgetBase>();
	}
};

// Class PilgrimCoreUI.PilgrimPostGameProgressWidget
// 0x0000 (0x02E0 - 0x02E0)
class UPilgrimPostGameProgressWidget final : public UFortSeasonDataWidget
{
public:
	int32 GetMatchXP() const;
	int32 GetTotalXP() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimPostGameProgressWidget">();
	}
	static class UPilgrimPostGameProgressWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPostGameProgressWidget>();
	}
};

// Class PilgrimCoreUI.PilgrimPresetSelector
// 0x0010 (0x0038 - 0x0028)
class UPilgrimPresetSelector final : public UPilgrimPresetSelectorBase
{
public:
	TWeakObjectPtr<class UPilgrimPresetConfiguration> PilgrimPresetConfiguration;                    // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class APlayerController>       OwningPlayer;                                      // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimPresetSelector">();
	}
	static class UPilgrimPresetSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPresetSelector>();
	}
};

// Class PilgrimCoreUI.PilgrimPresetSwitcher
// 0x0028 (0x0308 - 0x02E0)
class UPilgrimPresetSwitcher final : public UCommonUserWidget
{
public:
	int32                                         NumLanes;                                          // 0x02E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSettingsRotator*                   Rotator_Preset;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_Decrease_Preset;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_Increase_Preset;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x8];                                      // 0x0300(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetSelectedItems(int32* OutSelectedLaneNum, int32* OutSelectedIndex);
	void InitializeForLanes(int32 NewNumLanes, const TArray<class UFortInputMappingContext*>& InputMappingContexts);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimPresetSwitcher">();
	}
	static class UPilgrimPresetSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimPresetSwitcher>();
	}
};

// Class PilgrimCoreUI.PilgrimSongSortVM
// 0x0040 (0x00C0 - 0x0080)
class UPilgrimSongSortVM : public UFortSortItemVM
{
public:
	uint8                                         Pad_80[0x40];                                      // 0x0080(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimSongSortVM">();
	}
	static class UPilgrimSongSortVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongSortVM>();
	}
};

// Class PilgrimCoreUI.PilgrimSongAlphaSortVM
// 0x0030 (0x00F0 - 0x00C0)
class UPilgrimSongAlphaSortVM final : public UPilgrimSongSortVM
{
public:
	uint8                                         Pad_C0[0x30];                                      // 0x00C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimSongAlphaSortVM">();
	}
	static class UPilgrimSongAlphaSortVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongAlphaSortVM>();
	}
};

// Class PilgrimCoreUI.PilgrimSongFilterItemVM
// 0x0060 (0x00E0 - 0x0080)
class UPilgrimSongFilterItemVM : public UFortFilterItemVM
{
public:
	uint8                                         Pad_80[0x60];                                      // 0x0080(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimSongFilterItemVM">();
	}
	static class UPilgrimSongFilterItemVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongFilterItemVM>();
	}
};

// Class PilgrimCoreUI.PilgrimSongFilterOwnedVM
// 0x0000 (0x00E0 - 0x00E0)
class UPilgrimSongFilterOwnedVM final : public UPilgrimSongFilterItemVM
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimSongFilterOwnedVM">();
	}
	static class UPilgrimSongFilterOwnedVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongFilterOwnedVM>();
	}
};

// Class PilgrimCoreUI.PilgrimSongFilterAvailableVM
// 0x0000 (0x00E0 - 0x00E0)
class UPilgrimSongFilterAvailableVM final : public UPilgrimSongFilterItemVM
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimSongFilterAvailableVM">();
	}
	static class UPilgrimSongFilterAvailableVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongFilterAvailableVM>();
	}
};

// Class PilgrimCoreUI.PilgrimSongSearchTextVM
// 0x0048 (0x00C0 - 0x0078)
class UPilgrimSongSearchTextVM final : public UFortSortFilterSearchTextVM
{
public:
	uint8                                         Pad_78[0x48];                                      // 0x0078(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimSongSearchTextVM">();
	}
	static class UPilgrimSongSearchTextVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongSearchTextVM>();
	}
};

// Class PilgrimCoreUI.PilgrimSongFilterVM
// 0x0020 (0x0088 - 0x0068)
class UPilgrimSongFilterVM final : public UMVVMViewModelBase
{
public:
	class UFortSortFilterVM*                      SortFilter;                                        // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UPilgrimSongMetadata*>           FilteredItems;                                     // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class APlayerController*                      OwningController;                                  // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Initialize(class APlayerController* InOwningController, const struct FGameplayTagContainer& InSortTags, const struct FGameplayTagContainer& InFilterTags);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimSongFilterVM">();
	}
	static class UPilgrimSongFilterVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimSongFilterVM>();
	}
};

// Class PilgrimCoreUI.PilgrimCoreUIGlobals
// 0x0000 (0x0028 - 0x0028)
class UPilgrimCoreUIGlobals final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PilgrimCoreUIGlobals">();
	}
	static class UPilgrimCoreUIGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPilgrimCoreUIGlobals>();
	}
};

}

