#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimCoreRuntime

#include "Basic.hpp"

#include "HarmonixMidi_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "SparksCoreRuntime_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Enum PilgrimCoreRuntime.EPilgrimTrackLane
// NumValues: 0x0009
enum class EPilgrimTrackLane : uint8
{
	TrackLaneNone                            = 0,
	TrackLane0                               = 1,
	TrackLane1                               = 2,
	TrackLane2                               = 4,
	TrackLane3                               = 8,
	TrackLane4                               = 16,
	TrackLane5                               = 32,
	NumTrackLanes                            = 6,
	EPilgrimTrackLane_MAX                    = 33,
};

// Enum PilgrimCoreRuntime.EBeatMarkerType
// NumValues: 0x0004
enum class EBeatMarkerType : uint8
{
	None                                     = 0,
	OnBeat                                   = 1,
	OnDownbeat                               = 2,
	EBeatMarkerType_MAX                      = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimTrackType
// NumValues: 0x000B
enum class EPilgrimTrackType : uint8
{
	TrackGuitar                              = 0,
	TrackBass                                = 1,
	TrackVocals                              = 2,
	TrackDrum                                = 3,
	TrackPlasticGuitar                       = 4,
	TrackPlasticBass                         = 5,
	TrackPlasticDrum                         = 6,
	TrackEvents                              = 7,
	TrackNone                                = 8,
	NumTrackTypes                            = 8,
	EPilgrimTrackType_MAX                    = 9,
};

// Enum PilgrimCoreRuntime.EOverdriveScoringState
// NumValues: 0x0004
enum class EOverdriveScoringState : uint8
{
	None                                     = 0,
	FailedSection                            = 1,
	ActiveSection                            = 2,
	EOverdriveScoringState_MAX               = 3,
};

// Enum PilgrimCoreRuntime.EMusicBattleProjectileType
// NumValues: 0x0006
enum class EMusicBattleProjectileType : uint8
{
	None                                     = 0,
	BeamSuccess                              = 1,
	BeamFailure                              = 2,
	BeamClash                                = 3,
	BothMiss                                 = 4,
	EMusicBattleProjectileType_MAX           = 5,
};

// Enum PilgrimCoreRuntime.EPilgrimSongDifficulty
// NumValues: 0x0007
enum class EPilgrimSongDifficulty : uint8
{
	DifficultyEasy                           = 0,
	DifficultyMedium                         = 1,
	DifficultyHard                           = 2,
	DifficultyExpert                         = 3,
	None                                     = 4,
	NumDifficulties                          = 5,
	EPilgrimSongDifficulty_MAX               = 6,
};

// Enum PilgrimCoreRuntime.EPilgrimSongPlayMethod
// NumValues: 0x0004
enum class EPilgrimSongPlayMethod : uint8
{
	Invalid                                  = 0,
	Streaming                                = 1,
	LocalMetasounds                          = 2,
	EPilgrimSongPlayMethod_MAX               = 3,
};

// Enum PilgrimCoreRuntime.EMusicBattleEndReason
// NumValues: 0x0006
enum class EMusicBattleEndReason : uint8
{
	NoReason                                 = 0,
	CompletedNormally                        = 1,
	HardStopAndSkipPostGame                  = 2,
	HardStopAndContinueFlow                  = 3,
	RestartingSong                           = 4,
	EMusicBattleEndReason_MAX                = 5,
};

// Enum PilgrimCoreRuntime.EMusicBattleClientUpdate
// NumValues: 0x0005
enum class EMusicBattleClientUpdate : uint8
{
	SongFinished                             = 0,
	TearDownFinished                         = 1,
	StopAndSkipPostGame                      = 2,
	StopAndRestartSong                       = 3,
	EMusicBattleClientUpdate_MAX             = 4,
};

// Enum PilgrimCoreRuntime.EPilgrimTimedInputType
// NumValues: 0x0007
enum class EPilgrimTimedInputType : uint8
{
	None                                     = 0,
	Lane                                     = 1,
	DeployOverdrive                          = 2,
	Strum                                    = 3,
	Modulate                                 = 4,
	DrainOverdrive                           = 5,
	EPilgrimTimedInputType_MAX               = 6,
};

// Enum PilgrimCoreRuntime.EMusicBattleType
// NumValues: 0x0006
enum class EMusicBattleType : uint8
{
	None                                     = 0,
	SinglePlayerLocalVs                      = 1,
	MultiplayerVs                            = 2,
	SinglePlayerSparks                       = 3,
	TeamQuickplay                            = 4,
	EMusicBattleType_MAX                     = 5,
};

// Enum PilgrimCoreRuntime.EPilgrimLeaderboardType
// NumValues: 0x000C
enum class EPilgrimLeaderboardType : uint8
{
	SoloGuitar                               = 0,
	SoloBass                                 = 1,
	SoloVocals                               = 2,
	SoloDrum                                 = 3,
	BandDuo                                  = 4,
	BandTrio                                 = 5,
	BandQuad                                 = 6,
	SoloPeripheralGuitar                     = 7,
	SoloPeripheralBass                       = 8,
	SoloPeripheralDrum                       = 9,
	Invalid                                  = 10,
	EPilgrimLeaderboardType_MAX              = 11,
};

// Enum PilgrimCoreRuntime.EPilgrimPlayerFeedSortType
// NumValues: 0x0005
enum class EPilgrimPlayerFeedSortType : uint8
{
	NewestScore                              = 0,
	OldestScore                              = 1,
	HighestScore                             = 2,
	LowestScore                              = 3,
	EPilgrimPlayerFeedSortType_MAX           = 4,
};

// Enum PilgrimCoreRuntime.ESongShortNameMatchType
// NumValues: 0x0005
enum class ESongShortNameMatchType : uint8
{
	AlwaysMatch                              = 0,
	MatchAny                                 = 1,
	MatchAll                                 = 2,
	MatchNone                                = 3,
	ESongShortNameMatchType_MAX              = 4,
};

// Enum PilgrimCoreRuntime.EPilgrimPeripheralInputMode
// NumValues: 0x0003
enum class EPilgrimPeripheralInputMode : uint8
{
	None                                     = 0,
	Guitar                                   = 1,
	EPilgrimPeripheralInputMode_MAX          = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimCantAddSongReason
// NumValues: 0x0008
enum class EPilgrimCantAddSongReason : uint8
{
	None                                     = 0,
	SetlistLocked                            = 1,
	SongAlreadyAdded                         = 2,
	PlayerHasAddedMaxSongs                   = 3,
	InvalidSongShortName                     = 4,
	MissingSong                              = 5,
	SongNotAvailable                         = 6,
	EPilgrimCantAddSongReason_MAX            = 7,
};

// Enum PilgrimCoreRuntime.EPilgrimPlayerHistoryScoreParam
// NumValues: 0x0004
enum class EPilgrimPlayerHistoryScoreParam : uint8
{
	AllScores                                = 0,
	HigherScores                             = 1,
	LowerScores                              = 2,
	EPilgrimPlayerHistoryScoreParam_MAX      = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimStreamerStatus
// NumValues: 0x0008
enum class EPilgrimStreamerStatus : uint8
{
	Idle                                     = 0,
	DownloadingMidi                          = 1,
	Preparing                                = 2,
	Opening                                  = 3,
	Ready                                    = 4,
	Streaming                                = 5,
	Errored                                  = 6,
	EPilgrimStreamerStatus_MAX               = 7,
};

// Enum PilgrimCoreRuntime.EPilgrimStateMachineMessage
// NumValues: 0x0006
enum class EPilgrimStateMachineMessage : uint8
{
	None                                     = 0,
	Solo_PlayPreviousSong                    = 1,
	Solo_PlayNextSong                        = 2,
	Solo_LeaveStage                          = 3,
	Multiplayer_LeaveStage                   = 4,
	EPilgrimStateMachineMessage_MAX          = 5,
};

// Enum PilgrimCoreRuntime.EPilgrimAnalyticsSongEndReason
// NumValues: 0x0004
enum class EPilgrimAnalyticsSongEndReason : uint8
{
	SongFinished                             = 0,
	SongRestarted                            = 1,
	PlayerDisconnected                       = 2,
	EPilgrimAnalyticsSongEndReason_MAX       = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimAnalyticsSongAccessScope
// NumValues: 0x0005
enum class EPilgrimAnalyticsSongAccessScope : uint8
{
	None                                     = 0,
	Player                                   = 1,
	Party                                    = 2,
	All                                      = 3,
	EPilgrimAnalyticsSongAccessScope_MAX     = 4,
};

// Enum PilgrimCoreRuntime.EPilgrimAnalyticsResultsReturn
// NumValues: 0x0005
enum class EPilgrimAnalyticsResultsReturn : uint8
{
	None                                     = 0,
	LeaveToLobby                             = 1,
	LeaveStage                               = 2,
	LeaveStage_Timer                         = 3,
	EPilgrimAnalyticsResultsReturn_MAX       = 4,
};

// Enum PilgrimCoreRuntime.EPresetLanesDifficulty
// NumValues: 0x0003
enum class EPresetLanesDifficulty : uint8
{
	General                                  = 4,
	Expert                                   = 5,
	EPresetLanesDifficulty_MAX               = 6,
};

// Enum PilgrimCoreRuntime.EPilgrimInputCategory
// NumValues: 0x0004
enum class EPilgrimInputCategory : uint8
{
	Lane                                     = 0,
	Overdrive                                = 1,
	Strum                                    = 2,
	EPilgrimInputCategory_MAX                = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimGemInputState
// NumValues: 0x0005
enum class EPilgrimGemInputState : uint8
{
	GemHit                                   = 0,
	UserSwingAndMiss                         = 1,
	GemPassed                                = 2,
	NumGemInputStates                        = 3,
	EPilgrimGemInputState_MAX                = 4,
};

// Enum PilgrimCoreRuntime.EPilgrimPersonalBestType
// NumValues: 0x0005
enum class EPilgrimPersonalBestType : uint8
{
	SoloScore                                = 0,
	BandScore                                = 1,
	SpotlightScore                           = 2,
	Invalid                                  = 3,
	EPilgrimPersonalBestType_MAX             = 4,
};

// Enum PilgrimCoreRuntime.EPilgrimAccumulateStarsMessageType
// NumValues: 0x0004
enum class EPilgrimAccumulateStarsMessageType : uint8
{
	BandStars                                = 0,
	SoloStars                                = 1,
	Count                                    = 2,
	EPilgrimAccumulateStarsMessageType_MAX   = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimAccumulateStarTypes
// NumValues: 0x0004
enum class EPilgrimAccumulateStarTypes : uint8
{
	None                                     = 0,
	Regular                                  = 1,
	Golden                                   = 2,
	EPilgrimAccumulateStarTypes_MAX          = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimNoteEventMessageIncrementType
// NumValues: 0x0004
enum class EPilgrimNoteEventMessageIncrementType : uint8
{
	ByTime                                   = 0,
	ByValue                                  = 1,
	Count                                    = 2,
	EPilgrimNoteEventMessageIncrementType_MAX = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimScoreEventMessageType
// NumValues: 0x0004
enum class EPilgrimScoreEventMessageType : uint8
{
	BandScore                                = 0,
	SoloScore                                = 1,
	Count                                    = 2,
	EPilgrimScoreEventMessageType_MAX        = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimScoreEventMessageIncrementType
// NumValues: 0x0005
enum class EPilgrimScoreEventMessageIncrementType : uint8
{
	ByScore                                  = 0,
	ByStars                                  = 1,
	ByValue                                  = 2,
	Count                                    = 3,
	EPilgrimScoreEventMessageIncrementType_MAX = 4,
};

// Enum PilgrimCoreRuntime.EScoringMistakeType
// NumValues: 0x0003
enum class EScoringMistakeType : uint8
{
	Miss                                     = 0,
	Pass                                     = 1,
	EScoringMistakeType_MAX                  = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimScoringMode
// NumValues: 0x0003
enum class EPilgrimScoringMode : uint8
{
	IncludeModifiers                         = 0,
	ExcludeModifiers                         = 1,
	EPilgrimScoringMode_MAX                  = 2,
};

// Enum PilgrimCoreRuntime.EPilgrimScoringTarget
// NumValues: 0x0007
enum class EPilgrimScoringTarget : uint8
{
	None                                     = 0,
	BaseGem                                  = 1,
	StreakMultiplier                         = 2,
	OverdriveMultiplier                      = 3,
	SustainPerBeat                           = 4,
	AccuracyMultiplier                       = 5,
	EPilgrimScoringTarget_MAX                = 6,
};

// Enum PilgrimCoreRuntime.EPilgrimSongSortMethod
// NumValues: 0x0004
enum class EPilgrimSongSortMethod : uint8
{
	Artist                                   = 0,
	Title                                    = 1,
	Year                                     = 2,
	EPilgrimSongSortMethod_MAX               = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimSongSortDirection
// NumValues: 0x0003
enum class EPilgrimSongSortDirection : uint8
{
	Ascending                                = 0,
	Descending                               = 1,
	EPilgrimSongSortDirection_MAX            = 2,
};

// Enum PilgrimCoreRuntime.EWidgetTouchKbmControllerTransitionType
// NumValues: 0x0005
enum class EWidgetTouchKbmControllerTransitionType : uint8
{
	Opacity                                  = 0,
	Collapse                                 = 1,
	DoNothing                                = 2,
	Count                                    = 3,
	EWidgetTouchKbmControllerTransitionType_MAX = 4,
};

// Enum PilgrimCoreRuntime.EGemHitMethod
// NumValues: 0x0003
enum class EGemHitMethod : uint8
{
	Press                                    = 0,
	Release                                  = 1,
	EGemHitMethod_MAX                        = 2,
};

// Enum PilgrimCoreRuntime.EComboType
// NumValues: 0x0004
enum class EComboType : uint8
{
	None                                     = 0,
	Full                                     = 1,
	Perfect                                  = 2,
	EComboType_MAX                           = 3,
};

// Enum PilgrimCoreRuntime.EPilgrimEvaluatorRuleSet
// NumValues: 0x0003
enum class EPilgrimEvaluatorRuleSet : uint8
{
	standard                                 = 0,
	StrummedGuitar                           = 1,
	EPilgrimEvaluatorRuleSet_MAX             = 2,
};

// Enum PilgrimCoreRuntime.EGemReleaseHandlingBehavior
// NumValues: 0x0003
enum class EGemReleaseHandlingBehavior : uint8
{
	DefaultProcessing                        = 0,
	ForceRelease                             = 1,
	EGemReleaseHandlingBehavior_MAX          = 2,
};

// ScriptStruct PilgrimCoreRuntime.MusicClockCatchUpUpdated
// 0x0004 (0x0004 - 0x0000)
struct FMusicClockCatchUpUpdated final
{
public:
	float                                         DeltaTimestamp;                                    // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.TrackItemInfo
// 0x0030 (0x0030 - 0x0000)
struct FTrackItemInfo final
{
public:
	int32                                         StartTick;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndTick;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumScorables;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Ms;                                                // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DurationMs;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DurationTicks;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             Track;                                             // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackLane                             Lane;                                              // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBeatMarkerType                               BeatType;                                          // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TrackItemIndex;                                    // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverdriveGem;                                    // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OverdriveSectionNum;                               // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEndOfOverdriveSection;                           // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowHitOnPress;                                  // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowHitOnRelease;                                // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSustain;                                        // 0x002B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoHopo;                                       // 0x002C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimTimedInput
// 0x0010 (0x0010 - 0x0000)
struct FPilgrimTimedInput final
{
public:
	EPilgrimTimedInputType                        InputType;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPress;                                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExperiencedTick;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackLane                             TrackLane;                                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.SongShortNameMatcher
// 0x0018 (0x0018 - 0x0000)
struct FSongShortNameMatcher final
{
public:
	TArray<class FName>                           SongShortNames;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	ESongShortNameMatchType                       MatchType;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.SongItemDefPrimaryAssetNameMatcher
// 0x0018 (0x0018 - 0x0000)
struct FSongItemDefPrimaryAssetNameMatcher final
{
public:
	TArray<class USparksSongItemDefinition*>      SongItemDefs;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	ESongShortNameMatchType                       MatchType;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimObjectiveFilterBase
// 0x0120 (0x01C0 - 0x00A0)
struct FPilgrimObjectiveFilterBase : public FObjectiveFilter
{
public:
	struct FObjectiveSubjectTags                  SongID;                                            // 0x00A0(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FObjectiveSubjectTags                  InstrumentId;                                      // 0x00E8(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FObjectiveSubjectTags                  BandInstrumentIds;                                 // 0x0130(0x0048)(Edit, NativeAccessSpecifierPublic)
	struct FSongShortNameMatcher                  SongShortName;                                     // 0x0178(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FSongItemDefPrimaryAssetNameMatcher    SongSIDMatcher;                                    // 0x0190(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FInt32Range                            RequiredBandMembers;                               // 0x01A8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimSongDifficulty                        RequiredDifficulty;                                // 0x01B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimObjectiveFilter_AccumulateStars
// 0x0008 (0x01C8 - 0x01C0)
struct FPilgrimObjectiveFilter_AccumulateStars final : public FPilgrimObjectiveFilterBase
{
public:
	EPilgrimAccumulateStarsMessageType            VerbType;                                          // 0x01C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         StarType;                                          // 0x01C1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimLeaderboardScoreData
// 0x0020 (0x0020 - 0x0000)
struct FPilgrimLeaderboardScoreData final
{
public:
	int32                                         Score;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StarsEarned;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Accuracy;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFullCombo;                                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimSongDifficulty                        Difficulty;                                        // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPilgrimTrackType>                     InstrumentsPlayed;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimPlayerSessionHistory
// 0x0038 (0x0038 - 0x0000)
struct FPilgrimPlayerSessionHistory final
{
public:
	class FString                                 SessionId;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              EndTime;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPilgrimLeaderboardScoreData           TrackedStats;                                      // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimPlayerHistoryEvent
// 0x0080 (0x0080 - 0x0000)
struct FPilgrimPlayerHistoryEvent final
{
public:
	class FString                                 GameId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventId;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventWindowId;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TeamID;                                            // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         TeamAccountIds;                                    // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         PointsEarned;                                      // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Rank;                                              // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Score;                                             // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Percentile;                                        // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPilgrimPlayerSessionHistory>   SessionHistory;                                    // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimPlayerHistoryResult
// 0x0130 (0x0130 - 0x0000)
struct FPilgrimPlayerHistoryResult final
{
public:
	struct FUniqueNetIdRepl                       PlayerAccountId;                                   // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPilgrimPlayerHistoryEvent>     Events;                                            // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0xF0];                                      // 0x0040(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimGameProgress
// 0x0078 (0x0078 - 0x0000)
struct FPilgrimGameProgress final
{
public:
	int32                                         NumHits;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumMisses;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumPasses;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasFullCombo;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasPerfectCombo;                                  // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentTick;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NoteStreak;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentScore;                                      // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RawCurrentScore;                                   // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentModifierBonus;                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentStar;                                       // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NextStarProgress;                                  // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StreakScoreMultiplier;                             // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NotesPastLastMultiplier;                           // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NotesToNextMultiplier;                             // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentHealth;                                     // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverdriveActive;                                 // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentOverdrive;                                  // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentOverdriveSectionNum;                        // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentModulation;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BandScoreContribution;                             // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BandModifierBonusContribution;                     // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOverdriveScoringState                        OverdriveScoringState;                             // 0x0054(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxScore;                                          // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RawMaxScore;                                       // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAtMaxStreak;                                    // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentSustainScore;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentChordScore;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverdriveTime;                                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumPerfects;                                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimMusicBattlePlayerState
// 0x00C0 (0x00C0 - 0x0000)
struct FPilgrimMusicBattlePlayerState final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Team;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimTrackType                             TrackType;                                         // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InstrumentTags;                                    // 0x0010(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FPilgrimGameProgress>           ScoreUpdateHistory;                                // 0x0030(0x0010)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	int32                                         LastPlayableIndexProcessed;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastPlayableIndexReceived;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPilgrimGameProgress                   PilgrimGameProgress;                               // 0x0048(0x0078)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimBandState
// 0x002C (0x002C - 0x0000)
struct FPilgrimBandState final
{
public:
	float                                         BandHealth;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BandScore;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BandModifierBonus;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentScoreFromOverdrive;                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalScoreFromOverdrive;                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BandStar;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NextBandStarProgress;                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BandVarietyBonus;                                  // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseBandScore;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BandMultiplier;                                    // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllPlayersHaveMaxStreak;                          // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllPlayersHaveOverdriveReady;                     // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllPlayersHaveOverdriveActive;                    // 0x002A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnyPlayersHaveOverdriveActive;                    // 0x002B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimMusicBattleData
// 0x0048 (0x0048 - 0x0000)
struct FPilgrimMusicBattleData final
{
public:
	TArray<struct FPilgrimMusicBattlePlayerState> MusicBattleStates;                                 // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         LastPlayableIndexProcessed;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastPlayableIndexReceived;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPilgrimBandState                      BandState;                                         // 0x0018(0x002C)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimSinglePlayerBattleHealth
// 0x0008 (0x0008 - 0x0000)
struct FPilgrimSinglePlayerBattleHealth final
{
public:
	float                                         MaxHp;                                             // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentHp;                                         // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimSinglePlayerBattleData
// 0x0010 (0x0010 - 0x0000)
struct FPilgrimSinglePlayerBattleData final
{
public:
	TArray<struct FPilgrimSinglePlayerBattleHealth> PlayerHealths;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimPresetIndices
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FPilgrimPresetIndices final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimGameBandProgressDelta
// 0x0024 (0x0024 - 0x0000)
struct alignas(0x04) FPilgrimGameBandProgressDelta final
{
public:
	uint8                                         Pad_0[0x24];                                       // 0x0000(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.MusicBattleSinglePlayerOptions
// 0x0008 (0x0008 - 0x0000)
struct FMusicBattleSinglePlayerOptions final
{
public:
	bool                                          bOpponentFiresBack;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OpponentGemSuccessRate;                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimGameInProgressSustain
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x04) FPilgrimGameInProgressSustain final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_Midi_Base
// 0x0014 (0x0014 - 0x0000)
struct FPilgrimEvent_Midi_Base
{
public:
	EPilgrimTrackType                             TrackType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AtMidiTick;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndsAtMidiTick;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UPilgrimGame>            PilgrimGameContext;                                // 0x000C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_Midi_StrikeBase
// 0x0004 (0x0018 - 0x0014)
struct FPilgrimEvent_Midi_StrikeBase : public FPilgrimEvent_Midi_Base
{
public:
	bool                                          bIsChord;                                          // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_Midi_StrikeBass
// 0x0000 (0x0018 - 0x0018)
struct FPilgrimEvent_Midi_StrikeBass : public FPilgrimEvent_Midi_StrikeBase
{
};

// ScriptStruct PilgrimCoreRuntime.PilgrimEvent_Midi_StrikeBass_End
// 0x0000 (0x0018 - 0x0018)
struct FPilgrimEvent_Midi_StrikeBass_End final : public FPilgrimEvent_Midi_StrikeBass
{
};

// ScriptStruct PilgrimCoreRuntime.PilgrimSpotlightCompetition
// 0x0070 (0x0070 - 0x0000)
struct FPilgrimSpotlightCompetition final
{
public:
	class FString                                 SpotlightName;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpotlightGroup;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              BeginTime;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              EndTime;                                           // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SongUIDs;                                          // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           SongShortNames;                                    // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Constraints;                                       // 0x0050(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimLeaderboardRequestParams
// 0x0070 (0x0070 - 0x0000)
struct FPilgrimLeaderboardRequestParams final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimLeaderboardType                       LeaderboardType;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       RequestingPlayerAccountId;                         // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFriendsOnly;                                      // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenteredOnRequestingPlayer;                       // 0x0039(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Page;                                              // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ControllerId;                                      // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSpotlightCompetition;                           // 0x0044(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SpotlightGroup;                                    // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCache;                                         // 0x0058(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x17];                                      // 0x0059(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct PilgrimCoreRuntime.PilgrimLeaderboardEntryRpl
// 0x0030 (0x0030 - 0x0000)
struct FPilgrimLeaderboardEntryRpl
{
public:
	int32                                         Rank;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Percentile;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPilgrimLeaderboardScoreData           ScoreData;                                         // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FDateTime                              DateTime;                                          // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimLeaderboardEntry
// 0x0058 (0x0088 - 0x0030)
struct FPilgrimLeaderboardEntry final : public FPilgrimLeaderboardEntryRpl
{
public:
	bool                                          bHasLocalPlayer;                                   // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            PlayerAccountIdToDisplayNameMap;                   // 0x0038(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct PilgrimCoreRuntime.PilgrimLeaderboardPage
// 0x0038 (0x0038 - 0x0000)
struct FPilgrimLeaderboardPage final
{
public:
	class FName                                   SongShortName;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPilgrimLeaderboardType                       LeaderboardType;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Page;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalPages;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPilgrimLeaderboardEntry>       Entries;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
