#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimCoreUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function PilgrimCoreUI.PilgrimPlayerInfoWidgetBase.HookUpVoiceIcon
// 0x0010 (0x0010 - 0x0000)
struct PilgrimPlayerInfoWidgetBase_HookUpVoiceIcon final
{
public:
	class UFortVoiceChatStatusIcon*               Icon;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 Player;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreUI.PilgrimPostGameProgressWidget.GetMatchXP
// 0x0004 (0x0004 - 0x0000)
struct PilgrimPostGameProgressWidget_GetMatchXP final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreUI.PilgrimPostGameProgressWidget.GetTotalXP
// 0x0004 (0x0004 - 0x0000)
struct PilgrimPostGameProgressWidget_GetTotalXP final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreUI.PilgrimPresetSwitcher.GetSelectedItems
// 0x0008 (0x0008 - 0x0000)
struct PilgrimPresetSwitcher_GetSelectedItems final
{
public:
	int32                                         OutSelectedLaneNum;                                // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutSelectedIndex;                                  // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreUI.PilgrimPresetSwitcher.InitializeForLanes
// 0x0018 (0x0018 - 0x0000)
struct PilgrimPresetSwitcher_InitializeForLanes final
{
public:
	int32                                         NewNumLanes;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortInputMappingContext*>       InputMappingContexts;                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function PilgrimCoreUI.PilgrimSongFilterVM.Initialize
// 0x0048 (0x0048 - 0x0000)
struct PilgrimSongFilterVM_Initialize final
{
public:
	class APlayerController*                      InOwningController;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InSortTags;                                        // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InFilterTags;                                      // 0x0028(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

}

