#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PilgrimQuickplayUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function PilgrimQuickplayUI.FestivalPassTrackingWidget.HandleMCPInventoryChanged
// 0x0058 (0x0058 - 0x0000)
struct FestivalPassTrackingWidget_HandleMCPInventoryChanged final
{
public:
	TSet<class FString>                           ItemChangeFlags;                                   // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         ProfileRevision;                                   // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayUI.PilgrimHUDBase.HandlePickerOpenRequest
// 0x000C (0x000C - 0x0000)
struct PilgrimHUDBase_HandlePickerOpenRequest final
{
public:
	EFortPickerMode                               Mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InitialOption;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreFirstAccept;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PilgrimQuickplayUI.PilgrimPostGameQuestList.SetShowQuests
// 0x0003 (0x0003 - 0x0000)
struct PilgrimPostGameQuestList_SetShowQuests final
{
public:
	bool                                          bNewShowCompleted;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewShowUpdated;                                   // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewShowUnchanged;                                 // 0x0002(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayUI.PilgrimQuickplayInfoModal.BP_OnScrollCompleted
// 0x0001 (0x0001 - 0x0000)
struct PilgrimQuickplayInfoModal_BP_OnScrollCompleted final
{
public:
	bool                                          bScrolledDown;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayUI.PilgrimQuickplaySpotlightList.SetMaxSpotlights
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplaySpotlightList_SetMaxSpotlights final
{
public:
	int32                                         NewMaxSpotlights;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayUI.PilgrimQuickplaySpotlightList.SetSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplaySpotlightList_SetSelectedIndex final
{
public:
	int32                                         NewSelectedIndex;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayUI.PilgrimQuickplaySpotlightList.GetSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct PilgrimQuickplaySpotlightList_GetSelectedIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PilgrimQuickplayUI.PilgrimQuestNotificationEntry.InitializeQuestNotification
// 0x0010 (0x0010 - 0x0000)
struct PilgrimQuestNotificationEntry_InitializeQuestNotification final
{
public:
	TScriptInterface<class IQuestInstanceInterface> InQuest;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

