#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_FirstPersonAdditives_AnimBP_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_FirstPersonAdditives_AnimBP_Template.Player_FirstPersonAdditives_AnimBP_Template_C
// 0x00F0 (0x0460 - 0x0370)
class UPlayer_FirstPersonAdditives_AnimBP_Template_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A8(0x00B0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Player_FirstPersonAdditives_AnimBP_Template(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_FirstPersonAdditives_AnimBP_Template_C">();
	}
	static class UPlayer_FirstPersonAdditives_AnimBP_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_FirstPersonAdditives_AnimBP_Template_C>();
	}
};

}

