#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_PropertiesDebug_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_PropertiesDebug_AnimBP.Player_PropertiesDebug_AnimBP_C
// 0x0050 (0x0530 - 0x04E0)
class UPlayer_PropertiesDebug_AnimBP_C final : public UFortPlayerDebugAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04F8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x0518(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Player_PropertiesDebug_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_PropertiesDebug_AnimBP_C">();
	}
	static class UPlayer_PropertiesDebug_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_PropertiesDebug_AnimBP_C>();
	}
};

}

