#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_ProceduralLayering_AnimBP

#include "Basic.hpp"

#include "PoseSearch_structs.hpp"
#include "AnimationLayeringRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BlendStack_structs.hpp"
#include "Player_ProceduralLayering_AnimBP_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_ProceduralLayering_AnimBP.Player_ProceduralLayering_AnimBP_C
// 0x5AA0 (0x71A0 - 0x1700)
class UPlayer_ProceduralLayering_AnimBP_C final : public UFortPlayerProceduralLayeringAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_ProceduralLayering_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x1708(0x0028)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x1730(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1738(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1740(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1748(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x1768(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x1818(0x00B0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x18C8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x1908(0x0048)()
	struct FAnimNode_BoneMask                     AnimGraphNode_BoneMask_2;                          // 0x1950(0x00F8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x1A48(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x1B38(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x1BB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x1BD8(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1C00(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x1C20(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x1CD0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x1D80(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x1E30(0x0020)()
	struct FAnimNode_HandIKRetargeting            AnimGraphNode_HandIKRetargeting_1;                 // 0x1E50(0x0128)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_10;                         // 0x1F78(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_9;                          // 0x2060(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_8;                          // 0x2148(0x00E8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15;            // 0x2230(0x0020)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_7;                          // 0x2250(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_6;                          // 0x2338(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5;                          // 0x2420(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4;                          // 0x2508(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0x25F0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x26D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x2700(0x0028)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0x2728(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x2810(0x00E8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x28F8(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x29E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x2A08(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x2A30(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14;            // 0x2A50(0x0020)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_1;                             // 0x2A70(0x0100)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x2B70(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x2C70(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x2C98(0x0048)()
	struct FAnimNode_BlendStackInput              AnimGraphNode_BlendStackInput;                     // 0x2CE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x2D08(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x2D30(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x2DF8(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x2E20(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_BlendStackResult;                    // 0x2EE8(0x0020)()
	struct FAnimNode_BlendStack                   AnimGraphNode_BlendStack;                          // 0x2F08(0x0120)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x3028(0x0078)()
	struct FAnimNode_PoseSearchHistoryCollector   AnimGraphNode_PoseSearchHistoryCollector;          // 0x30A0(0x02C8)()
	uint8                                         Pad_3368[0x8];                                     // 0x3368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_DeadBlending                 AnimGraphNode_DeadBlending;                        // 0x3370(0x0530)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x38A0(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x3918(0x0078)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x3990(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x3A58(0x0078)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x3AD0(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x3BC0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x3C08(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x3C80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x3CA8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x3CD0(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x3D48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x3D70(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x3D98(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x3DB8(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x3DF8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x3E18(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x3E90(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x3F08(0x0078)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x3F80(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x40A0(0x0120)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x41C0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x4270(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x4320(0x00B0)()
	struct FAnimNode_CopyMotion                   AnimGraphNode_CopyMotion_3;                        // 0x43D0(0x01E0)()
	struct FAnimNode_CopyMotion                   AnimGraphNode_CopyMotion_2;                        // 0x45B0(0x01E0)()
	struct FAnimNode_CopyMotion                   AnimGraphNode_CopyMotion_1;                        // 0x4790(0x01E0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x4970(0x0020)()
	struct FAnimNode_CopyMotion                   AnimGraphNode_CopyMotion;                          // 0x4990(0x01E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x4B70(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x4BB8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x4BD8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13;            // 0x4BF8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12;            // 0x4C18(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11;            // 0x4C38(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10;            // 0x4C58(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x4C78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x4CA0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9;             // 0x4CC8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;             // 0x4CE8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x4D08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x4D30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x4D58(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x4D80(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x4DA0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x4DC8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x4DE8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x4E08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x4E30(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x4E58(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x4E78(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x4E98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x4EC0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x4EE8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x4F30(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x4F58(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x4F78(0x0078)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x4FF0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x50A0(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x50E8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x5108(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x5128(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x5148(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x5170(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x5198(0x0020)()
	struct FAnimNode_CopyBoneAdvanced             AnimGraphNode_CopyBoneAdvanced_2;                  // 0x51B8(0x0128)()
	struct FAnimNode_CopyBoneAdvanced             AnimGraphNode_CopyBoneAdvanced_1;                  // 0x52E0(0x0128)()
	struct FAnimNode_CopyBoneAdvanced             AnimGraphNode_CopyBoneAdvanced;                    // 0x5408(0x0128)()
	struct FAnimNode_HandIKRetargeting            AnimGraphNode_HandIKRetargeting;                   // 0x5530(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x5658(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x5678(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x5728(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x57D8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x58A0(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x5968(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x5988(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x5A00(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x5A28(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x5A48(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x5B70(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x5C98(0x0128)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x5DC0(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x5E80(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x5EF8(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x5F20(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x5FD0(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x5FF8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x6018(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x6090(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x6108(0x0078)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x6180(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x6230(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x62E0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x6390(0x00B0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x6440(0x0038)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x6478(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x64F0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x65B8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x65E0(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x6658(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x6680(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x66C8(0x0028)()
	struct FAnimNode_BoneMask                     AnimGraphNode_BoneMask_1;                          // 0x66F0(0x00F8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x67E8(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x68A8(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x6958(0x0078)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x69D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x69F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x6A20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x6A48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x6A70(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x6A98(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x6B88(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x6C78(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x6CA0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x6CC0(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x6D38(0x0078)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x6DB0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x6E60(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x6F10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x6F38(0x0028)()
	struct FAnimNode_BoneMask                     AnimGraphNode_BoneMask;                            // 0x6F60(0x00F8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x7058(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x7148(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x7170(0x0020)()
	class UCurveVector*                           HipRemapCurve;                                     // 0x7190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsSwinging;                                        // 0x7198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCrouchTransition;                                // 0x7199(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NonAttachedHandSet;                                // 0x719A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AdditiveLayering(const struct FPoseLink& AddLayer_InLocomotionPose, const struct FPoseLink& AddLayer_InItemPose, const struct FPoseLink& AddLayer_InBasePose, const struct FPoseLink& AddLayer_InLayeredLocomotionPose, const struct FPoseLink& InPoseSourcePose, struct FPoseLink* AdditiveLayering_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BasePose(struct FPoseLink* BasePose_0);
	void CopyBoneLayer(const struct FPoseLink& InCopyBoneLayerPose, struct FPoseLink* CopyBoneLayer_0);
	void CopyMotionLayer(const struct FPoseLink& CopyMotion_InBaseLocomotionPose, const struct FPoseLink& CopyMotion_InBasePose, const struct FPoseLink& CopyMotion_InLayeredLocomotionPose, struct FPoseLink* CopyMotionLayer_0);
	void ExecuteUbergraph_Player_ProceduralLayering_AnimBP(int32 EntryPoint);
	void Layering(const struct FPoseLink& Layer_InBaseLocomotionPose, const struct FPoseLink& Layer_InItemPose, struct FPoseLink* Layering_0);
	void OnUpdateBlendStack_PreNativize(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void ProceduralAdditivePose(const struct FPoseLink& InSourceLocomotionPose, const struct FPoseLink& InMotionMatchingPose, const struct FPoseLink& InProceduralLayeredPose, struct FPoseLink* ProceduralAdditivePose_0);
	void ProceduralLayeredPose(const struct FPoseLink& InLocomotionPose, const struct FPoseLink& InPassThroughPose, struct FPoseLink* ProceduralLayeredPose_0);
	void ProceduralLayering(const struct FPoseLink& ProcLayer_InBaseLocomotionPose, const struct FPoseLink& ProcLayer_InLayeredLocomotionPose, const struct FPoseLink& ProcLayer_InBasePose, struct FPoseLink* ProceduralLayering_0);
	void UpdateNoWeaponBasePose_PreNativize(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_ProceduralLayering_AnimBP_C">();
	}
	static class UPlayer_ProceduralLayering_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_ProceduralLayering_AnimBP_C>();
	}
};

}

