#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAIPetRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerAIPetRuntime.PlayerAIPetCheatManager.CustomPlayerPetCheat
// 0x0040 (0x0040 - 0x0000)
struct PlayerAIPetCheatManager_CustomPlayerPetCheat final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param1;                                            // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param2;                                            // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param3;                                            // 0x0030(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayerAIPetRuntime.PlayerAIPetCheatManager.SpawnPlayerPet
// 0x0010 (0x0010 - 0x0000)
struct PlayerAIPetCheatManager_SpawnPlayerPet final
{
public:
	class FString                                 PetToSpawn;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayerAIPetRuntime.PlayerAIPetCheatManager.SpawnPlayerPetForAllPlayers
// 0x0010 (0x0010 - 0x0000)
struct PlayerAIPetCheatManager_SpawnPlayerPetForAllPlayers final
{
public:
	class FString                                 PetToSpawn;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayerAIPetRuntime.FortAIPawnComponent_PlayerAIPet.OnPetSpawned
// 0x0008 (0x0008 - 0x0000)
struct FortAIPawnComponent_PlayerAIPet_OnPetSpawned final
{
public:
	class AFortPlayerPawn*                        Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayerAIPetRuntime.FortAIPawnComponent_PlayerAIPet.SetCurrentPlayer
// 0x0008 (0x0008 - 0x0000)
struct FortAIPawnComponent_PlayerAIPet_SetCurrentPlayer final
{
public:
	class AFortPlayerPawn*                        NewPlayer;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayerAIPetRuntime.FortControllerComponent_PlayerAIPet.AttachPet
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_PlayerAIPet_AttachPet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayerAIPetRuntime.FortControllerComponent_PlayerAIPet.CustomCheat
// 0x0040 (0x0040 - 0x0000)
struct FortControllerComponent_PlayerAIPet_CustomCheat final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param1;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param2;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param3;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayerAIPetRuntime.FortControllerComponent_PlayerAIPet.DespawnPet
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_PlayerAIPet_DespawnPet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayerAIPetRuntime.FortControllerComponent_PlayerAIPet.DetachPet
// 0x0001 (0x0001 - 0x0000)
struct FortControllerComponent_PlayerAIPet_DetachPet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayerAIPetRuntime.FortControllerComponent_PlayerAIPet.SetCurrentPet
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_PlayerAIPet_SetCurrentPet final
{
public:
	class AFortAIPawn*                            NewPet;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PlayerAIPetRuntime.FortControllerComponent_PlayerAIPet.SpawnPet
// 0x0010 (0x0010 - 0x0000)
struct FortControllerComponent_PlayerAIPet_SpawnPet final
{
public:
	class FString                                 PetToSpawn;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

