#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_FirstPersonAdditives_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Player_FirstPersonAdditives_AnimBP_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_FirstPersonAdditives_AnimBP.Player_FirstPersonAdditives_AnimBP_C
// 0x03A0 (0x1770 - 0x13D0)
class UPlayer_FirstPersonAdditives_AnimBP_C final : public UFortFirstPersonAdditivesAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Player_FirstPersonAdditives_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x13D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E4[0x4];                                     // 0x13E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x13E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x13F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x13F8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1440(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1468(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x14B0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x14F8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1568(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1588(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x15D0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x15F0(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x16B8(0x00B0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Player_FirstPersonAdditives_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Player_FirstPersonAdditives_AnimBP_C">();
	}
	static class UPlayer_FirstPersonAdditives_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_FirstPersonAdditives_AnimBP_C>();
	}
};

}

