#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PoseSearch

#include "Basic.hpp"

#include "PoseSearch_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "StructUtils_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PoseSearch.MotionMatchingAnimNodeLibrary
// 0x0000 (0x0028 - 0x0028)
class UMotionMatchingAnimNodeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMotionMatchingAnimNodeReference ConvertToMotionMatchingNode(const struct FAnimNodeReference& Node, EAnimNodeReferenceConversionResult* Result);
	static void ConvertToMotionMatchingNodePure(const struct FAnimNodeReference& Node, struct FMotionMatchingAnimNodeReference* MotionMatchingNode, bool* Result);
	static void GetMotionMatchingSearchResult(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, struct FPoseSearchBlueprintResult* Result, bool* bIsResultValid);
	static void ResetDatabasesToSearch(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, EPoseSearchInterruptMode InterruptMode);
	static void SetDatabasesToSearch(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, const TArray<class UPoseSearchDatabase*>& Databases, EPoseSearchInterruptMode InterruptMode);
	static void SetDatabaseToSearch(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, class UPoseSearchDatabase* Database, EPoseSearchInterruptMode InterruptMode);
	static void SetInterruptMode(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, EPoseSearchInterruptMode InterruptMode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionMatchingAnimNodeLibrary">();
	}
	static class UMotionMatchingAnimNodeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionMatchingAnimNodeLibrary>();
	}
};

// Class PoseSearch.PoseSearchDatabase
// 0x0148 (0x0178 - 0x0030)
class UPoseSearchDatabase final : public UDataAsset
{
public:
	class UPoseSearchSchema*                      Schema;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ContinuingPoseCostBias;                            // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseCostBias;                                      // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoopingCostBias;                                   // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedStruct>               AnimationAssets;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags;                                              // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	EPoseSearchMode                               PoseSearchMode;                                    // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KDTreeQueryNumNeighbors;                           // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KDTreeQueryNumNeighborsWithDuplicates;             // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x104];                                     // 0x0074(0x0104)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchDatabase">();
	}
	static class UPoseSearchDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchDatabase>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel
// 0x0018 (0x0040 - 0x0028)
class UPoseSearchFeatureChannel : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChannelDataOffset;                                 // 0x0038(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ChannelCardinality;                                // 0x003C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel">();
	}
	static class UPoseSearchFeatureChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_FilterCrashingLegs
// 0x0048 (0x0088 - 0x0040)
class UPoseSearchFeatureChannel_FilterCrashingLegs final : public UPoseSearchFeatureChannel
{
public:
	struct FBoneReference                         LeftThigh;                                         // 0x0040(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightThigh;                                        // 0x004C(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         LeftFoot;                                          // 0x0058(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightFoot;                                         // 0x0064(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          LeftThighIdx;                                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          RightThighIdx;                                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          LeftFootIdx;                                       // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          RightFootIdx;                                      // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x007C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AllowedTolerance;                                  // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_FilterCrashingLegs">();
	}
	static class UPoseSearchFeatureChannel_FilterCrashingLegs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_FilterCrashingLegs>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_GroupBase
// 0x0008 (0x0048 - 0x0040)
class UPoseSearchFeatureChannel_GroupBase : public UPoseSearchFeatureChannel
{
public:
	class FName                                   SampleRole;                                        // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_GroupBase">();
	}
	static class UPoseSearchFeatureChannel_GroupBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_GroupBase>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_Group
// 0x0010 (0x0058 - 0x0048)
class UPoseSearchFeatureChannel_Group final : public UPoseSearchFeatureChannel_GroupBase
{
public:
	TArray<class UPoseSearchFeatureChannel*>      SubChannels;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Group">();
	}
	static class UPoseSearchFeatureChannel_Group* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Group>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_Heading
// 0x0038 (0x0078 - 0x0040)
class UPoseSearchFeatureChannel_Heading final : public UPoseSearchFeatureChannel
{
public:
	struct FBoneReference                         bone;                                              // 0x0040(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x0050(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHeadingAxis                                  HeadingAxis;                                       // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x006D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x006E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x006F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentStrippingVector                     ComponentStripping;                                // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FQuat BP_GetWorldRotation(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Heading">();
	}
	static class UPoseSearchFeatureChannel_Heading* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Heading>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_Padding
// 0x0008 (0x0048 - 0x0040)
class UPoseSearchFeatureChannel_Padding final : public UPoseSearchFeatureChannel
{
public:
	int32                                         PaddingSize;                                       // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Padding">();
	}
	static class UPoseSearchFeatureChannel_Padding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Padding>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_PermutationTime
// 0x0000 (0x0040 - 0x0040)
class UPoseSearchFeatureChannel_PermutationTime final : public UPoseSearchFeatureChannel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_PermutationTime">();
	}
	static class UPoseSearchFeatureChannel_PermutationTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_PermutationTime>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_Phase
// 0x0018 (0x0058 - 0x0040)
class UPoseSearchFeatureChannel_Phase final : public UPoseSearchFeatureChannel
{
public:
	struct FBoneReference                         bone;                                              // 0x0040(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0050(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Phase">();
	}
	static class UPoseSearchFeatureChannel_Phase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Phase>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_Pose
// 0x0038 (0x0080 - 0x0048)
class UPoseSearchFeatureChannel_Pose final : public UPoseSearchFeatureChannel_GroupBase
{
public:
	TArray<struct FPoseSearchBone>                SampledBones;                                      // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int8>                                  SchemaBoneIdx;                                     // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCharacterSpaceVelocities;                      // 0x0069(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPoseSearchFeatureChannel*>      SubChannels;                                       // 0x0070(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Pose">();
	}
	static class UPoseSearchFeatureChannel_Pose* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Pose>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_Position
// 0x0038 (0x0078 - 0x0040)
class UPoseSearchFeatureChannel_Position final : public UPoseSearchFeatureChannel
{
public:
	struct FBoneReference                         bone;                                              // 0x0040(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x0050(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x006C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x006D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x006E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentStrippingVector                     ComponentStripping;                                // 0x006F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector BP_GetWorldPosition(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Position">();
	}
	static class UPoseSearchFeatureChannel_Position* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Position>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_SamplingTime
// 0x0008 (0x0048 - 0x0040)
class UPoseSearchFeatureChannel_SamplingTime final : public UPoseSearchFeatureChannel
{
public:
	float                                         Weight;                                            // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToMatch;                                       // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_SamplingTime">();
	}
	static class UPoseSearchFeatureChannel_SamplingTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_SamplingTime>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_TimeToEvent
// 0x0010 (0x0050 - 0x0040)
class UPoseSearchFeatureChannel_TimeToEvent final : public UPoseSearchFeatureChannel
{
public:
	float                                         Weight;                                            // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BP_GetTimeToEvent(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_TimeToEvent">();
	}
	static class UPoseSearchFeatureChannel_TimeToEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_TimeToEvent>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_Trajectory
// 0x0020 (0x0068 - 0x0048)
class UPoseSearchFeatureChannel_Trajectory final : public UPoseSearchFeatureChannel_GroupBase
{
public:
	TArray<struct FPoseSearchTrajectorySample>    Samples;                                           // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UPoseSearchFeatureChannel*>      SubChannels;                                       // 0x0058(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Trajectory">();
	}
	static class UPoseSearchFeatureChannel_Trajectory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Trajectory>();
	}
};

// Class PoseSearch.PoseSearchFeatureChannel_Velocity
// 0x0038 (0x0078 - 0x0040)
class UPoseSearchFeatureChannel_Velocity final : public UPoseSearchFeatureChannel
{
public:
	struct FBoneReference                         bone;                                              // 0x0040(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x0050(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x006C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x006D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x006E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCharacterSpaceVelocities;                      // 0x006F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalize;                                        // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentStrippingVector                     ComponentStripping;                                // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0072(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector BP_GetWorldVelocity(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Velocity">();
	}
	static class UPoseSearchFeatureChannel_Velocity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Velocity>();
	}
};

// Class PoseSearch.PoseSearchHistoryCollectorAnimNodeLibrary
// 0x0000 (0x0028 - 0x0028)
class UPoseSearchHistoryCollectorAnimNodeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FPoseSearchHistoryCollectorAnimNodeReference ConvertToPoseHistoryNode(const struct FAnimNodeReference& Node, EAnimNodeReferenceConversionResult* Result);
	static void ConvertToPoseHistoryNodePure(const struct FAnimNodeReference& Node, struct FPoseSearchHistoryCollectorAnimNodeReference* PoseSearchHistoryCollectorNode, bool* Result);
	static void GetPoseHistoryNodeTrajectory(const struct FPoseSearchHistoryCollectorAnimNodeReference& PoseSearchHistoryCollectorNode, struct FPoseSearchQueryTrajectory* Trajectory);
	static void SetPoseHistoryNodeTrajectory(const struct FPoseSearchHistoryCollectorAnimNodeReference& PoseSearchHistoryCollectorNode, const struct FPoseSearchQueryTrajectory& Trajectory);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchHistoryCollectorAnimNodeLibrary">();
	}
	static class UPoseSearchHistoryCollectorAnimNodeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchHistoryCollectorAnimNodeLibrary>();
	}
};

// Class PoseSearch.PoseSearchMultiSequence
// 0x0010 (0x0040 - 0x0030)
class UPoseSearchMultiSequence final : public UDataAsset
{
public:
	TArray<struct FPoseSearchMultiSequenceItem>   Items;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	class UAnimSequenceBase* GetSequence(const class FName& Role) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchMultiSequence">();
	}
	static class UPoseSearchMultiSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchMultiSequence>();
	}
};

// Class PoseSearch.PoseSearchNormalizationSet
// 0x0010 (0x0040 - 0x0030)
class UPoseSearchNormalizationSet final : public UDataAsset
{
public:
	TArray<class UPoseSearchDatabase*>            Databases;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchNormalizationSet">();
	}
	static class UPoseSearchNormalizationSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchNormalizationSet>();
	}
};

// Class PoseSearch.PoseSearchSchema
// 0x0050 (0x0080 - 0x0030)
class UPoseSearchSchema final : public UDataAsset
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0030(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPoseSearchRoledSkeleton>       Skeletons;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UPoseSearchFeatureChannel*>      Channels;                                          // 0x0050(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UPoseSearchFeatureChannel*>      FinalizedChannels;                                 // 0x0060(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMirrorDataTable*                       MirrorDataTable;                                   // 0x0070(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SchemaCardinality;                                 // 0x0078(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddDataPadding;                                   // 0x007C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInjectAdditionalDebugChannels;                    // 0x007D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchSchema">();
	}
	static class UPoseSearchSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchSchema>();
	}
};

// Class PoseSearch.PoseSearchTrajectoryLibrary
// 0x0000 (0x0028 - 0x0028)
class UPoseSearchTrajectoryLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GetTrajectorySampleAtTime(const struct FPoseSearchQueryTrajectory& InTrajectory, float Time, struct FPoseSearchQueryTrajectorySample* OutTrajectorySample, bool bExtrapolate);
	static void HandleTrajectoryWorldCollisions(const class UObject* WorldContextObject, const class UAnimInstance* AnimInstance, const struct FPoseSearchQueryTrajectory& InTrajectory, bool bApplyGravity, float FloorCollisionsOffset, struct FPoseSearchQueryTrajectory* OutTrajectory, struct FPoseSearchTrajectory_WorldCollisionResults* CollisionResult, ETraceTypeQuery TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore, EDrawDebugTrace DrawDebugType, bool bIgnoreSelf, float MaxObstacleHeight, const struct FLinearColor& TraceColor, const struct FLinearColor& TraceHitColor, float DrawTime);
	static void PoseSearchGenerateTrajectory(const class UAnimInstance* InAnimInstance, const struct FPoseSearchTrajectoryData& InTrajectoryData, float InDeltaTime, struct FPoseSearchQueryTrajectory& InOutTrajectory, float& InOutDesiredControllerYawLastUpdate, struct FPoseSearchQueryTrajectory* OutTrajectory, float InHistorySamplingInterval, int32 InTrajectoryHistoryCount, float InPredictionSamplingInterval, int32 InTrajectoryPredictionCount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchTrajectoryLibrary">();
	}
	static class UPoseSearchTrajectoryLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchTrajectoryLibrary>();
	}
};

// Class PoseSearch.AnimNotifyState_PoseSearchBase
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_PoseSearchBase : public UAnimNotifyState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_PoseSearchBase">();
	}
	static class UAnimNotifyState_PoseSearchBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchBase>();
	}
};

// Class PoseSearch.AnimNotifyState_PoseSearchExcludeFromDatabase
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_PoseSearchExcludeFromDatabase final : public UAnimNotifyState_PoseSearchBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_PoseSearchExcludeFromDatabase">();
	}
	static class UAnimNotifyState_PoseSearchExcludeFromDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchExcludeFromDatabase>();
	}
};

// Class PoseSearch.AnimNotifyState_PoseSearchBlockTransition
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_PoseSearchBlockTransition final : public UAnimNotifyState_PoseSearchBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_PoseSearchBlockTransition">();
	}
	static class UAnimNotifyState_PoseSearchBlockTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchBlockTransition>();
	}
};

// Class PoseSearch.AnimNotifyState_PoseSearchModifyCost
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_PoseSearchModifyCost final : public UAnimNotifyState_PoseSearchBase
{
public:
	float                                         CostAddend;                                        // 0x0030(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_PoseSearchModifyCost">();
	}
	static class UAnimNotifyState_PoseSearchModifyCost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchModifyCost>();
	}
};

// Class PoseSearch.AnimNotifyState_PoseSearchOverrideContinuingPoseCostBias
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_PoseSearchOverrideContinuingPoseCostBias final : public UAnimNotifyState_PoseSearchBase
{
public:
	float                                         CostAddend;                                        // 0x0030(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_PoseSearchOverrideContinuingPoseCostBias">();
	}
	static class UAnimNotifyState_PoseSearchOverrideContinuingPoseCostBias* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchOverrideContinuingPoseCostBias>();
	}
};

// Class PoseSearch.AnimNotifyState_PoseSearchSamplingEvent
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_PoseSearchSamplingEvent : public UAnimNotifyState_PoseSearchBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_PoseSearchSamplingEvent">();
	}
	static class UAnimNotifyState_PoseSearchSamplingEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchSamplingEvent>();
	}
};

// Class PoseSearch.AnimNotifyState_PoseSearchSamplingAttribute
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_PoseSearchSamplingAttribute final : public UAnimNotifyState_PoseSearchSamplingEvent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_PoseSearchSamplingAttribute">();
	}
	static class UAnimNotifyState_PoseSearchSamplingAttribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchSamplingAttribute>();
	}
};

// Class PoseSearch.AnimNotifyState_PoseSearchBranchIn
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_PoseSearchBranchIn final : public UAnimNotifyState_PoseSearchBase
{
public:
	class UPoseSearchDatabase*                    Database;                                          // 0x0030(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_PoseSearchBranchIn">();
	}
	static class UAnimNotifyState_PoseSearchBranchIn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_PoseSearchBranchIn>();
	}
};

// Class PoseSearch.PoseSearchLibrary
// 0x0000 (0x0028 - 0x0028)
class UPoseSearchLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void MotionMatch(class UAnimInstance* AnimInstance, const TArray<class UObject*>& AssetsToSearch, const class FName PoseHistoryName, const struct FPoseSearchContinuingProperties& ContinuingProperties, const struct FPoseSearchFutureProperties& Future, struct FPoseSearchBlueprintResult* Result, const int32 DebugSessionUniqueIdentifier);
