#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RootLayout_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RootLayout_Athena.RootLayout_Athena_C
// 0x0040 (0x0470 - 0x0430)
class URootLayout_Athena_C final : public UFortRootViewportLayout_Athena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UConfirmationWindow_C*                  ConfirmationWindow;                                // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ControllerDisconnectedModal;                       // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bClosingErrorDialog;                               // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   QuitTitle;                                         // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuitMessage;                                       // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void DialogResult_0099D78247C40A9775C753A2024EA419(EFortDialogResult Result, class FName ResultName);
	void ExecuteUbergraph_RootLayout_Athena(int32 EntryPoint);
	bool IsConsole();
	void OnGameWindowCloseButtonClicked();
	void OnModalQueueEmptied_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RootLayout_Athena_C">();
	}
	static class URootLayout_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootLayout_Athena_C>();
	}
};

}

