#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RubberBandPitchShifter

#include "Basic.hpp"

#include "RubberBandPitchShifter_structs.hpp"
#include "HarmonixDsp_classes.hpp"


namespace SDK
{

// Class RubberBandPitchShifter.RubberBandPitchShifterConfig
// 0x00B0 (0x00D8 - 0x0028)
class URubberBandPitchShifterConfig final : public UStretcherAndPitchShifterConfig
{
public:
	bool                                          bAllowPoolGrowthInEditor;                          // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlatformStretcherCounts               DefaultStretcherCounts;                            // 0x002C(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               SwitchStretcherCounts;                             // 0x0044(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               PS4StretcherCounts;                                // 0x005C(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               PS5StretcherCounts;                                // 0x0074(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               XboxOneStretcherCounts;                            // 0x008C(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               XSXStretcherCounts;                                // 0x00A4(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPlatformStretcherCounts               AndroidStretcherCounts;                            // 0x00BC(0x0018)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RubberBandPitchShifterConfig">();
	}
	static class URubberBandPitchShifterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<URubberBandPitchShifterConfig>();
	}
};

}

