#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SideloadedAnimationRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function SideloadedAnimationRuntime.AnimSequenceSideloaded.AddMetaData
// 0x0008 (0x0008 - 0x0000)
struct AnimSequenceSideloaded_AddMetaData final
{
public:
	class UAnimMetaData*                          MetaDataInstance;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SideloadedAnimationRuntime.AnimSequenceSideloaded.SetSkeleton
// 0x0008 (0x0008 - 0x0000)
struct AnimSequenceSideloaded_SetSkeleton final
{
public:
	class USkeleton*                              InSkeleton;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SideloadedAnimationRuntime.AnimSequenceSideloaded.SideloadData
// 0x0018 (0x0018 - 0x0000)
struct AnimSequenceSideloaded_SideloadData final
{
public:
	TArray<uint8>                                 Memory;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SideloadedAnimationRuntime.AnimSequenceSideloaded.GetSideloadUserDataFloat
// 0x0018 (0x0018 - 0x0000)
struct AnimSequenceSideloaded_GetSideloadUserDataFloat final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SideloadedAnimationRuntime.AnimSequenceSideloaded.GetSideloadUserDataString
// 0x0020 (0x0020 - 0x0000)
struct AnimSequenceSideloaded_GetSideloadUserDataString final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SideloadedAnimationRuntime.AnimSequenceSideloaded.LoadDataFromFile
// 0x0028 (0x0028 - 0x0000)
struct AnimSequenceSideloaded_LoadDataFromFile final
{
public:
	class FString                                 Location;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Memory;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

