#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlidingRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SlidingRuntime.FortMovementMode_Sliding.EventCallback_OnPawnLanded
// 0x00F0 (0x00F0 - 0x0000)
struct FortMovementMode_Sliding_EventCallback_OnPawnLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortMovementMode_Sliding.GameplayTagCallback_CancelSlidingKeepCrouchRequested
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_Sliding_GameplayTagCallback_CancelSlidingKeepCrouchRequested final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortMovementMode_Sliding.GameplayTagCallback_CancelSlidingRequested
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_Sliding_GameplayTagCallback_CancelSlidingRequested final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortMovementMode_Sliding.SetCameraBlendIn
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_Sliding_SetCameraBlendIn final
{
public:
	class UCameraModifier*                        SlideCameraModifier;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortMovementMode_Sliding.ToggleLandFX
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_Sliding_ToggleLandFX final
{
public:
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHiddenInGame;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SlidingRuntime.FortMovementMode_Sliding.ToggleLandFXAthena
// 0x0010 (0x0010 - 0x0000)
struct FortMovementMode_Sliding_ToggleLandFXAthena final
{
public:
	class AFortPlayerPawnAthena*                  FortPlayerPawnAthena;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHiddenInGame;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.EventCallback_OnAbilitySystemComponentInitialized
// 0x0010 (0x0010 - 0x0000)
struct FortPawnComponent_SlidingProvider_EventCallback_OnAbilitySystemComponentInitialized final
{
public:
	class UFortAbilitySystemComponent*            AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                        AffectedPawn;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.EventCallback_OnEnteredAircraftComponent_OG_Sliding
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_SlidingProvider_EventCallback_OnEnteredAircraftComponent_OG_Sliding final
{
public:
	class AController*                            PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.EventCallback_OnEnteredAircraftComponent_Sliding
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_SlidingProvider_EventCallback_OnEnteredAircraftComponent_Sliding final
{
public:
	class AController*                            PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.EventCallback_OnMovementModeChanged_OG_Sliding
// 0x0010 (0x0010 - 0x0000)
struct FortPawnComponent_SlidingProvider_EventCallback_OnMovementModeChanged_OG_Sliding final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PrevMovementMode;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.EventCallback_OnMovementModeChanged_Sliding
// 0x0010 (0x0010 - 0x0000)
struct FortPawnComponent_SlidingProvider_EventCallback_OnMovementModeChanged_Sliding final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 PrevMovementMode;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.EventCallback_OnPawnLanded
// 0x00F0 (0x00F0 - 0x0000)
struct FortPawnComponent_SlidingProvider_EventCallback_OnPawnLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.EventCallback_OnPostLandedPhysics
// 0x00F0 (0x00F0 - 0x0000)
struct FortPawnComponent_SlidingProvider_EventCallback_OnPostLandedPhysics final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.EventCallback_OnRepIsSlidingUpdated_OG_Sliding
// 0x0001 (0x0001 - 0x0000)
struct FortPawnComponent_SlidingProvider_EventCallback_OnRepIsSlidingUpdated_OG_Sliding final
{
public:
	bool                                          bIsPawnSliding;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.EventCallback_Server_OnCharacterMovementPreUpdate_OG_Sliding
// 0x0010 (0x0010 - 0x0000)
struct FortPawnComponent_SlidingProvider_EventCallback_Server_OnCharacterMovementPreUpdate_OG_Sliding final
{
public:
	class UCharacterMovementComponent*            CharMoveComp;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.GameplayTagCallback_SlidingCancelRequested
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_SlidingProvider_GameplayTagCallback_SlidingCancelRequested final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SlidingRuntime.FortPawnComponent_SlidingProvider.GameplayTagCallback_SlidingIsAllowed
// 0x0008 (0x0008 - 0x0000)
struct FortPawnComponent_SlidingProvider_GameplayTagCallback_SlidingIsAllowed final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

