#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlidingRuntime

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class SlidingRuntime.FortMovementMode_SlidingRuntimeData
// 0x0058 (0x0090 - 0x0038)
class UFortMovementMode_SlidingRuntimeData final : public UFortMovementMode_BaseExtRuntimeData
{
public:
	uint8                                         Pad_38[0x58];                                      // 0x0038(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_SlidingRuntimeData">();
	}
	static class UFortMovementMode_SlidingRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_SlidingRuntimeData>();
	}
};

// Class SlidingRuntime.FortMovementMode_Sliding
// 0x03D8 (0x04E8 - 0x0110)
class UFortMovementMode_Sliding final : public UFortMovementMode_BaseExtLogic
{
public:
	struct FScalableFloat                         DashPeriod;                                        // 0x0110(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimInstance>              SlidingAnimLayer;                                  // 0x0138(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GCSliding;                                         // 0x0140(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GCCameraShakeSliding;                              // 0x0144(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GCSpeedLines;                                      // 0x0148(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EventSlidingStarted;                               // 0x014C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SlidingBlockOriginalGATag;                         // 0x0150(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortCameraMode>            CameraMode;                                        // 0x0158(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraModifier>            CameraModeModifier;                                // 0x0160(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraShakeBase>           CameraStartShake;                                  // 0x0168(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialParameterCollection*           FNMaterialsCollection;                             // 0x0170(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         RemoveSpeedLinesAt;                                // 0x0178(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FScalableFloat                         AddSpeedLinesAt;                                   // 0x01A0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C8[0x320];                                    // 0x01C8(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EventCallback_OnDoJumpTriggered();
	void EventCallback_OnPawnLanded(const struct FHitResult& Hit);
	void GameplayTagCallback_CancelSlidingKeepCrouchRequested(const struct FGameplayTag& GameplayTag, int32 Amount);
	void GameplayTagCallback_CancelSlidingRequested(const struct FGameplayTag& GameplayTag, int32 Amount);
	void SetCameraBlendIn(class UCameraModifier* SlideCameraModifier);
	void ToggleLandFX(class AFortPlayerPawn* FortPlayerPawn, bool bHiddenInGame);
	void ToggleLandFXAthena(class AFortPlayerPawnAthena* FortPlayerPawnAthena, bool bHiddenInGame);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_Sliding">();
	}
	static class UFortMovementMode_Sliding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_Sliding>();
	}
};

// Class SlidingRuntime.FortMovementMode_SlidingInputHandler
// 0x0070 (0x0118 - 0x00A8)
class UFortMovementMode_SlidingInputHandler final : public UFortPawnComponent
{
public:
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        InstantSlideInputSources;                          // 0x00C8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x40];                                      // 0x00D8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InputCallback_CrouchPressed();
	void InputCallback_CrouchPressedOrRepair();
	void InputCallback_CrouchPressedOrRepairImmediately();
	void InputCallback_CrouchPressedOrRepairWhileBuilding();
	void InputCallback_CrouchPressedOrRepairWhileEditing();
	void InputCallback_CrouchPressedWhileBuilding();
	void InputCallback_CrouchPressedWhileEditing();
	void InputCallback_CrouchReleased();
	void InputCallback_CrouchReleasedOrRepair();
	void InputCallback_CrouchReleasedOrRepairWhileBuilding();
	void InputCallback_CrouchReleasedOrRepairWhileEditing();
	void InputCallback_CrouchReleasedWhileBuilding();
	void InputCallback_CrouchReleasedWhileEditing();
	void InputCallback_GamepadCrouchGyroPressed();
	void InputCallback_GamepadCrouchGyroReleased();
	void InputCallback_TouchCrouchPressed();
	void InputCallback_TouchCrouchReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMovementMode_SlidingInputHandler">();
	}
	static class UFortMovementMode_SlidingInputHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovementMode_SlidingInputHandler>();
	}
};

// Class SlidingRuntime.FortPawnComponent_SlidingProvider
// 0x0128 (0x01D0 - 0x00A8)
class alignas(0x10) UFortPawnComponent_SlidingProvider final : public UFortPawnComponent
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortMovementMode_BaseExtLogic> MovementModeExtension;                         // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayAbility>           SlidingOG_GA;                                      // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayAbility>           SlidingFeedback_GA;                                // 0x00C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            DisableSlideGameplayEffectClass;                   // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0xF8];                                      // 0x00D8(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EventCallback_OnAbilitySystemComponentInitialized(class UFortAbilitySystemComponent* AbilitySystemComponent, class AFortPlayerPawn* AffectedPawn);
	void EventCallback_OnDoJumpTriggered_OG_Sliding();
	void EventCallback_OnEnteredAircraft_OG_Sliding();
	void EventCallback_OnEnteredAircraft_Sliding();
	void EventCallback_OnEnteredAircraftComponent_OG_Sliding(class AController* PlayerController);
	void EventCallback_OnEnteredAircraftComponent_Sliding(class AController* PlayerController);
	void EventCallback_OnMovementModeChanged_OG_Sliding(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void EventCallback_OnMovementModeChanged_Sliding(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void EventCallback_OnPawnLanded(const struct FHitResult& Hit);
	void EventCallback_OnPawnRestart();
	void EventCallback_OnPostLandedPhysics(const struct FHitResult& Hit);
	void EventCallback_OnRepIsSlidingUpdated_OG_Sliding(const bool bIsPawnSliding);
	void EventCallback_Server_OnCharacterMovementPreUpdate_OG_Sliding(class UCharacterMovementComponent* CharMoveComp, float DeltaSeconds);
	void GameplayTagCallback_SlidingCancelRequested(const struct FGameplayTag& GameplayTag, int32 Amount);
	void GameplayTagCallback_SlidingIsAllowed(const struct FGameplayTag& GameplayTag, int32 Amount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPawnComponent_SlidingProvider">();
	}
	static class UFortPawnComponent_SlidingProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPawnComponent_SlidingProvider>();
	}
};

}

