#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "Party_structs.hpp"
#include "Party_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class SocialUMG.DesignerPreviewChatChannel
// 0x0060 (0x0140 - 0x00E0)
class UDesignerPreviewChatChannel final : public USocialChatChannel
{
public:
	uint8                                         Pad_E0[0x60];                                      // 0x00E0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignerPreviewChatChannel">();
	}
	static class UDesignerPreviewChatChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerPreviewChatChannel>();
	}
};

// Class SocialUMG.SocialChatChannelTab
// 0x0010 (0x14F0 - 0x14E0)
class USocialChatChannelTab final : public UCommonButtonLegacy
{
public:
	class USocialChatChannel*                     ChatChannel;                                       // 0x14E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       CommonText_ChannelName;                            // 0x14E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatChannelTab">();
	}
	static class USocialChatChannelTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChannelTab>();
	}
};

// Class SocialUMG.SocialChatContainer
// 0x0058 (0x0310 - 0x02B8)
class USocialChatContainer : public UUserWidget
{
public:
	class USocialChatManager*                     ChatManager;                                       // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USocialChatChannel*>             JoinedChannels;                                    // 0x02C0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	class USocialChatChannel*                     ActiveChannel;                                     // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupLegacy*               TabButtonGroup;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialChatMessageList*                 ChatList_Messages;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialChatEditableText*                ChatEditableText_MessageEntry;                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_SendMessage;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_JoinedChannels;                           // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_Channels;                                // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DynamicHandleMessageTextCommitted(const class FText& MessageText, ETextCommit CommitMethod);
	void FocusEditableText();
	void HandleLeftTabPressed();
	void HandleRightTabPressed();
	void OnChatOpenChanged(bool bShouldBeOpen);
	void SendCurrentMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatContainer">();
	}
	static class USocialChatContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatContainer>();
	}
};

// Class SocialUMG.SocialChatMessageEntry
// 0x0160 (0x0418 - 0x02B8)
class USocialChatMessageEntry : public UUserWidget
{
public:
	uint8                                         Pad_2B8[0x18];                                     // 0x02B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSocialChatMessageEntryStyle           DefaultStyle;                                      // 0x02D0(0x0138)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   RichText_Message;                                  // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                                Button_MessageButton;                              // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMessageSet();

	bool CanInteract() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatMessageEntry">();
	}
	static class USocialChatMessageEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageEntry>();
	}
};

// Class SocialUMG.SocialChatMessageList
// 0x0118 (0x0398 - 0x0280)
class USocialChatMessageList final : public UListViewBase
{
public:
	uint8                                         Pad_280[0xE8];                                     // 0x0280(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsFocusable;                                      // 0x0368(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialChatChannel*                     ActiveChannel;                                     // 0x0370(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_378[0x20];                                     // 0x0378(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatMessageList">();
	}
	static class USocialChatMessageList* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageList>();
	}
};

// Class SocialUMG.SocialGroupListEntry
// 0x0030 (0x1510 - 0x14E0)
class USocialGroupListEntry final : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_14E0[0x8];                                     // 0x14E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USocialActionMenu>          ActionMenuClass;                                   // 0x14E8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialGroupChannel*                    SocialGroup;                                       // 0x14F0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_GroupName;                                    // 0x14F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x1500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1508[0x8];                                     // 0x1508(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UUserWidget* HandleGetMenuContent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialGroupListEntry">();
	}
	static class USocialGroupListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialGroupListEntry>();
	}
};

// Class SocialUMG.SocialGroupTreeView
// 0x0020 (0x0C40 - 0x0C20)
class USocialGroupTreeView final : public UTreeView
{
public:
	TSubclassOf<class USocialGroupListEntry>      GroupEntryWidgetClass;                             // 0x0C18(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialListUserEntryBase>   UserEntryWidgetClass;                              // 0x0C20(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialInteractionMenu>     ActionMenuClass;                                   // 0x0C28(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialInteractionMenu*                 ActionMenu;                                        // 0x0C30(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C38[0x8];                                      // 0x0C38(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialGroupTreeView">();
	}
	static class USocialGroupTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialGroupTreeView>();
	}
};

// Class SocialUMG.SocialInteractionButton
// 0x00B0 (0x1590 - 0x14E0)
class USocialInteractionButton : public UCommonButtonLegacy
{
public:
	struct FLinearColor                           DefaultIndicatorColor;                             // 0x14E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           AlertingIndicatorColor;                            // 0x14F0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1500[0x80];                                    // 0x1500(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_InteractionName;                              // 0x1580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBorder*                                Border_InteractionIndicator;                       // 0x1588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnInteractionSet();

	class FName GetInteractionName() const;
	bool IsPlatformOnlyFriend() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInteractionButton">();
	}
	static class USocialInteractionButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionButton>();
	}
};

// Class SocialUMG.SocialActionMenu
// 0x0040 (0x0438 - 0x03F8)
class USocialActionMenu : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x40];                                     // 0x03F8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleMenuAnchorOpenChanged(bool bIsOpen);
	void OnOpened();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialActionMenu">();
	}
	static class USocialActionMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialActionMenu>();
	}
};

// Class SocialUMG.SocialInteractionMenu
// 0x0068 (0x04A0 - 0x0438)
class USocialInteractionMenu : public USocialActionMenu
{
public:
	uint8                                         Pad_438[0x30];                                     // 0x0438(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_PositiveInteractions;                     // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_NegativeInteractions;                     // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpacer*                                Spacer_InteractionSeparator;                       // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcherLegacy*            Switcher_Confirmation;                             // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_ConfirmationLabel;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_Confirm;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_Decline;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnToggleConfirmation(bool bIsVisible);

	class UWidget* GetFirstEntryToCenter() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInteractionMenu">();
	}
	static class USocialInteractionMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionMenu>();
	}
};

// Class SocialUMG.SocialNameTextBlock
// 0x0020 (0x0880 - 0x0860)
class USocialNameTextBlock : public UCommonRichTextBlock
{
public:
	class USocialUser*                            SocialUser;                                        // 0x0858(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinDesiredSize;                                    // 0x0860(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxDesiredSize;                                    // 0x0864(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowSecondName;                                   // 0x0868(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlatformIconDisplayRule                      PlatformIconDisplayRule;                           // 0x0869(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWrapToNextLine;                                   // 0x086A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_86B[0x1];                                      // 0x086B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 SecondNameColor;                                   // 0x086C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SecondNameFontSize;                                // 0x0870(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_874[0xC];                                      // 0x0874(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialNameTextBlock">();
	}
	static class USocialNameTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialNameTextBlock>();
	}
};

// Class SocialUMG.SocialListEntryBase
// 0x0020 (0x1500 - 0x14E0)
#pragma pack(push, 0x1)
class alignas(0x10) USocialListEntryBase : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_14E0[0x18];                                    // 0x14E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListEntryBase">();
	}
	static class USocialListEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListEntryBase>();
	}
};
#pragma pack(pop)

// Class SocialUMG.SocialListInteractableEntryBase
// 0x0010 (0x1510 - 0x1500)
#pragma pack(push, 0x1)
class alignas(0x10) USocialListInteractableEntryBase : public USocialListEntryBase
{
public:
	TSubclassOf<class USocialActionMenu>          ActionMenuClass;                                   // 0x14F8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x1500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UUserWidget* HandleGetMenuContent();
	void HandleMenuOpenChanged(bool bIsMenuOpen);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListInteractableEntryBase">();
	}
	static class USocialListInteractableEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListInteractableEntryBase>();
	}
};
#pragma pack(pop)

// Class SocialUMG.SocialListUserEntryBase
// 0x0020 (0x1530 - 0x1510)
class USocialListUserEntryBase : public USocialListInteractableEntryBase
{
public:
	uint8                                         Pad_1508[0x8];                                     // 0x1508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialNameTextBlock*                   Text_SocialName;                                   // 0x1510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialNameTextBlock*                   Text_SocialName_Hover;                             // 0x1518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_RichPresence;                                 // 0x1520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_RichPresence_Hover;                           // 0x1528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListUserEntryBase">();
	}
	static class USocialListUserEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListUserEntryBase>();
	}
};

// Class SocialUMG.SocialUserListHeaderEntry
// 0x0010 (0x1510 - 0x1500)
#pragma pack(push, 0x1)
class alignas(0x10) USocialUserListHeaderEntry : public USocialListEntryBase
{
public:
	class UTextBlock*                             Text_ListName;                                     // 0x14F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_NumEntries;                                   // 0x1500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListHeaderEntry">();
	}
	static class USocialUserListHeaderEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListHeaderEntry>();
	}
};
#pragma pack(pop)

// Class SocialUMG.SocialUserListViewBase
// 0x0110 (0x0390 - 0x0280)
class USocialUserListViewBase : public UListViewBase
{
public:
	uint8                                         Pad_280[0x108];                                    // 0x0280(0x0108)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EntrySpacing;                                      // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListViewBase">();
	}
	static class USocialUserListViewBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListViewBase>();
	}
};

// Class SocialUMG.SocialUserListView
// 0x00A0 (0x0430 - 0x0390)
class USocialUserListView : public USocialUserListViewBase
{
public:
	uint8                                         Pad_390[0x48];                                     // 0x0390(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialActionMenu*                      ActiveActionMenu;                                  // 0x03D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class USocialActionMenu>, class USocialActionMenu*> CachedActionMenuPool;       // 0x03E0(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListView">();
	}
	static class USocialUserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListView>();
	}
};

// Class SocialUMG.SocialUserTreeView
// 0x00A0 (0x04D0 - 0x0430)
class USocialUserTreeView : public USocialUserListView
{
public:
	uint8                                         Pad_430[0x70];                                     // 0x0430(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USocialListUserEntryBase>   UserEntryWidgetClass;                              // 0x04A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialListUserEntryBase>   InviteEntryWidgetClass;                            // 0x04A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B0[0x20];                                     // 0x04B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserTreeView">();
	}
	static class USocialUserTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserTreeView>();
	}
};

// Class SocialUMG.SocialChatEditableText
// 0x0630 (0x0790 - 0x0160)
class USocialChatEditableText final : public UWidget
{
public:
	uint8                                         Pad_160[0x20];                                     // 0x0160(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditableTextStyle                     EditableTextStyle;                                 // 0x0180(0x02C0)(Edit, NativeAccessSpecifierPrivate)
	struct FTextBlockStyle                        AutoCompleteStyle;                                 // 0x0440(0x0310)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_750[0x40];                                     // 0x0750(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatEditableText">();
	}
	static class USocialChatEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatEditableText>();
	}
};

}

