#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCoreUI

#include "Basic.hpp"

#include "SparksCoreUI_structs.hpp"


namespace SDK::Params
{

// Function SparksCoreUI.SparksDynamicUIDirector.HandleCursorModeChanging
// 0x0008 (0x0008 - 0x0000)
struct SparksDynamicUIDirector_HandleCursorModeChanging final
{
public:
	bool                                          bCursorModeEnabled;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksQuestScreenContainer.EventRouterToggleQuestList
// 0x0001 (0x0001 - 0x0000)
struct SparksQuestScreenContainer_EventRouterToggleQuestList final
{
public:
	struct FSparksQuestScreenToggleEvent          Payload;                                           // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksQuestScreenContainer.HandleToggleQuestListFromMapVisibility
// 0x0001 (0x0001 - 0x0000)
struct SparksQuestScreenContainer_HandleToggleQuestListFromMapVisibility final
{
public:
	bool                                          bMapVisible;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksQuestScreenContainer.InitEventRouterBindings
// 0x0008 (0x0008 - 0x0000)
struct SparksQuestScreenContainer_InitEventRouterBindings final
{
public:
	class UGameplayEventRouterComponent*          NewEventRouter;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksQuestScreenContainer.SetQuestScreenVisible
// 0x0001 (0x0001 - 0x0000)
struct SparksQuestScreenContainer_SetQuestScreenVisible final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksSocialAvatarIcon.BP_SetSocialUserFromPlayerState
// 0x0008 (0x0008 - 0x0000)
struct SparksSocialAvatarIcon_BP_SetSocialUserFromPlayerState final
{
public:
	const class AFortPlayerState*                 PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreUI.SparksSongItemDetailsVM.OnSongCatalogRetrieved
// 0x0001 (0x0001 - 0x0000)
struct SparksSongItemDetailsVM_OnSongCatalogRetrieved final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

