#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCoreRuntime

#include "Basic.hpp"

#include "SparksCoreRuntime_structs.hpp"


namespace SDK::Params
{

// Function SparksCoreRuntime.SparksCore_BPFL.CosmeticSubtypeToInstrumentType
// 0x0002 (0x0002 - 0x0000)
struct SparksCore_BPFL_CosmeticSubtypeToInstrumentType final
{
public:
	ESparksAccountItemSubtype                     Subtype;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksInstrumentType                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllBassMidiNoteEnums
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllBassMidiNoteEnums final
{
public:
	TArray<EBassMidiNoteEvent>                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllBassMidiNoteIntegers
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllBassMidiNoteIntegers final
{
public:
	TArray<uint8>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllBassMidiTextEnums
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllBassMidiTextEnums final
{
public:
	TArray<EBassMidiTextEvent>                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllBassMidiTextStrings
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllBassMidiTextStrings final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllDrumMidiNoteEnums
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllDrumMidiNoteEnums final
{
public:
	TArray<EDrumMidiNoteEvent>                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllDrumMidiNoteIntegers
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllDrumMidiNoteIntegers final
{
public:
	TArray<uint8>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllDrumMidiTextEnums
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllDrumMidiTextEnums final
{
public:
	TArray<EDrumMidiTextEvent>                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllDrumMidiTextStrings
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllDrumMidiTextStrings final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllGuitarMidiNoteEnums
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllGuitarMidiNoteEnums final
{
public:
	TArray<EGuitarMidiNoteEvent>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllGuitarMidiNoteIntegers
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllGuitarMidiNoteIntegers final
{
public:
	TArray<uint8>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllGuitarMidiTextEnums
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllGuitarMidiTextEnums final
{
public:
	TArray<EGuitarMidiTextEvent>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllGuitarMidiTextStrings
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllGuitarMidiTextStrings final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllInstrumentSwapEventStrings
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllInstrumentSwapEventStrings final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllVocalsMidiNoteEnums
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllVocalsMidiNoteEnums final
{
public:
	TArray<EVocalsMidiNoteEvent>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllVocalsMidiNoteIntegers
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllVocalsMidiNoteIntegers final
{
public:
	TArray<uint8>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllVocalsMidiTextEnums
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllVocalsMidiTextEnums final
{
public:
	TArray<EVocalsMidiTextEvent>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetAllVocalsMidiTextStrings
// 0x0010 (0x0010 - 0x0000)
struct SparksCore_BPFL_GetAllVocalsMidiTextStrings final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetBassMidiNoteEnumFromInteger
// 0x0002 (0x0002 - 0x0000)
struct SparksCore_BPFL_GetBassMidiNoteEnumFromInteger final
{
public:
	uint8                                         MidiNoteEventInt;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBassMidiNoteEvent                            ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetBassMidiNoteEnumsFromIntegers
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetBassMidiNoteEnumsFromIntegers final
{
public:
	TArray<uint8>                                 MidiNoteEventInts;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EBassMidiNoteEvent>                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetBassMidiNoteIntegerFromEnum
// 0x0002 (0x0002 - 0x0000)
struct SparksCore_BPFL_GetBassMidiNoteIntegerFromEnum final
{
public:
	EBassMidiNoteEvent                            MidiNoteEvent;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetBassMidiNoteIntegersFromEnums
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetBassMidiNoteIntegersFromEnums final
{
public:
	TArray<EBassMidiNoteEvent>                    MidiNoteEvents;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetBassMidiTextEnumFromString
// 0x0018 (0x0018 - 0x0000)
struct SparksCore_BPFL_GetBassMidiTextEnumFromString final
{
public:
	class FString                                 MidiTextEventString;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBassMidiTextEvent                            ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetBassMidiTextEnumsFromStrings
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetBassMidiTextEnumsFromStrings final
{
public:
	TArray<class FString>                         MidiTextEventStrings;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EBassMidiTextEvent>                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetBassMidiTextStringFromEnum
// 0x0018 (0x0018 - 0x0000)
struct SparksCore_BPFL_GetBassMidiTextStringFromEnum final
{
public:
	EBassMidiTextEvent                            MidiTextEvent;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetBassMidiTextStringsFromEnums
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetBassMidiTextStringsFromEnums final
{
public:
	TArray<EBassMidiTextEvent>                    MidiTextEvents;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetDrumMidiNoteEnumFromInteger
// 0x0002 (0x0002 - 0x0000)
struct SparksCore_BPFL_GetDrumMidiNoteEnumFromInteger final
{
public:
	uint8                                         MidiNoteEventInt;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDrumMidiNoteEvent                            ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetDrumMidiNoteEnumsFromIntegers
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetDrumMidiNoteEnumsFromIntegers final
{
public:
	TArray<uint8>                                 MidiNoteEventInts;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EDrumMidiNoteEvent>                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetDrumMidiNoteIntegerFromEnum
// 0x0002 (0x0002 - 0x0000)
struct SparksCore_BPFL_GetDrumMidiNoteIntegerFromEnum final
{
public:
	EDrumMidiNoteEvent                            MidiNoteEvent;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetDrumMidiNoteIntegersFromEnums
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetDrumMidiNoteIntegersFromEnums final
{
public:
	TArray<EDrumMidiNoteEvent>                    MidiNoteEvents;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetDrumMidiTextEnumFromString
// 0x0018 (0x0018 - 0x0000)
struct SparksCore_BPFL_GetDrumMidiTextEnumFromString final
{
public:
	class FString                                 MidiTextEventString;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDrumMidiTextEvent                            ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetDrumMidiTextEnumsFromStrings
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetDrumMidiTextEnumsFromStrings final
{
public:
	TArray<class FString>                         MidiTextEventStrings;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EDrumMidiTextEvent>                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetDrumMidiTextStringFromEnum
// 0x0018 (0x0018 - 0x0000)
struct SparksCore_BPFL_GetDrumMidiTextStringFromEnum final
{
public:
	EDrumMidiTextEvent                            MidiTextEvent;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetDrumMidiTextStringsFromEnums
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetDrumMidiTextStringsFromEnums final
{
public:
	TArray<EDrumMidiTextEvent>                    MidiTextEvents;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetGuitarMidiNoteEnumFromInteger
// 0x0002 (0x0002 - 0x0000)
struct SparksCore_BPFL_GetGuitarMidiNoteEnumFromInteger final
{
public:
	uint8                                         MidiNoteEventInt;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGuitarMidiNoteEvent                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetGuitarMidiNoteEnumsFromIntegers
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetGuitarMidiNoteEnumsFromIntegers final
{
public:
	TArray<uint8>                                 MidiNoteEventInts;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EGuitarMidiNoteEvent>                  ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetGuitarMidiNoteIntegerFromEnum
// 0x0002 (0x0002 - 0x0000)
struct SparksCore_BPFL_GetGuitarMidiNoteIntegerFromEnum final
{
public:
	EGuitarMidiNoteEvent                          MidiNoteEvent;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetGuitarMidiNoteIntegersFromEnums
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetGuitarMidiNoteIntegersFromEnums final
{
public:
	TArray<EGuitarMidiNoteEvent>                  MidiNoteEvents;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetGuitarMidiTextEnumFromString
// 0x0018 (0x0018 - 0x0000)
struct SparksCore_BPFL_GetGuitarMidiTextEnumFromString final
{
public:
	class FString                                 MidiTextEventString;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGuitarMidiTextEvent                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetGuitarMidiTextEnumsFromStrings
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetGuitarMidiTextEnumsFromStrings final
{
public:
	TArray<class FString>                         MidiTextEventStrings;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EGuitarMidiTextEvent>                  ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetGuitarMidiTextStringFromEnum
// 0x0018 (0x0018 - 0x0000)
struct SparksCore_BPFL_GetGuitarMidiTextStringFromEnum final
{
public:
	EGuitarMidiTextEvent                          MidiTextEvent;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetGuitarMidiTextStringsFromEnums
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetGuitarMidiTextStringsFromEnums final
{
public:
	TArray<EGuitarMidiTextEvent>                  MidiTextEvents;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetInstrumentSwapStringFromType
// 0x0018 (0x0018 - 0x0000)
struct SparksCore_BPFL_GetInstrumentSwapStringFromType final
{
public:
	ESparksInstrumentType                         InstrumentType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetInstrumentTypeFromSwapString
// 0x0018 (0x0018 - 0x0000)
struct SparksCore_BPFL_GetInstrumentTypeFromSwapString final
{
public:
	class FString                                 InstrumentSwapString;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksInstrumentType                         ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetVocalsMidiNoteEnumFromInteger
// 0x0002 (0x0002 - 0x0000)
struct SparksCore_BPFL_GetVocalsMidiNoteEnumFromInteger final
{
public:
	uint8                                         MidiNoteEventInt;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVocalsMidiNoteEvent                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetVocalsMidiNoteEnumsFromIntegers
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetVocalsMidiNoteEnumsFromIntegers final
{
public:
	TArray<uint8>                                 MidiNoteEventInts;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EVocalsMidiNoteEvent>                  ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetVocalsMidiNoteIntegerFromEnum
// 0x0002 (0x0002 - 0x0000)
struct SparksCore_BPFL_GetVocalsMidiNoteIntegerFromEnum final
{
public:
	EVocalsMidiNoteEvent                          MidiNoteEvent;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetVocalsMidiNoteIntegersFromEnums
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetVocalsMidiNoteIntegersFromEnums final
{
public:
	TArray<EVocalsMidiNoteEvent>                  MidiNoteEvents;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetVocalsMidiTextEnumFromString
// 0x0018 (0x0018 - 0x0000)
struct SparksCore_BPFL_GetVocalsMidiTextEnumFromString final
{
public:
	class FString                                 MidiTextEventString;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVocalsMidiTextEvent                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetVocalsMidiTextEnumsFromStrings
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetVocalsMidiTextEnumsFromStrings final
{
public:
	TArray<class FString>                         MidiTextEventStrings;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EVocalsMidiTextEvent>                  ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetVocalsMidiTextStringFromEnum
// 0x0018 (0x0018 - 0x0000)
struct SparksCore_BPFL_GetVocalsMidiTextStringFromEnum final
{
public:
	EVocalsMidiTextEvent                          MidiTextEvent;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.GetVocalsMidiTextStringsFromEnums
// 0x0020 (0x0020 - 0x0000)
struct SparksCore_BPFL_GetVocalsMidiTextStringsFromEnums final
{
public:
	TArray<EVocalsMidiTextEvent>                  MidiTextEvents;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksCore_BPFL.InstrumentTypeToCosmeticSubtype
// 0x0002 (0x0002 - 0x0000)
struct SparksCore_BPFL_InstrumentTypeToCosmeticSubtype final
{
public:
	ESparksInstrumentType                         Instrument;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksAccountItemSubtype                     ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_CowbellHit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_CowbellHit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_Crash1_Choke
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_Crash1_Choke final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_Crash1_HardHit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_Crash1_HardHit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_Crash1_SoftHit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_Crash1_SoftHit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_Crash2_Choke
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_Crash2_Choke final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_Crash2_HardHit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_Crash2_HardHit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_Crash2_SoftHit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_Crash2_SoftHit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_FloorTomHit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_FloorTomHit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_HiHatHit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_HiHatHit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_HiHatPedalUp
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_HiHatPedalUp final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_KickHit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_KickHit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_RideHardHit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_RideHardHit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_SnareHit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_SnareHit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_Tom1_Hit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_Tom1_Hit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCoreRuntime.SparksDrumEventsInterface.Bind_Tom2_Hit
// 0x000C (0x000C - 0x0000)
struct SparksDrumEventsInterface_Bind_Tom2_Hit final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

