#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCosmeticsRuntime

#include "Basic.hpp"

#include "SparksCoreRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SparksCosmeticsRuntime.SparksVariantChoice
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FSparksVariantChoice final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SparksCosmeticsRuntime.SparksVariantChoices
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FSparksVariantChoices final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SparksCosmeticsRuntime.NameList
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FNameList final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct SparksCosmeticsRuntime.SparksCosmeticLoadoutData
// 0x00F0 (0x00F0 - 0x0000)
struct FSparksCosmeticLoadoutData final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSparksVariantChoices                  AuraChoices;                                       // 0x0040(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<ESparksInstrumentType, struct FSparksVariantChoices> InstrumentVariantChoices;              // 0x0090(0x0050)(Transient, NativeAccessSpecifierPublic)
	TArray<class USparksSongItemDefinition*>      JamSongChoices;                                    // 0x00E0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct SparksCosmeticsRuntime.SparksCosmeticsEvent_AuraEnable
// 0x000C (0x000C - 0x0000)
struct FSparksCosmeticsEvent_AuraEnable final
{
public:
	TWeakObjectPtr<class AFortPlayerPawn>         ForPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAuraIsEnabled;                                    // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

