#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCMS

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SparksCMS_structs.hpp"


namespace SDK::Params
{

// Function SparksCMS.CatalogData.IsFromHotfix
// 0x0001 (0x0001 - 0x0000)
struct CatalogData_IsFromHotfix final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCMS.CatalogData.GetTagForAgeRating
// 0x0004 (0x0004 - 0x0000)
struct CatalogData_GetTagForAgeRating final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCMS.CatalogData.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct CatalogData_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCMS.CatalogData.IsEnabledForJam
// 0x0001 (0x0001 - 0x0000)
struct CatalogData_IsEnabledForJam final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCMS.CatalogData.IsEnabledForPilgrim
// 0x0001 (0x0001 - 0x0000)
struct CatalogData_IsEnabledForPilgrim final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCMS.SparksSongCatalog.GetSongByShortName
// 0x0018 (0x0018 - 0x0000)
struct SparksSongCatalog_GetSongByShortName final
{
public:
	class FString                                 InShortName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCatalogData*                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCMS.SparksSongCatalog.GetSongByTemplateID
// 0x0018 (0x0018 - 0x0000)
struct SparksSongCatalog_GetSongByTemplateID final
{
public:
	class FString                                 InTemplateId;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCatalogData*                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCMS.SparksSongCatalog.GetSongByUID
// 0x0018 (0x0018 - 0x0000)
struct SparksSongCatalog_GetSongByUID final
{
public:
	class FString                                 InUID;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCatalogData*                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCMS.SparksSongCatalog.GetSongList
// 0x0060 (0x0060 - 0x0000)
struct SparksSongCatalog_GetSongList final
{
public:
	ESongSortMethod                               SortMethod;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESongSortDirection                            SortDirection;                                     // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0008(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UCatalogData*>                   OutResults;                                        // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function SparksCMS.SparksSongCatalog.OnCalendarActiveEventsChanged
// 0x0010 (0x0010 - 0x0000)
struct SparksSongCatalog_OnCalendarActiveEventsChanged final
{
public:
	TArray<class FString>                         ActiveEventFlags;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function SparksCMS.SparksSongCatalog.SetCMSSuffix
// 0x0010 (0x0010 - 0x0000)
struct SparksSongCatalog_SetCMSSuffix final
{
public:
	class FString                                 InCMSSuffix;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

