#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCosmeticsRuntime

#include "Basic.hpp"

#include "SparksCoreRuntime_structs.hpp"
#include "FMJamCoreRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SparksCosmeticsRuntime_structs.hpp"


namespace SDK::Params
{

// Function SparksCosmeticsRuntime.FortAnimNotifyState_SpawnSparksProp.InitNewNotify
// 0x0060 (0x0060 - 0x0000)
struct FortAnimNotifyState_SpawnSparksProp_InitNewNotify final
{
public:
	ESparksInstrumentType                         InType;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InLeftHand;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InAuxMesh;                                         // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InSocketName;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      InSkipActorsWithTag;                               // 0x0008(0x0048)(Parm, NativeAccessSpecifierPublic)
	int32                                         InPropId;                                          // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          InDefaultMesh;                                     // 0x0058(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksAccountItemDefinition.GetInstrumentType
// 0x0001 (0x0001 - 0x0000)
struct SparksAccountItemDefinition_GetInstrumentType final
{
public:
	ESparksInstrumentType                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksAccountItemDefinition.GetItemSubtype
// 0x0001 (0x0001 - 0x0000)
struct SparksAccountItemDefinition_GetItemSubtype final
{
public:
	ESparksAccountItemSubtype                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksAccountItemDefinition.GetVariantChannelOptionNames
// 0x0028 (0x0028 - 0x0000)
struct SparksAccountItemDefinition_GetVariantChannelOptionNames final
{
public:
	struct FGameplayTag                           ChannelTag;                                        // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutChannelName;                                    // 0x0008(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutNames;                                          // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksAccountItemDefinition.GetVariantChannelTags
// 0x0010 (0x0010 - 0x0000)
struct SparksAccountItemDefinition_GetVariantChannelTags final
{
public:
	TArray<struct FGameplayTag>                   OutChannelTags;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticCatalog.GetSparksCosmeticCatalog
// 0x0010 (0x0010 - 0x0000)
struct SparksCosmeticCatalog_GetSparksCosmeticCatalog final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USparksCosmeticCatalog*                 ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticCatalog.GetItemDefFromAssetID
// 0x0010 (0x0010 - 0x0000)
struct SparksCosmeticCatalog_GetItemDefFromAssetID final
{
public:
	struct FPrimaryAssetId                        AssetId;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USparksAccountItemDefinition*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticCatalog.GetActiveItemDefNamesForSubtype
// 0x0018 (0x0018 - 0x0000)
struct SparksCosmeticCatalog_GetActiveItemDefNamesForSubtype final
{
public:
	ESparksAccountItemSubtype                     Subtype;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticCatalog.GetActiveItemDefNamesForSubtypeAndInstrument
// 0x0018 (0x0018 - 0x0000)
struct SparksCosmeticCatalog_GetActiveItemDefNamesForSubtypeAndInstrument final
{
public:
	ESparksAccountItemSubtype                     Subtype;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksInstrumentType                         Instrument;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticCatalog.GetItemDef
// 0x0010 (0x0010 - 0x0000)
struct SparksCosmeticCatalog_GetItemDef final
{
public:
	class FName                                   InItemName;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USparksAccountItemDefinition*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.Debug_BP_ShowCosmeticPicker
// 0x0001 (0x0001 - 0x0000)
struct SparksCosmeticComponent_Debug_BP_ShowCosmeticPicker final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.DebugForceAuraState
// 0x0001 (0x0001 - 0x0000)
struct SparksCosmeticComponent_DebugForceAuraState final
{
public:
	bool                                          bShouldBeActive;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetCosmeticItems
// 0x0010 (0x0010 - 0x0000)
struct SparksCosmeticComponent_GetCosmeticItems final
{
public:
	TArray<class USparksAccountItemDefinition*>   ItemDefs;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetEquippedJamSongShortnameForIndex
// 0x0008 (0x0008 - 0x0000)
struct SparksCosmeticComponent_GetEquippedJamSongShortnameForIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetEquippedJamSongUIDForIndex
// 0x0018 (0x0018 - 0x0000)
struct SparksCosmeticComponent_GetEquippedJamSongUIDForIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetOwnedJamSongShortnameForIndex
// 0x0008 (0x0008 - 0x0000)
struct SparksCosmeticComponent_GetOwnedJamSongShortnameForIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetOwnedJamTracksCount
// 0x0004 (0x0004 - 0x0000)
struct SparksCosmeticComponent_GetOwnedJamTracksCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.OnMaterialOverridesCleared
// 0x0008 (0x0008 - 0x0000)
struct SparksCosmeticComponent_OnMaterialOverridesCleared final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.OnWeaponChanged
// 0x0010 (0x0010 - 0x0000)
struct SparksCosmeticComponent_OnWeaponChanged final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.SetActiveAuraItemDef
// 0x0008 (0x0008 - 0x0000)
struct SparksCosmeticComponent_SetActiveAuraItemDef final
{
public:
	class USparksAuraItemDefinition*              NewAuraItemDef;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.SetActiveInstrumentItemDef
// 0x0008 (0x0008 - 0x0000)
struct SparksCosmeticComponent_SetActiveInstrumentItemDef final
{
public:
	class USparksInstrumentItemDefBase*           InstrumentItemDef;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.SetActiveItemDef
// 0x0008 (0x0008 - 0x0000)
struct SparksCosmeticComponent_SetActiveItemDef final
{
public:
	class USparksAccountItemDefinition*           NewItemDef;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.SetActiveSpotlightAnimDef
// 0x0008 (0x0008 - 0x0000)
struct SparksCosmeticComponent_SetActiveSpotlightAnimDef final
{
public:
	class USparksSpotlightAnimDefinition*         NewSpotlightDef;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.SetAuraState
// 0x0001 (0x0001 - 0x0000)
struct SparksCosmeticComponent_SetAuraState final
{
public:
	bool                                          bShouldBeActive;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.SetVariantChoice
// 0x0018 (0x0018 - 0x0000)
struct SparksCosmeticComponent_SetVariantChoice final
{
public:
	ESparksAccountItemSubtype                     Subtype;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksInstrumentType                         InstrumentType;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           VariantChannel;                                    // 0x0004(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetAccountItemTypeFromInstrumentType
// 0x0002 (0x0002 - 0x0000)
struct SparksCosmeticComponent_GetAccountItemTypeFromInstrumentType final
{
public:
	ESparksInstrumentType                         Instrument;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksAccountItemSubtype                     ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetChoice
// 0x0028 (0x0028 - 0x0000)
struct SparksCosmeticComponent_GetChoice final
{
public:
	struct FSparksVariantChoice                   OutChoice;                                         // 0x0000(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	ESparksAccountItemSubtype                     Subtype;                                           // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksInstrumentType                         InstrumentType;                                    // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           VariantChannel;                                    // 0x001C(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetCosmeticItem
// 0x0010 (0x0010 - 0x0000)
struct SparksCosmeticComponent_GetCosmeticItem final
{
public:
	ESparksAccountItemSubtype                     Subtype;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparksInstrumentType                         Instrument;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class USparksAccountItemDefinition*     ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetEquippedJamTracksCount
// 0x0004 (0x0004 - 0x0000)
struct SparksCosmeticComponent_GetEquippedJamTracksCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetInstrumentAuxiliaryCosmetics
// 0x0028 (0x0028 - 0x0000)
struct SparksCosmeticComponent_GetInstrumentAuxiliaryCosmetics final
{
public:
	ESparksInstrumentType                         InstrumentType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          OutMesh;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      OutMaterial;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      OutMaterial2;                                      // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetInstrumentAuxiliaryVFX
// 0x0018 (0x0018 - 0x0000)
struct SparksCosmeticComponent_GetInstrumentAuxiliaryVFX final
{
public:
	ESparksInstrumentType                         InstrumentType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         OutFX;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetInstrumentCosmetics
// 0x0030 (0x0030 - 0x0000)
struct SparksCosmeticComponent_GetInstrumentCosmetics final
{
public:
	ESparksInstrumentType                         InstrumentType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          OutMesh;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      OutMaterial;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          OutLHMesh;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      OutLHMaterial;                                     // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetInstrumentVFX
// 0x0020 (0x0020 - 0x0000)
struct SparksCosmeticComponent_GetInstrumentVFX final
{
public:
	ESparksInstrumentType                         InstrumentType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemAsset*                         OutFX;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFXSystemAsset*                         OutLHFX;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCosmeticsRuntime.SparksCosmeticComponent.GetSpotlightAnim
// 0x0010 (0x0010 - 0x0000)
struct SparksCosmeticComponent_GetSpotlightAnim final
{
public:
	ESparksInstrumentType                         InstrumentType;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksCosmeticsCheatManager.GrantSparksSongsLoadedAssets
// 0x0001 (0x0001 - 0x0000)
struct SparksCosmeticsCheatManager_GrantSparksSongsLoadedAssets final
{
public:
	bool                                          bIncludeSongsWithoutCatalogData;                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentComponentBase.GetInstrumentType
// 0x0001 (0x0001 - 0x0000)
struct SparksInstrumentComponentBase_GetInstrumentType final
{
public:
	ESparksInstrumentType                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentItemDefBase.GetAuxFXSystem
// 0x0058 (0x0058 - 0x0000)
struct SparksInstrumentItemDefBase_GetAuxFXSystem final
{
public:
	struct FSparksVariantChoices                  Choices;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFXSystemAsset*                         ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentItemDefBase.GetAuxiliaryMaterial
// 0x0058 (0x0058 - 0x0000)
struct SparksInstrumentItemDefBase_GetAuxiliaryMaterial final
{
public:
	struct FSparksVariantChoices                  Choices;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentItemDefBase.GetAuxiliaryMaterial2
// 0x0058 (0x0058 - 0x0000)
struct SparksInstrumentItemDefBase_GetAuxiliaryMaterial2 final
{
public:
	struct FSparksVariantChoices                  Choices;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentItemDefBase.GetAuxiliaryMesh
// 0x0058 (0x0058 - 0x0000)
struct SparksInstrumentItemDefBase_GetAuxiliaryMesh final
{
public:
	struct FSparksVariantChoices                  Choices;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentItemDefBase.GetLeftHandMaterial
// 0x0058 (0x0058 - 0x0000)
struct SparksInstrumentItemDefBase_GetLeftHandMaterial final
{
public:
	struct FSparksVariantChoices                  Choices;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentItemDefBase.GetLeftHandMesh
// 0x0058 (0x0058 - 0x0000)
struct SparksInstrumentItemDefBase_GetLeftHandMesh final
{
public:
	struct FSparksVariantChoices                  Choices;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentItemDefBase.GetLHFXSystem
// 0x0058 (0x0058 - 0x0000)
struct SparksInstrumentItemDefBase_GetLHFXSystem final
{
public:
	struct FSparksVariantChoices                  Choices;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFXSystemAsset*                         ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentItemDefBase.GetMainFXSystem
// 0x0058 (0x0058 - 0x0000)
struct SparksInstrumentItemDefBase_GetMainFXSystem final
{
public:
	struct FSparksVariantChoices                  Choices;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFXSystemAsset*                         ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentItemDefBase.GetMaterial
// 0x0058 (0x0058 - 0x0000)
struct SparksInstrumentItemDefBase_GetMaterial final
{
public:
	struct FSparksVariantChoices                  Choices;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentItemDefBase.GetMesh
// 0x0058 (0x0058 - 0x0000)
struct SparksInstrumentItemDefBase_GetMesh final
{
public:
	struct FSparksVariantChoices                  Choices;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksInstrumentPreviewActor.GetCurrentChoices
// 0x0050 (0x0050 - 0x0000)
struct SparksInstrumentPreviewActor_GetCurrentChoices final
{
public:
	struct FSparksVariantChoices                  ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksItemPreviewOffPawnActor.GetInstrumentType
// 0x0001 (0x0001 - 0x0000)
struct SparksItemPreviewOffPawnActor_GetInstrumentType final
{
public:
	ESparksInstrumentType                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksJamEmoteItemDefinition.GetJamLoopType
// 0x0001 (0x0001 - 0x0000)
struct SparksJamEmoteItemDefinition_GetJamLoopType final
{
public:
	EFMJamLoopType                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksJamEmoteItemDefinition.GetJamSongMetaData
// 0x0010 (0x0010 - 0x0000)
struct SparksJamEmoteItemDefinition_GetJamSongMetaData final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UCatalogData*                     ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksJamEmoteItemDefinition.GetJamSongShortName
// 0x0010 (0x0010 - 0x0000)
struct SparksJamEmoteItemDefinition_GetJamSongShortName final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCosmeticsRuntime.SparksJamEmoteItemDefinition.GetSongItemDef
// 0x0008 (0x0008 - 0x0000)
struct SparksJamEmoteItemDefinition_GetSongItemDef final
{
public:
	class USparksSongItemDefinition*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksJamEmoteItemDefinition.IsJamLoopEnabled
// 0x0010 (0x0010 - 0x0000)
struct SparksJamEmoteItemDefinition_IsJamLoopEnabled final
{
public:
	const class AFortPlayerController*            PlayerController;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function SparksCosmeticsRuntime.SparksPlayerStateComponent.SetSparksInstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct SparksPlayerStateComponent_SetSparksInstrumentChoice final
{
public:
	ESparksInstrumentType                         Instrument;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksPlayerStateComponent.GetSparksInstrumentChoice
// 0x0001 (0x0001 - 0x0000)
struct SparksPlayerStateComponent_GetSparksInstrumentChoice final
{
public:
	ESparksInstrumentType                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function SparksCosmeticsRuntime.SparksSongPreviewActor.OnSongTextureLoaded
// 0x0008 (0x0008 - 0x0000)
struct SparksSongPreviewActor_OnSongTextureLoaded final
{
public:
	class UTexture2D*                             CoverArt;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

