#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SparksCoreUI

#include "Basic.hpp"

#include "DynamicUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SparksCoreUI.SparksDynamicUIDirector
// 0x0028 (0x02D8 - 0x02B0)
class ASparksDynamicUIDirector : public ADynamicUIDirectorBase
{
public:
	uint8                                         Pad_2B0[0x28];                                     // 0x02B0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCursorModeChanging(bool bCursorModeEnabled, class FName ActionName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksDynamicUIDirector">();
	}
	static class ASparksDynamicUIDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASparksDynamicUIDirector>();
	}
};

// Class SparksCoreUI.SparksQuestScreenContainer
// 0x0050 (0x0330 - 0x02E0)
class USparksQuestScreenContainer final : public UCommonUserWidget
{
public:
	class FName                                   QuestTabID;                                        // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaMapScreenContainer*              AthenaScreenContainer;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseToggleSongMenuInputAction;                     // 0x02F0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           ToggleSongMenuInputAction;                         // 0x02F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x24];                                     // 0x0300(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UGameplayEventRouterComponent> EventRouter;                                 // 0x0324(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EventRouterToggleQuestList(const struct FSparksQuestScreenToggleEvent& Payload);
	void HandleAthenaScreenDeactivated();
	void HandleMapPanelExitButtonPressed();
	void HandleToggleQuestList();
	void HandleToggleQuestListFromMapVisibility(bool bMapVisible);
	void InitEventRouterBindings(class UGameplayEventRouterComponent* NewEventRouter);
	void SetQuestScreenVisible(const bool bVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksQuestScreenContainer">();
	}
	static class USparksQuestScreenContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksQuestScreenContainer>();
	}
};

// Class SparksCoreUI.SparksSocialAvatarIcon
// 0x0000 (0x03E0 - 0x03E0)
class USparksSocialAvatarIcon final : public UFortSocialAvatarIcon
{
public:
	void BP_SetSocialUserFromPlayerState(const class AFortPlayerState* PlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksSocialAvatarIcon">();
	}
	static class USparksSocialAvatarIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSocialAvatarIcon>();
	}
};

// Class SparksCoreUI.SparksSongItemDetailsVM
// 0x0020 (0x0330 - 0x0310)
class USparksSongItemDetailsVM final : public UAthenaItemDetailsVM
{
public:
	class UTexture2D*                             CoverArt;                                          // 0x0310(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_318[0x18];                                     // 0x0318(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSongCatalogRetrieved(bool bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksSongItemDetailsVM">();
	}
	static class USparksSongItemDetailsVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSongItemDetailsVM>();
	}
};

// Class SparksCoreUI.SparksSongItemVM
// 0x0000 (0x0110 - 0x0110)
class USparksSongItemVM final : public UAthenaItemVM
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksSongItemVM">();
	}
	static class USparksSongItemVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSongItemVM>();
	}
};

// Class SparksCoreUI.SparksSongLockerCategoryConfig
// 0x0000 (0x0178 - 0x0178)
class USparksSongLockerCategoryConfig final : public UAthenaLockerCategoryConfig
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksSongLockerCategoryConfig">();
	}
	static class USparksSongLockerCategoryConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksSongLockerCategoryConfig>();
	}
};

// Class SparksCoreUI.SparksCoreUIGlobals
// 0x0000 (0x0028 - 0x0028)
class USparksCoreUIGlobals final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparksCoreUIGlobals">();
	}
	static class USparksCoreUIGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparksCoreUIGlobals>();
	}
};

}

