#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetrics

#include "Basic.hpp"

#include "SpatialMetricsCore_classes.hpp"
#include "SpatialMetrics_structs.hpp"


namespace SDK
{

// Class SpatialMetrics.SpatialActorCountMetric
// 0x0008 (0x0088 - 0x0080)
class USpatialActorCountMetric final : public UPlayerBasedSpatialMetricBase
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialActorCountMetric">();
	}
	static class USpatialActorCountMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialActorCountMetric>();
	}
};

// Class SpatialMetrics.SpatialActorResourceSizeMetric
// 0x00E8 (0x0138 - 0x0050)
class USpatialActorResourceSizeMetric final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_50[0xE0];                                      // 0x0050(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpdateTimeThresholdInMs;                           // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EResourceSizeMemoryCategory                   MemoryCategoryFlags;                               // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialActorResourceSizeMetric">();
	}
	static class USpatialActorResourceSizeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialActorResourceSizeMetric>();
	}
};

// Class SpatialMetrics.SpatialAvailableMemoryMetric
// 0x0000 (0x0080 - 0x0080)
class USpatialAvailableMemoryMetric final : public UPlayerBasedSpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialAvailableMemoryMetric">();
	}
	static class USpatialAvailableMemoryMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialAvailableMemoryMetric>();
	}
};

// Class SpatialMetrics.SpatialFrameTimeMetric
// 0x0000 (0x0080 - 0x0080)
class USpatialFrameTimeMetric final : public UPlayerBasedSpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialFrameTimeMetric">();
	}
	static class USpatialFrameTimeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialFrameTimeMetric>();
	}
};

// Class SpatialMetrics.SpatialGameUpdateTimeMetric
// 0x0000 (0x0080 - 0x0080)
class USpatialGameUpdateTimeMetric final : public UPlayerBasedSpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialGameUpdateTimeMetric">();
	}
	static class USpatialGameUpdateTimeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialGameUpdateTimeMetric>();
	}
};

// Class SpatialMetrics.SpatialMemoryUsageMetric
// 0x0000 (0x0080 - 0x0080)
class USpatialMemoryUsageMetric final : public UPlayerBasedSpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMemoryUsageMetric">();
	}
	static class USpatialMemoryUsageMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMemoryUsageMetric>();
	}
};

// Class SpatialMetrics.SpatialProxyMetric
// 0x0050 (0x00A0 - 0x0050)
class USpatialProxyMetric final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialProxyMetric">();
	}
	static class USpatialProxyMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialProxyMetric>();
	}
};

// Class SpatialMetrics.SpatialRenderTimeMetric
// 0x0000 (0x0080 - 0x0080)
class USpatialRenderTimeMetric final : public UPlayerBasedSpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialRenderTimeMetric">();
	}
	static class USpatialRenderTimeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialRenderTimeMetric>();
	}
};

}

