#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetricsExperimental

#include "Basic.hpp"

#include "SpatialMetricsCore_classes.hpp"
#include "WorldMetricsCore_classes.hpp"
#include "SpatialMetricsExperimental_structs.hpp"
#include "SpatialMetrics_structs.hpp"


namespace SDK
{

// Class SpatialMetricsExperimental.ActorPackageDependencyARDiskSizeMetric_Archive
// 0x02D8 (0x0328 - 0x0050)
class UActorPackageDependencyARDiskSizeMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_50[0x2D8];                                     // 0x0050(0x02D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyARDiskSizeMetric_Archive">();
	}
	static class UActorPackageDependencyARDiskSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyARDiskSizeMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.ActorPackageDependencyCountMetric_Archive
// 0x02D0 (0x0320 - 0x0050)
class UActorPackageDependencyCountMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_50[0x2D0];                                     // 0x0050(0x02D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyCountMetric_Archive">();
	}
	static class UActorPackageDependencyCountMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyCountMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.ActorPackageDependencyIoDispatcherSizeMetric_Archive
// 0x02E0 (0x0330 - 0x0050)
class UActorPackageDependencyIoDispatcherSizeMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_50[0x2D8];                                     // 0x0050(0x02D8)(Fixing Size After Last Property [ Dumper-7 ])
	EIoDispatcherChunkTypeFlags                   ChunkTypeFlags;                                    // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyIoDispatcherSizeMetric_Archive">();
	}
	static class UActorPackageDependencyIoDispatcherSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyIoDispatcherSizeMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.ActorPackageDependencyResourceSizeMetric_Archive
// 0x02E0 (0x0330 - 0x0050)
class UActorPackageDependencyResourceSizeMetric_Archive final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_50[0x2D8];                                     // 0x0050(0x02D8)(Fixing Size After Last Property [ Dumper-7 ])
	EResourceSizeMemoryCategory                   MemoryCategoryFlags;                               // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorPackageDependencyResourceSizeMetric_Archive">();
	}
	static class UActorPackageDependencyResourceSizeMetric_Archive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorPackageDependencyResourceSizeMetric_Archive>();
	}
};

// Class SpatialMetricsExperimental.LevelPackageDiskSizeMetric
// 0x03A0 (0x03F0 - 0x0050)
class ULevelPackageDiskSizeMetric final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_50[0x390];                                     // 0x0050(0x0390)(Fixing Size After Last Property [ Dumper-7 ])
	class USpatialMetricsPackageMetadataProvider* IoStorePackageHandler;                             // 0x03E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EIoDispatcherChunkTypeFlags                   ChunkTypeFlags;                                    // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelPackageDiskSizeMetric">();
	}
	static class ULevelPackageDiskSizeMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelPackageDiskSizeMetric>();
	}
};

// Class SpatialMetricsExperimental.SpatialMetricsPackageMetadataProvider
// 0x0008 (0x0030 - 0x0028)
class USpatialMetricsPackageMetadataProvider final : public UWorldMetricsExtension
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsPackageMetadataProvider">();
	}
	static class USpatialMetricsPackageMetadataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsPackageMetadataProvider>();
	}
};

}

