#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialMetricsCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SpatialMetricsCore_structs.hpp"
#include "WorldMetricsCore_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SpatialMetricsCore.SpatialMetricsActorIndexerSubscriber
// 0x0000 (0x0000 - 0x0000)
class ISpatialMetricsActorIndexerSubscriber final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsActorIndexerSubscriber">();
	}
	static class ISpatialMetricsActorIndexerSubscriber* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpatialMetricsActorIndexerSubscriber>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class SpatialMetricsCore.SpatialMetricsContextInterface
// 0x0000 (0x0000 - 0x0000)
class ISpatialMetricsContextInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsContextInterface">();
	}
	static class ISpatialMetricsContextInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpatialMetricsContextInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class SpatialMetricsCore.SpatialMetricsLocationIndexerSubscriber
// 0x0000 (0x0000 - 0x0000)
class ISpatialMetricsLocationIndexerSubscriber final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsLocationIndexerSubscriber">();
	}
	static class ISpatialMetricsLocationIndexerSubscriber* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpatialMetricsLocationIndexerSubscriber>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class SpatialMetricsCore.SpatialMetricInterface
// 0x0028 (0x0050 - 0x0028)
class USpatialMetricInterface : public UWorldMetricInterface
{
public:
	struct FSpatialMetricProperties               Properties;                                        // 0x0028(0x0028)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricInterface">();
	}
	static class USpatialMetricInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricInterface>();
	}
};

// Class SpatialMetricsCore.SpatialMetricBase
// 0x0030 (0x0080 - 0x0050)
class USpatialMetricBase : public USpatialMetricInterface
{
public:
	uint8                                         Pad_50[0x30];                                      // 0x0050(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricBase">();
	}
	static class USpatialMetricBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricBase>();
	}
};

// Class SpatialMetricsCore.PlayerBasedSpatialMetricBase
// 0x0000 (0x0080 - 0x0080)
class UPlayerBasedSpatialMetricBase : public USpatialMetricBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerBasedSpatialMetricBase">();
	}
	static class UPlayerBasedSpatialMetricBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerBasedSpatialMetricBase>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsActorIndexer
// 0x01C0 (0x01E8 - 0x0028)
class USpatialMetricsActorIndexer final : public UWorldMetricsExtension
{
public:
	uint8                                         Pad_28[0x1B8];                                     // 0x0028(0x01B8)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexCacheSize;                                    // 0x01E0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsActorIndexer">();
	}
	static class USpatialMetricsActorIndexer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsActorIndexer>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsLocationIndexer
// 0x0120 (0x0148 - 0x0028)
class USpatialMetricsLocationIndexer final : public UWorldMetricsExtension
{
public:
	uint8                                         Pad_28[0x120];                                     // 0x0028(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsLocationIndexer">();
	}
	static class USpatialMetricsLocationIndexer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsLocationIndexer>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsPlayerContext
// 0x0018 (0x0040 - 0x0028)
class USpatialMetricsPlayerContext final : public UWorldMetricsExtension
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpatialPrecision;                                  // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerPawnPossessionChanged(class APawn* OldPawn, class APawn* NewPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsPlayerContext">();
	}
	static class USpatialMetricsPlayerContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsPlayerContext>();
	}
};

// Class SpatialMetricsCore.SpatialMetricsSubsystem
// 0x0048 (0x0078 - 0x0030)
class USpatialMetricsSubsystem final : public UWorldSubsystem
{
public:
	TArray<class USpatialMetricInterface*>        Metrics;                                           // 0x0030(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FSoftClassPath>                 AllowedMetricClasses;                              // 0x0040(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FSoftClassPath>                 BlockedMetricClasses;                              // 0x0050(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x1];                                       // 0x0060(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutoCreateConnectorServer;                        // 0x0061(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_62[0x16];                                      // 0x0062(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpatialMetricsSubsystem">();
	}
	static class USpatialMetricsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialMetricsSubsystem>();
	}
};

// Class SpatialMetricsCore.TestMetric
// 0x0080 (0x00D0 - 0x0050)
class UTestMetric final : public USpatialMetricInterface
{
public:
	uint8                                         Pad_50[0x74];                                      // 0x0050(0x0074)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SamplingDistance;                                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldSamplingFactor;                               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestMetric">();
	}
	static class UTestMetric* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMetric>();
	}
};

}

