#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanchUI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class SrirachaRanchUI.RadioStation
// 0x0030 (0x0058 - 0x0028)
class URadioStation final : public UObject
{
public:
	TMulticastInlineDelegate<void(class URadioStation* RadioStation)> OnStationImageIsLoaded;        // 0x0028(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	class UEpicCMSImage*                          StationCMSImage;                                   // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLoadingImageComplete();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RadioStation">();
	}
	static class URadioStation* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadioStation>();
	}
};

// Class SrirachaRanchUI.FortMobileActionButtonBehavior_ToggleRadio
// 0x0010 (0x0140 - 0x0130)
class UFortMobileActionButtonBehavior_ToggleRadio final : public UFortMobileActionButtonBehavior
{
public:
	class UPaperSprite*                           ToggleRadioOffSprite;                              // 0x0130(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleRadioPlaying(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void HandleRadioStopped(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMobileActionButtonBehavior_ToggleRadio">();
	}
	static class UFortMobileActionButtonBehavior_ToggleRadio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_ToggleRadio>();
	}
};

// Class SrirachaRanchUI.RadioMenuPicker
// 0x0050 (0x0448 - 0x03F8)
class URadioMenuPicker final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryContentSetup                   PrimaryContentSetup;                               // 0x0400(0x0003)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_403[0x5];                                      // 0x0403(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPickerOverlay*                     PickerOverlay_RadioMenu;                           // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RadioStationName;                             // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_RadioStationCurrentSong;                      // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class URadioStation*>                  RadioStations;                                     // 0x0420(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_430[0x18];                                     // 0x0430(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleMetadataChanged(const struct FFortMediaInBandMetadata& MediaMetadata);
	void OnLoadingStationImageComplete(class URadioStation* RadioMenuStation);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RadioMenuPicker">();
	}
	static class URadioMenuPicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadioMenuPicker>();
	}
};

// Class SrirachaRanchUI.RadioPlayerWidgetBase
// 0x0088 (0x0480 - 0x03F8)
class URadioPlayerWidgetBase final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_3F8[0x40];                                     // 0x03F8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPrioritizedWidgetData             PriorityData;                                      // 0x0438(0x0002)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_43A[0x6];                                      // 0x043A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    PressedObjectInputAction;                          // 0x0440(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_450[0x8];                                      // 0x0450(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   RadioMenuPickerClass;                              // 0x0458(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidget*               RadioMenuPickerWidget;                             // 0x0460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_Keybind;                                   // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ToggleActionWidget;                                // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStreamingRadioPlayerComponent*         LastValidComp;                                     // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	float GetRadioStatusOnScreenTime();
	bool IsMetadataEmpty(const struct FFortMediaInBandMetadata& MediaMetadata);
	void NativeChangedSeatVehicle(const int32 SeatIndex);
	void NativeEnteredVehicle();
	void NativeExitedVehicle();
	void OnControllerGainedNewFortPawn(class AFortPawn* FortPawn);
	void OnFailedToOpenSource(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void OnLoadingNewSource(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void OnMetadataChanged(const struct FFortMediaInBandMetadata& MediaMetadata);
	void OnRadioStopped(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& LastSource);
	void OnSourceFinished(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void OnSourcePlaying(class UStreamingRadioPlayerComponent* Radio, const struct FAthenaRadioStation& Source);
	void SetControllable(bool bCanControl);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RadioPlayerWidgetBase">();
	}
	static class URadioPlayerWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadioPlayerWidgetBase>();
	}
};

}

