#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateTreeModule

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function StateTreeModule.StateTreeNodeBlueprintBase.RequestTransition
// 0x0004 (0x0004 - 0x0000)
struct StateTreeNodeBlueprintBase_RequestTransition final
{
public:
	struct FStateTreeStateLink                    TargetState;                                       // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x0002(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function StateTreeModule.StateTreeNodeBlueprintBase.SendEvent
// 0x0020 (0x0020 - 0x0000)
struct StateTreeNodeBlueprintBase_SendEvent final
{
public:
	struct FStateTreeEvent                        Event;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StateTreeModule.StateTreeNodeBlueprintBase.GetPropertyReference
// 0x0010 (0x0010 - 0x0000)
struct StateTreeNodeBlueprintBase_GetPropertyReference final
{
public:
	struct FStateTreeBlueprintPropertyRef         PropertyRef;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function StateTreeModule.StateTreeNodeBlueprintBase.IsPropertyRefValid
// 0x0018 (0x0018 - 0x0000)
struct StateTreeNodeBlueprintBase_IsPropertyRefValid final
{
public:
	struct FStateTreeBlueprintPropertyRef         PropertyRef;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function StateTreeModule.StateTreeConditionBlueprintBase.ReceiveTestCondition
// 0x0001 (0x0001 - 0x0000)
struct StateTreeConditionBlueprintBase_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StateTreeModule.StateTreeEvaluatorBlueprintBase.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct StateTreeEvaluatorBlueprintBase_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StateTreeModule.StateTreeTaskBlueprintBase.FinishTask
// 0x0001 (0x0001 - 0x0000)
struct StateTreeTaskBlueprintBase_FinishTask final
{
public:
	bool                                          bSucceeded;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveEnterState
// 0x0048 (0x0048 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveEnterState final
{
public:
	struct FStateTreeTransitionResult             TRANSITION;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveExitState
// 0x0040 (0x0040 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveExitState final
{
public:
	struct FStateTreeTransitionResult             TRANSITION;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveLatentEnterState
// 0x0040 (0x0040 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             TRANSITION;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveLatentTick
// 0x0004 (0x0004 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveLatentTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveStateCompleted
// 0x0014 (0x0014 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveStateCompleted final
{
public:
	EStateTreeRunStatus                           CompletionStatus;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeActiveStates                 CompletedActiveStates;                             // 0x0002(0x0012)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveTick
// 0x0008 (0x0008 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

