#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateTreeModule

#include "Basic.hpp"

#include "StructUtils_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// Enum StateTreeModule.EStateTreeBreakpointType
// NumValues: 0x0005
enum class EStateTreeBreakpointType : uint8
{
	Unset                                    = 0,
	OnEnter                                  = 1,
	OnExit                                   = 2,
	OnTransition                             = 3,
	EStateTreeBreakpointType_MAX             = 4,
};

// Enum StateTreeModule.EStateTreeUpdatePhase
// NumValues: 0x0012
enum class EStateTreeUpdatePhase : uint8
{
	Unset                                    = 0,
	StartTree                                = 1,
	StopTree                                 = 2,
	StartGlobalTasks                         = 3,
	StopGlobalTasks                          = 4,
	TickStateTree                            = 5,
	ApplyTransitions                         = 6,
	TriggerTransitions                       = 7,
	TickingGlobalTasks                       = 8,
	TickingTasks                             = 9,
	TransitionConditions                     = 10,
	StateSelection                           = 11,
	TrySelectBehavior                        = 12,
	EnterConditions                          = 13,
	EnterStates                              = 14,
	ExitStates                               = 15,
	StateCompleted                           = 16,
	EStateTreeUpdatePhase_MAX                = 17,
};

// Enum StateTreeModule.EStateTreeRunStatus
// NumValues: 0x0006
enum class EStateTreeRunStatus : uint8
{
	Running                                  = 0,
	Failed                                   = 1,
	Succeeded                                = 2,
	Stopped                                  = 3,
	Unset                                    = 4,
	EStateTreeRunStatus_MAX                  = 5,
};

// Enum StateTreeModule.EStateTreeStateChangeType
// NumValues: 0x0004
enum class EStateTreeStateChangeType : uint8
{
	None                                     = 0,
	Changed                                  = 1,
	Sustained                                = 2,
	EStateTreeStateChangeType_MAX            = 3,
};

// Enum StateTreeModule.EStateTreeConditionEvaluationMode
// NumValues: 0x0004
enum class EStateTreeConditionEvaluationMode : uint8
{
	Evaluated                                = 0,
	ForcedTrue                               = 1,
	ForcedFalse                              = 2,
	EStateTreeConditionEvaluationMode_MAX    = 3,
};

// Enum StateTreeModule.EStateTreeTransitionSourceType
// NumValues: 0x0005
enum class EStateTreeTransitionSourceType : uint8
{
	Unset                                    = 0,
	Asset                                    = 1,
	ExternalRequest                          = 2,
	Internal                                 = 3,
	EStateTreeTransitionSourceType_MAX       = 4,
};

// Enum StateTreeModule.EStateTreeLinkerStatus
// NumValues: 0x0003
enum class EStateTreeLinkerStatus : uint8
{
	Succeeded                                = 0,
	Failed                                   = 1,
	EStateTreeLinkerStatus_MAX               = 2,
};

// Enum StateTreeModule.EStateTreeNodeFormatting
// NumValues: 0x0003
enum class EStateTreeNodeFormatting : uint8
{
	RichText                                 = 0,
	Text                                     = 1,
	EStateTreeNodeFormatting_MAX             = 2,
};

// Enum StateTreeModule.EStateTreePropertyRefType
// NumValues: 0x0011
enum class EStateTreePropertyRefType : uint8
{
	None                                     = 0,
	Bool                                     = 1,
	Byte                                     = 2,
	Int32                                    = 3,
	Int64                                    = 4,
	Float                                    = 5,
	Double                                   = 6,
	Name                                     = 7,
	String                                   = 8,
	Text                                     = 9,
	Enum                                     = 10,
	Struct                                   = 11,
	Object                                   = 12,
	SoftObject                               = 13,
	Class                                    = 14,
	SoftClass                                = 15,
	EStateTreePropertyRefType_MAX            = 16,
};

// Enum StateTreeModule.EStateTreeTraceEventType
// NumValues: 0x0016
enum class EStateTreeTraceEventType : uint8
{
	Unset                                    = 0,
	OnEntering                               = 1,
	OnEntered                                = 2,
	OnExiting                                = 3,
	OnExited                                 = 4,
	Push                                     = 5,
	Pop                                      = 6,
	OnStateSelected                          = 7,
	OnStateCompleted                         = 8,
	OnTicking                                = 9,
	OnTaskCompleted                          = 10,
	OnTicked                                 = 11,
	Passed                                   = 12,
	Failed                                   = 13,
	ForcedSuccess                            = 14,
	ForcedFailure                            = 15,
	InternalForcedFailure                    = 16,
	OnEvaluating                             = 17,
	OnTransition                             = 18,
	OnTreeStarted                            = 19,
	OnTreeStopped                            = 20,
	EStateTreeTraceEventType_MAX             = 21,
};

// Enum StateTreeModule.EStateTreeBlueprintPropertyCategory
// NumValues: 0x0006
enum class EStateTreeBlueprintPropertyCategory : uint8
{
	NotSet                                   = 0,
	Input                                    = 1,
	Parameter                                = 2,
	Output                                   = 3,
	ContextObject                            = 4,
	EStateTreeBlueprintPropertyCategory_MAX  = 5,
};

// Enum StateTreeModule.EStateTreeLoopEvents
// NumValues: 0x0004
enum class EStateTreeLoopEvents : uint8
{
	Next                                     = 0,
	Break                                    = 1,
	Consume                                  = 2,
	EStateTreeLoopEvents_MAX                 = 3,
};

// Enum StateTreeModule.EStateTreeBindableStructSource
// NumValues: 0x000A
enum class EStateTreeBindableStructSource : uint8
{
	Context                                  = 0,
	Parameter                                = 1,
	Evaluator                                = 2,
	GlobalTask                               = 3,
	StateParameter                           = 4,
	Task                                     = 5,
	Condition                                = 6,
	TransitionEvent                          = 7,
	StateEvent                               = 8,
	EStateTreeBindableStructSource_MAX       = 9,
};

// Enum StateTreeModule.EStateTreePropertyAccessType
// NumValues: 0x0008
enum class EStateTreePropertyAccessType : uint8
{
	Offset                                   = 0,
	Object                                   = 1,
	WeakObject                               = 2,
	SoftObject                               = 3,
	ObjectInstance                           = 4,
	StructInstance                           = 5,
	IndexArray                               = 6,
	EStateTreePropertyAccessType_MAX         = 7,
};

// Enum StateTreeModule.EStateTreePropertyCopyType
// NumValues: 0x0021
enum class EStateTreePropertyCopyType : uint8
{
	None                                     = 0,
	CopyPlain                                = 1,
	CopyComplex                              = 2,
	CopyBool                                 = 3,
	CopyStruct                               = 4,
	CopyObject                               = 5,
	CopyName                                 = 6,
	CopyFixedArray                           = 7,
	StructReference                          = 8,
	PromoteBoolToByte                        = 9,
	PromoteBoolToInt32                       = 10,
	PromoteBoolToUInt32                      = 11,
	PromoteBoolToInt64                       = 12,
	PromoteBoolToFloat                       = 13,
	PromoteBoolToDouble                      = 14,
	PromoteByteToInt32                       = 15,
	PromoteByteToUInt32                      = 16,
	PromoteByteToInt64                       = 17,
	PromoteByteToFloat                       = 18,
	PromoteByteToDouble                      = 19,
	PromoteInt32ToInt64                      = 20,
	PromoteInt32ToFloat                      = 21,
	PromoteInt32ToDouble                     = 22,
	PromoteUInt32ToInt64                     = 23,
	PromoteUInt32ToFloat                     = 24,
	PromoteUInt32ToDouble                    = 25,
	PromoteFloatToInt32                      = 26,
	PromoteFloatToInt64                      = 27,
	PromoteFloatToDouble                     = 28,
	DemoteDoubleToInt32                      = 29,
	DemoteDoubleToInt64                      = 30,
	DemoteDoubleToFloat                      = 31,
	EStateTreePropertyCopyType_MAX           = 32,
};

// Enum StateTreeModule.EStateTreeTransitionType
// NumValues: 0x0008
enum class EStateTreeTransitionType : uint8
{
	None                                     = 0,
	Succeeded                                = 1,
	Failed                                   = 2,
	GotoState                                = 3,
	NextState                                = 4,
	NextSelectableState                      = 5,
	NotSet                                   = 6,
	EStateTreeTransitionType_MAX             = 7,
};

// Enum StateTreeModule.EStateTreeConditionOperand
// NumValues: 0x0004
enum class EStateTreeConditionOperand : uint8
{
	Copy                                     = 0,
	And                                      = 1,
	Or                                       = 2,
	EStateTreeConditionOperand_MAX           = 3,
};

// Enum StateTreeModule.EStateTreeStateType
// NumValues: 0x0006
enum class EStateTreeStateType : uint8
{
	State                                    = 0,
	Group                                    = 1,
	Linked                                   = 2,
	LinkedAsset                              = 3,
	Subtree                                  = 4,
	EStateTreeStateType_MAX                  = 5,
};

// Enum StateTreeModule.EStateTreeStateSelectionBehavior
// NumValues: 0x0006
enum class EStateTreeStateSelectionBehavior : uint8
{
	None                                     = 0,
	TryEnterState                            = 1,
	TrySelectChildrenInOrder                 = 2,
	TrySelectChildrenAtUniformRandom         = 3,
	TryFollowTransitions                     = 4,
	EStateTreeStateSelectionBehavior_MAX     = 5,
};

// Enum StateTreeModule.EStateTreeTransitionTrigger
// NumValues: 0x0007
enum class EStateTreeTransitionTrigger : uint8
{
	None                                     = 0,
	OnStateCompleted                         = 3,
	OnStateSucceeded                         = 1,
	OnStateFailed                            = 2,
	OnTick                                   = 4,
	OnEvent                                  = 8,
	MAX                                      = 9,
};

// Enum StateTreeModule.EStateTreeTransitionPriority
// NumValues: 0x0007
enum class EStateTreeTransitionPriority : uint8
{
	None                                     = 0,
	Low                                      = 1,
	Normal                                   = 2,
	Medium                                   = 3,
	High                                     = 4,
	Critical                                 = 5,
	EStateTreeTransitionPriority_MAX         = 6,
};

// Enum StateTreeModule.EStateTreeDataSourceType
// NumValues: 0x000F
enum class EStateTreeDataSourceType : uint8
{
	None                                     = 0,
	GlobalInstanceData                       = 1,
	GlobalInstanceDataObject                 = 2,
	ActiveInstanceData                       = 3,
	ActiveInstanceDataObject                 = 4,
	SharedInstanceData                       = 5,
	SharedInstanceDataObject                 = 6,
	ContextData                              = 7,
	ExternalData                             = 8,
	GlobalParameterData                      = 9,
	SubtreeParameterData                     = 10,
	StateParameterData                       = 11,
	TransitionEvent                          = 12,
	StateEvent                               = 13,
	EStateTreeDataSourceType_MAX             = 14,
};

// Enum StateTreeModule.EStateTreeSelectionFallback
// NumValues: 0x0003
enum class EStateTreeSelectionFallback : uint8
{
	None                                     = 0,
	NextSelectableSibling                    = 1,
	EStateTreeSelectionFallback_MAX          = 2,
};

// Enum StateTreeModule.EStateTreeExternalDataRequirement
// NumValues: 0x0003
enum class EStateTreeExternalDataRequirement : uint8
{
	Required                                 = 0,
	Optional                                 = 1,
	EStateTreeExternalDataRequirement_MAX    = 2,
};

// Enum StateTreeModule.EStateTreePropertyUsage
// NumValues: 0x0006
enum class EStateTreePropertyUsage : uint8
{
	Invalid                                  = 0,
	Context                                  = 1,
	Input                                    = 2,
	Parameter                                = 3,
	Output                                   = 4,
	EStateTreePropertyUsage_MAX              = 5,
};

// ScriptStruct StateTreeModule.StateTreeAnyEnum
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeAnyEnum final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnum*                                  Enum;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeStateHandle
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeStateHandle final
{
public:
	uint16                                        Index;                                             // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeDataHandle
// 0x0006 (0x0006 - 0x0000)
struct FStateTreeDataHandle final
{
public:
	EStateTreeDataSourceType                      Source;                                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        Index;                                             // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FStateTreeStateHandle                  StateHandle;                                       // 0x0004(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateTreeModule.StateTreeExternalDataHandle
// 0x0006 (0x0006 - 0x0000)
struct FStateTreeExternalDataHandle final
{
public:
	struct FStateTreeDataHandle                   DataHandle;                                        // 0x0000(0x0006)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeExternalDataDesc
// 0x0018 (0x0018 - 0x0000)
struct FStateTreeExternalDataDesc final
{
public:
	class UStruct*                                Struct;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeExternalDataHandle           Handle;                                            // 0x000C(0x0006)(NoDestructor, NativeAccessSpecifierPublic)
	EStateTreeExternalDataRequirement             Requirement;                                       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeTransitionRequest
// 0x0018 (0x0018 - 0x0000)
struct FStateTreeTransitionRequest final
{
public:
	struct FStateTreeStateHandle                  SourceState;                                       // 0x0000(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateTree*                             SourceStateTree;                                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  SourceRootState;                                   // 0x0010(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  TargetState;                                       // 0x0012(0x0002)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x0014(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeActiveStates
// 0x0012 (0x0012 - 0x0000)
struct FStateTreeActiveStates final
{
public:
	struct FStateTreeStateHandle                  States[0x8];                                       // 0x0000(0x0002)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumStates;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x1];                                       // 0x0011(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeTransitionSource
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x02) FStateTreeTransitionSource final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeIndex16
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeIndex16 final
{
public:
	uint16                                        Value;                                             // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeSharedEvent
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FStateTreeSharedEvent final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeTransitionDelayedState
// 0x0028 (0x0028 - 0x0000)
struct FStateTreeTransitionDelayedState final
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      TransitionIndex;                                   // 0x0008(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeLeft;                                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeSharedEvent                  CapturedEvent;                                     // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	uint32                                        CapturedEventHash;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeExecutionFrame
// 0x0030 (0x0030 - 0x0000)
struct FStateTreeExecutionFrame final
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  RootState;                                         // 0x0008(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeActiveStates                 ActiveStates;                                      // 0x000A(0x0012)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      ExternalDataBaseIndex;                             // 0x001C(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      GlobalInstanceIndexBase;                           // 0x001E(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      ActiveInstanceIndexBase;                           // 0x0020(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeDataHandle                   StateParameterDataHandle;                          // 0x0022(0x0006)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeDataHandle                   GlobalParameterDataHandle;                         // 0x0028(0x0006)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x1];                                       // 0x002E(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bIsGlobalFrame : 1;                                // 0x002F(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
};

// ScriptStruct StateTreeModule.StateTreeExecutionState
// 0x0030 (0x0030 - 0x0000)
struct FStateTreeExecutionState final
{
public:
	TArray<struct FStateTreeExecutionFrame>       ActiveFrames;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FStateTreeTransitionDelayedState> DelayedTransitions;                              // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      EnterStateFailedFrameIndex;                        // 0x0020(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      EnterStateFailedTaskIndex;                         // 0x0022(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           LastTickStatus;                                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           TreeRunStatus;                                     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           RequestedStop;                                     // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeUpdatePhase                         CurrentPhase;                                      // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      CompletedFrameIndex;                               // 0x0028(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  CompletedStateHandle;                              // 0x002A(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        StateChangeCount;                                  // 0x002C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeTransitionResult
// 0x0040 (0x0040 - 0x0000)
struct FStateTreeTransitionResult final
{
public:
	TArray<struct FStateTreeExecutionFrame>       NextActiveFrames;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EStateTreeRunStatus                           CurrentRunStatus;                                  // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x1];                                       // 0x0021(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeStateHandle                  SourceState;                                       // 0x0022(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  TargetState;                                       // 0x0024(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  CurrentState;                                      // 0x0026(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeStateChangeType                     ChangeType;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x0029(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateTree*                             SourceStateTree;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  SourceRootState;                                   // 0x0038(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeIndex8
// 0x0001 (0x0001 - 0x0000)
struct FStateTreeIndex8 final
{
public:
	uint8                                         Value;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeNodeBase
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FStateTreeNodeBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      BindingsBatch;                                     // 0x000C(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      InstanceTemplateIndex;                             // 0x000E(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeDataHandle                   InstanceDataHandle;                                // 0x0010(0x0006)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreePropertyRef
// 0x0002 (0x0002 - 0x0000)
struct FStateTreePropertyRef
{
public:
	struct FStateTreeIndex16                      RefAccessIndex;                                    // 0x0000(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateTreeModule.StateTreeBlueprintPropertyRef
// 0x000E (0x0010 - 0x0002)
struct FStateTreeBlueprintPropertyRef final : public FStateTreePropertyRef
{
public:
	EStateTreePropertyRefType                     RefType;                                           // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsRefToArray : 1;                                 // 0x0003(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsOptional : 1;                                   // 0x0003(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                TypeObject;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateTreeModule.StateTreeReference
// 0x0028 (0x0028 - 0x0000)
struct FStateTreeReference final
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInstancedPropertyBag                  Parameters;                                        // 0x0008(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGuid>                          PropertyOverrides;                                 // 0x0018(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeInstanceData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FStateTreeInstanceData final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeRunParallelStateTreeTaskInstanceData
// 0x0040 (0x0040 - 0x0000)
struct FStateTreeRunParallelStateTreeTaskInstanceData final
{
public:
	struct FStateTreeReference                    StateTree;                                         // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FStateTreeInstanceData                 TreeInstanceData;                                  // 0x0028(0x0010)(Transient, NativeAccessSpecifierPublic)
	class UStateTree*                             RunningStateTree;                                  // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeTaskBase
// 0x0008 (0x0020 - 0x0018)
struct FStateTreeTaskBase : public FStateTreeNodeBase
{
public:
	uint8                                         BitPad_18_0 : 6;                                   // 0x0018(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bTaskEnabled : 1;                                  // 0x0018(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EStateTreeTransitionPriority                  TransitionHandlingPriority;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeTaskCommonBase
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeTaskCommonBase : public FStateTreeTaskBase
{
};

// ScriptStruct StateTreeModule.StateTreeRunParallelStateTreeTask
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeRunParallelStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	struct FGameplayTag                           StateTreeOverrideTag;                              // 0x0020(0x0004)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeConditionBase
// 0x0008 (0x0020 - 0x0018)
struct FStateTreeConditionBase : public FStateTreeNodeBase
{
public:
	EStateTreeConditionOperand                    Operand;                                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          DeltaIndent;                                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeConditionEvaluationMode             EvaluationMode;                                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeBlueprintConditionWrapper
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeBlueprintConditionWrapper final : public FStateTreeConditionBase
{
public:
	TSubclassOf<class UStateTreeConditionBlueprintBase> ConditionClass;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeEvaluatorBase
// 0x0000 (0x0018 - 0x0018)
struct FStateTreeEvaluatorBase : public FStateTreeNodeBase
{
};

// ScriptStruct StateTreeModule.StateTreeBlueprintEvaluatorWrapper
// 0x0008 (0x0020 - 0x0018)
struct FStateTreeBlueprintEvaluatorWrapper final : public FStateTreeEvaluatorBase
{
public:
	TSubclassOf<class UStateTreeEvaluatorBlueprintBase> EvaluatorClass;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeBlueprintTaskWrapper
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeBlueprintTaskWrapper final : public FStateTreeTaskBase
{
public:
	TSubclassOf<class UStateTreeTaskBlueprintBase> TaskClass;                                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeCompareIntConditionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FStateTreeCompareIntConditionInstanceData final
{
public:
	int32                                         Left;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Right;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeConditionCommonBase
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeConditionCommonBase : public FStateTreeConditionBase
{
};

// ScriptStruct StateTreeModule.StateTreeCompareIntCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeCompareIntCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericAICheck                               Operator;                                          // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeCompareFloatConditionInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeCompareFloatConditionInstanceData final
{
public:
	double                                        Left;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Right;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeCompareFloatCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeCompareFloatCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericAICheck                               Operator;                                          // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeCompareBoolConditionInstanceData
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeCompareBoolConditionInstanceData final
{
public:
	bool                                          bLeft;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRight;                                            // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeCompareBoolCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeCompareBoolCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeCompareEnumConditionInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FStateTreeCompareEnumConditionInstanceData final
{
public:
	struct FStateTreeAnyEnum                      Left;                                              // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeAnyEnum                      Right;                                             // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeCompareEnumCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeCompareEnumCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeCompareDistanceConditionInstanceData
// 0x0038 (0x0038 - 0x0000)
struct FStateTreeCompareDistanceConditionInstanceData final
{
public:
	struct FVector                                Source;                                            // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Target;                                            // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Distance;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeCompareDistanceCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeCompareDistanceCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericAICheck                               Operator;                                          // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeRandomConditionInstanceData
// 0x0004 (0x0004 - 0x0000)
struct FStateTreeRandomConditionInstanceData final
{
public:
	float                                         Threshold;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeRandomCondition
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeRandomCondition final : public FStateTreeConditionCommonBase
{
};

// ScriptStruct StateTreeModule.GameplayTagMatchConditionInstanceData
// 0x0028 (0x0028 - 0x0000)
struct FGameplayTagMatchConditionInstanceData final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTag                           tag;                                               // 0x0020(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.GameplayTagMatchCondition
// 0x0008 (0x0028 - 0x0020)
struct FGameplayTagMatchCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bExactMatch;                                       // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.GameplayTagContainerMatchConditionInstanceData
// 0x0040 (0x0040 - 0x0000)
struct FGameplayTagContainerMatchConditionInstanceData final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  OtherContainer;                                    // 0x0020(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.GameplayTagContainerMatchCondition
// 0x0008 (0x0028 - 0x0020)
struct FGameplayTagContainerMatchCondition final : public FStateTreeConditionCommonBase
{
public:
	EGameplayContainerMatchType                   MatchType;                                         // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0022(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.GameplayTagQueryConditionInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FGameplayTagQueryConditionInstanceData final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.GameplayTagQueryCondition
// 0x0050 (0x0070 - 0x0020)
struct FGameplayTagQueryCondition final : public FStateTreeConditionCommonBase
{
public:
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0020(0x0048)(Edit, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeObjectIsValidConditionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FStateTreeObjectIsValidConditionInstanceData final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeObjectIsValidCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeObjectIsValidCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeObjectEqualsConditionInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeObjectEqualsConditionInstanceData final
{
public:
	class UObject*                                Left;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Right;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeObjectEqualsCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeObjectEqualsCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeObjectIsChildOfClassConditionInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeObjectIsChildOfClassConditionInstanceData final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    Class;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeObjectIsChildOfClassCondition
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeObjectIsChildOfClassCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeEvaluatorCommonBase
// 0x0000 (0x0018 - 0x0018)
struct FStateTreeEvaluatorCommonBase final : public FStateTreeEvaluatorBase
{
};

// ScriptStruct StateTreeModule.StateTreeEvent
// 0x0020 (0x0020 - 0x0000)
struct FStateTreeEvent final
{
public:
	struct FGameplayTag                           tag;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       Payload;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   Origin;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreeEventQueue
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeEventQueue final
{
public:
	TArray<struct FStateTreeSharedEvent>          SharedEvents;                                      // 0x0000(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeInstanceObjectWrapper
// 0x0008 (0x0008 - 0x0000)
struct FStateTreeInstanceObjectWrapper final
{
public:
	class UObject*                                InstanceObject;                                    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeTemporaryInstanceData
// 0x0028 (0x0028 - 0x0000)
struct FStateTreeTemporaryInstanceData final
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  RootState;                                         // 0x0008(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeDataHandle                   DataHandle;                                        // 0x000A(0x0006)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      OwnerNodeIndex;                                    // 0x0010(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       Instance;                                          // 0x0018(0x0010)(NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreeInstanceStorage
// 0x0090 (0x0090 - 0x0000)
struct FStateTreeInstanceStorage final
{
public:
	struct FInstancedStructContainer              InstanceStructs;                                   // 0x0000(0x0010)(Protected, NativeAccessSpecifierProtected)
	struct FStateTreeExecutionState               ExecutionState;                                    // 0x0010(0x0030)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FStateTreeTemporaryInstanceData> TemporaryInstances;                               // 0x0040(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStateTreeTransitionRequest>    TransitionRequests;                                // 0x0068(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FInstancedPropertyBag                  GlobalParameters;                                  // 0x0078(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FRandomStream                          RandomStream;                                      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, Protected, NativeAccessSpecifierProtected)
};

// ScriptStruct StateTreeModule.StateTreeBindableStructDesc
// 0x0018 (0x0018 - 0x0000)
struct FStateTreeBindableStructDesc final
{
public:
	class UStruct*                                Struct;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeDataHandle                   DataHandle;                                        // 0x000C(0x0006)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeBindableStructSource                DataSource;                                        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct StateTreeModule.StateTreePropertyPathSegment
// 0x0010 (0x0010 - 0x0000)
struct FStateTreePropertyPathSegment final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ArrayIndex;                                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStruct*                                InstanceStruct;                                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateTreeModule.StateTreePropertyPath
// 0x0010 (0x0010 - 0x0000)
struct FStateTreePropertyPath final
{
public:
	TArray<struct FStateTreePropertyPathSegment>  Segments;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};

// ScriptStruct StateTreeModule.StateTreeEditorPropertyPath
// 0x0020 (0x0020 - 0x0000)
struct FStateTreeEditorPropertyPath final
{
public:
	struct FGuid                                  StructID;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Path;                                              // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct StateTreeModule.StateTreePropertyPathBinding
// 0x0028 (0x0028 - 0x0000)
struct FStateTreePropertyPathBinding final
{
public:
