#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};

// PropertyBag Transient.PropertyBag_8f0e77833d213e8b
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_8f0e77833d213e8b final
{
public:
	float                                         LineHeightPercentage;                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_7801e6fe017d399d
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_7801e6fe017d399d final
{
public:
	float                                         LineHeightPercentage;                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_cfe9d954cb995654
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_cfe9d954cb995654 final
{
public:
	float                                         Size;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// PropertyBag Transient.PropertyBag_a53109f348e6aa9f
// 0x0064 (0x0064 - 0x0000)
struct FPropertyBag_a53109f348e6aa9f final
{
public:
	struct FSlateColor                            Color_Idle;                                        // 0x0000(0x0014)(Edit)
	struct FSlateColor                            Color_Hovered;                                     // 0x0014(0x0014)(Edit)
	struct FSlateColor                            Color_Focused;                                     // 0x0028(0x0014)(Edit)
	struct FSlateColor                            Color_Pressed;                                     // 0x003C(0x0014)(Edit)
	struct FSlateColor                            Color_Disabled;                                    // 0x0050(0x0014)(Edit)
};

// PropertyBag Transient.PropertyBag_e75da291926c96a0
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_e75da291926c96a0 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// PropertyBag Transient.PropertyBag_a5a7f1c98af654b0
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_a5a7f1c98af654b0 final
{
public:
	class USoundBase*                             MTXOfferTileIntroWhoosh;                           // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ShopRowWhooshIn;                                   // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_cfe61572a358cbe2
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_cfe61572a358cbe2 final
{
public:
	float                                         Size;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_908fb62a7c4964fe
// 0x0190 (0x0190 - 0x0000)
struct FPropertyBag_908fb62a7c4964fe final
{
public:
	float                                         BarThickness;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs;                                            // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_0;                                          // 0x0005(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_1;                                          // 0x0006(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_2;                                          // 0x0007(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ResourceObject;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                ImageSize;                                         // 0x0010(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_3;                                          // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Margin;                                            // 0x001C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateBrushDrawType                           DrawAs_4;                                          // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_5;                                          // 0x002D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_6;                                          // 0x002E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_7;                                          // 0x002F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ResourceObject_0;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                ImageSize_0;                                       // 0x0038(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TintColor;                                         // 0x0040(0x0014)(Edit)
	ESlateBrushDrawType                           DrawAs_8;                                          // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0xB];                                       // 0x0055(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CornerRadii;                                       // 0x0060(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width;                                             // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SpecifiedColor;                                    // 0x0084(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushRoundingType                       RoundingType;                                      // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ResourceObject_1;                                  // 0x0098(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                ImageSize_1;                                       // 0x00A0(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TintColor_0;                                       // 0x00A8(0x0014)(Edit)
	ESlateBrushDrawType                           DrawAs_9;                                          // 0x00BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CornerRadii_0;                                     // 0x00C0(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SpecifiedColor_0;                                  // 0x00E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width_0;                                           // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushRoundingType                       RoundingType_0;                                    // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ResourceObject_2;                                  // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                ImageSize_2;                                       // 0x0100(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SpecifiedColor_1;                                  // 0x0108(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_10;                                         // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CornerRadii_1;                                     // 0x0120(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SpecifiedColor_2;                                  // 0x0140(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width_1;                                           // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushRoundingType                       RoundingType_1;                                    // 0x0154(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScrollbarThickness;                                // 0x0158(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ResourceObject_3;                                  // 0x0168(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                ImageSize_3;                                       // 0x0170(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_11;                                         // 0x0178(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Margin_0;                                          // 0x017C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// PropertyBag Transient.PropertyBag_b1b499168ffb7d7
// 0x0014 (0x0014 - 0x0000)
struct FPropertyBag_b1b499168ffb7d7 final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         LineHeightPercentage;                              // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_dd1cc1bab5a770a0
// 0x0078 (0x0078 - 0x0000)
struct FPropertyBag_dd1cc1bab5a770a0 final
{
public:
	class UObject*                                FontMaterial;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontMaterial_0;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BackgroundMaterial;                                // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BorderMaterial;                                    // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         GamepadPromptFont;                                 // 0x0020(0x0058)(Edit, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_bac761764a5568a
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_bac761764a5568a final
{
public:
	struct FMargin                                Margin;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// PropertyBag Transient.PropertyBag_6196eb57307c918d
// 0x0160 (0x0160 - 0x0000)
struct FPropertyBag_6196eb57307c918d final
{
public:
	ESlateBrushDrawType                           DrawAs;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ResourceObject;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                ImageSize;                                         // 0x0010(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_0;                                          // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Margin;                                            // 0x001C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateBrushDrawType                           DrawAs_1;                                          // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_2;                                          // 0x002D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_3;                                          // 0x002E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_4;                                          // 0x002F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ResourceObject_0;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                ImageSize_0;                                       // 0x0038(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SpecifiedColor;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_5;                                          // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CornerRadii;                                       // 0x0060(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SpecifiedColor_0;                                  // 0x0080(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width;                                             // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushRoundingType                       RoundingType;                                      // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ResourceObject_1;                                  // 0x0098(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                ImageSize_1;                                       // 0x00A0(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SpecifiedColor_1;                                  // 0x00A8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_6;                                          // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CornerRadii_0;                                     // 0x00C0(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SpecifiedColor_2;                                  // 0x00E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width_0;                                           // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushRoundingType                       RoundingType_0;                                    // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ResourceObject_2;                                  // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                ImageSize_2;                                       // 0x0100(0x0008)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SpecifiedColor_3;                                  // 0x0108(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           DrawAs_7;                                          // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CornerRadii_1;                                     // 0x0120(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SpecifiedColor_4;                                  // 0x0140(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width_1;                                           // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushRoundingType                       RoundingType_1;                                    // 0x0154(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Thickness;                                         // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_bbaa1d6c1aa000da
// 0x0020 (0x0020 - 0x0000)
struct FPropertyBag_bbaa1d6c1aa000da final
{
public:
	class USoundBase*                             BannerAppearSound;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BannerAwaySound;                                   // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             IntroSound;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OutroSound;                                        // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_52cdbd8836075b0e
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_52cdbd8836075b0e final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_f9decbb383ee01e6
// 0x0020 (0x0020 - 0x0000)
struct FPropertyBag_f9decbb383ee01e6 final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          TextTransformPolicy;                               // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LineHeightPercentage;                              // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyLineHeightToBottomLine;                       // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_279b9caf3922d854
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_279b9caf3922d854 final
{
public:
	float                                         Size;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_2a0f7515d431ed43
// 0x000C (0x000C - 0x0000)
struct FPropertyBag_2a0f7515d431ed43 final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_33c61b12ebdd8de3
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_33c61b12ebdd8de3 final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_c7017bcd90622c00
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_c7017bcd90622c00 final
{
public:
	class USoundBase*                             LockerCategoryWhooshSound;                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_6edfa49387bf9c33
// 0x000C (0x000C - 0x0000)
struct FPropertyBag_6edfa49387bf9c33 final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextTransformPolicy                          TextTransformPolicy;                               // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_b079d4f01ab54d86
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_b079d4f01ab54d86 final
{
public:
	float                                         Size;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_6eada125bbea474f
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBag_6eada125bbea474f final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_69408224ed793c28
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_69408224ed793c28 final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_7adb9606f8e526a4
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_7adb9606f8e526a4 final
{
public:
	class UObject*                                FontMaterial;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_cbfef6a04d554568
// 0x0058 (0x0058 - 0x0000)
struct FPropertyBag_cbfef6a04d554568 final
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0000(0x0058)(Edit, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_ebb2906bfd7922de
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_ebb2906bfd7922de final
{
public:
	class USoundBase*                             MatchMakingSucceededSound;                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_a3461ded1a84f547
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_a3461ded1a84f547 final
{
public:
	float                                         SecondsPriorToTransSound;                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             TransitionSound;                                   // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_9cec9c17bb87b081
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBag_9cec9c17bb87b081 final
{
public:
	class USoundBase*                             ShopIntroWhooshSound;                              // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ContentWhoosh_RetractSound;                        // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ShopRowWhooshIn;                                   // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_c43c3b56374d9111
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_c43c3b56374d9111 final
{
public:
	class USoundBase*                             ErrorWindowAppearSound;                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ErrorWindowAwaySound;                              // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_d806b843863dcd30
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_d806b843863dcd30 final
{
public:
	class USoundBase*                             PressedSound;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_efe965c8be194ec8
// 0x0028 (0x0028 - 0x0000)
struct FPropertyBag_efe965c8be194ec8 final
{
public:
	class USoundBase*                             HoveredSound;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldPressedSound;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldSound;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldReleasedSound;                                 // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldCompletedSound;                                // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_86577bd9000f05cd
// 0x0030 (0x0030 - 0x0000)
struct FPropertyBag_86577bd9000f05cd final
{
public:
	struct FSlateSound                            PressedSlateSoundOverride;                         // 0x0000(0x0018)(Edit, NoDestructor)
	struct FSlateSound                            HoveredSlateSoundOverride;                         // 0x0018(0x0018)(Edit, NoDestructor)
};

// PropertyBag Transient.PropertyBag_f64c1a68b6105e11
// 0x0020 (0x0020 - 0x0000)
struct FPropertyBag_f64c1a68b6105e11 final
{
public:
	class USoundBase*                             HoldPressedSound;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldSound;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldReleasedSound;                                 // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldCompletedSound;                                // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_72fd665d3f68b07c
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBag_72fd665d3f68b07c final
{
public:
	class USoundBase*                             ContextButtonHoverSound;                           // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ContextButtonClickedSound;                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BlockOutlineHoverSound;                            // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_8b9afa04dc7a3c0c
// 0x0220 (0x0220 - 0x0000)
struct FPropertyBag_8b9afa04dc7a3c0c final
{
public:
	struct FSlateFontInfo                         LargePrimaryFont;                                  // 0x0000(0x0058)(Edit, HasGetValueTypeHash)
	struct FSlateFontInfo                         LargeSecondaryFont;                                // 0x0058(0x0058)(Edit, HasGetValueTypeHash)
	struct FSlateFontInfo                         MediumPrimaryFont;                                 // 0x00B0(0x0058)(Edit, HasGetValueTypeHash)
	struct FSlateFontInfo                         MeduimSecondaryFont;                               // 0x0108(0x0058)(Edit, HasGetValueTypeHash)
	struct FSlateFontInfo                         SmallPrimaryFont;                                  // 0x0160(0x0058)(Edit, HasGetValueTypeHash)
	struct FSlateFontInfo                         SmallSecondaryFont;                                // 0x01B8(0x0058)(Edit, HasGetValueTypeHash)
	int32                                         LargeHeight;                                       // 0x0210(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MediumHeight;                                      // 0x0214(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SmallHeight;                                       // 0x0218(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_f11665f018bd0609
// 0x0048 (0x0048 - 0x0000)
struct FPropertyBag_f11665f018bd0609 final
{
public:
	class USoundBase*                             PressedSound;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoveredSound;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateSound                            PressedSlateSoundOverride;                         // 0x0010(0x0018)(Edit, NoDestructor)
	struct FSlateSound                            HoveredSlateSoundOverride;                         // 0x0028(0x0018)(Edit, NoDestructor)
	class USoundBase*                             ActivityBrowserTileHoverSound;                     // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_354801bcde28708e
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_354801bcde28708e final
{
public:
	float                                         Size;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_d17f7786299a6f9e
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_d17f7786299a6f9e final
{
public:
	class USoundBase*                             PressedSound;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoveredSound;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_70d9c763705fc40f
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_70d9c763705fc40f final
{
public:
	class FName                                   TypefaceFontName;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName_0;                                // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_1cce674fe25dc15b
// 0x0030 (0x0030 - 0x0000)
struct FPropertyBag_1cce674fe25dc15b final
{
public:
	class USoundBase*                             HoveredSound;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PressedSound;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldPressedSound;                                  // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldSound;                                         // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldReleasedSound;                                 // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldCompletedSound;                                // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_d4a93dcd9d94e3c3
// 0x0058 (0x0058 - 0x0000)
struct FPropertyBag_d4a93dcd9d94e3c3 final
{
public:
	struct FSlateFontInfo                         GamepadPromptFont;                                 // 0x0000(0x0058)(Edit, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_91536017c27f74fc
// 0x0008 (0x0008 - 0x0000)
struct FPropertyBag_91536017c27f74fc final
{
public:
	class USoundBase*                             ListEntryHoveredSound;                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_b7db99ece0b8d573
// 0x0030 (0x0030 - 0x0000)
struct FPropertyBag_b7db99ece0b8d573 final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontObject_0;                                      // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName_0;                                // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size_0;                                            // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing_0;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount_0;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_8d90f8e42a8ecbc5
// 0x0030 (0x0030 - 0x0000)
struct FPropertyBag_8d90f8e42a8ecbc5 final
{
public:
	struct FSlateSound                            PressedSlateSoundOverride;                         // 0x0000(0x0018)(Edit, NoDestructor)
	struct FSlateSound                            HoveredSlateSoundOverride;                         // 0x0018(0x0018)(Edit, NoDestructor)
};

// PropertyBag Transient.PropertyBag_e81cdbe9e538429c
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBag_e81cdbe9e538429c final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TypefaceFontName;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LetterSpacing;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkewAmount;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_68e6b7cbb08b1d16
// 0x0020 (0x0020 - 0x0000)
struct FPropertyBag_68e6b7cbb08b1d16 final
{
public:
	class USoundBase*                             Press_Sound;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             HoldSound;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ReleaseSound;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CompleteSound;                                     // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_cc55e69601af3c63
// 0x0040 (0x0040 - 0x0000)
struct FPropertyBag_cc55e69601af3c63 final
{
public:
	class UObject*                                FontMaterial;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontMaterial_0;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontMaterial_1;                                    // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontMaterial_2;                                    // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontMaterial_3;                                    // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                FontMaterial_4;                                    // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BackgroundMaterial;                                // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BorderMaterial;                                    // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_5ab39ce639414404
// 0x0040 (0x0040 - 0x0000)
struct FPropertyBag_5ab39ce639414404 final
{
public:
	class UMaterialInstance*                      RegularFontMaterial;                               // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularSecondaryFontMaterial;                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularBackgroundMaterial;                         // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      RegularOutlineMaterial;                            // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietFontMaterial;                                 // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietSecondaryFontMaterial;                        // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietBackgroundMaterial;                           // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      QuietOutlineMaterial;                              // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

