#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultingCodeRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "VaultingCodeRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function VaultingCodeRuntime.FortMovementMode_ExtLogicHurdle.BP_DestroyProp
// 0x0008 (0x0008 - 0x0000)
struct FortMovementMode_ExtLogicHurdle_BP_DestroyProp final
{
public:
	class ABuildingProp*                          BuildPropToDestroy;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.FortMovementMode_ExtLogicHurdle.BP_GetAnimationMontageInformation
// 0x0048 (0x0048 - 0x0000)
struct FortMovementMode_ExtLogicHurdle_BP_GetAnimationMontageInformation final
{
public:
	struct FSynchedActionInfo                     SynchedActionInfo;                                 // 0x0000(0x0030)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EHurdleType                                   Type;                                              // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNarrowOpening;                                  // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCrouched;                                       // 0x0032(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           AnimMontage;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartSectionName;                                  // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MontageMiddleSectionName;                          // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.BP_CreateHurdleHighlight
// 0x0130 (0x0130 - 0x0000)
struct HurdleComponent_BP_CreateHurdleHighlight final
{
public:
	struct FHurdleTargetingData                   TargetingData;                                     // 0x0000(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.BP_ShowHurdleInputPrompt
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_BP_ShowHurdleInputPrompt final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.HandleNavLinkMoveStarted
// 0x0018 (0x0018 - 0x0000)
struct HurdleComponent_HandleNavLinkMoveStarted final
{
public:
	struct FVector                                LinkEndPoint;                                      // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.HandleOwnerJumpInput
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_HandleOwnerJumpInput final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.OnPlayerStatePawnSet
// 0x0018 (0x0018 - 0x0000)
struct HurdleComponent_OnPlayerStatePawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.RegisterMutatorUpdatedDelegate
// 0x0008 (0x0008 - 0x0000)
struct HurdleComponent_RegisterMutatorUpdatedDelegate final
{
public:
	class APawn*                                  AffectedPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.BP_CanStartHurdle
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_BP_CanStartHurdle final
{
public:
	bool                                          OutCanStartHurdle;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.BP_IsTacticalSprinting
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_BP_IsTacticalSprinting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.BP_UseAutoHurdle
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_BP_UseAutoHurdle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.GetHurdleHighlightTransform
// 0x0060 (0x0060 - 0x0000)
struct HurdleComponent_GetHurdleHighlightTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.IsUsingGamepad
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_IsUsingGamepad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleComponent.ShouldShowHurdleIndicator
// 0x0001 (0x0001 - 0x0000)
struct HurdleComponent_ShouldShowHurdleIndicator final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VaultingCodeRuntime.HurdleLibrary.PerformHurdleTargeting
// 0x0208 (0x0208 - 0x0000)
struct HurdleLibrary_PerformHurdleTargeting final
{
public:
	const class ACharacter*                       Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHurdleInputConfigCache                HurdleInputConfig;                                 // 0x0008(0x00A8)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FHurdleTargetingData                   OutTargetingData;                                  // 0x00B0(0x0130)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bIsAutoHurdle;                                     // 0x01E0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OverrideAimDirection;                              // 0x01E8(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0200(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

