#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleCosmeticsRuntime

#include "Basic.hpp"

#include "VehicleBouncyChassisRuntime_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "AssembledMeshSystem_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "VehicleCosmeticsRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Class VehicleCosmeticsRuntime.FortItemVehiclePreviewActor
// 0x00A0 (0x05D0 - 0x0530)
class AFortItemVehiclePreviewActor final : public AFortItemPreviewMultiAngleActor
{
public:
	uint8                                         Pad_530[0x8];                                      // 0x0530(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       ZoomedOutVehicleCameraComponent;                   // 0x0538(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedInVehicleCameraComponent;                    // 0x0540(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedOutWheelCameraComponent;                     // 0x0548(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedInWheelCameraComponent;                      // 0x0550(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedOutBoostCameraComponent;                     // 0x0558(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedInBoostCameraComponent;                      // 0x0560(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedOutDriftTrailCameraComponent;                // 0x0568(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ZoomedInDriftTrailCameraComponent;                 // 0x0570(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseSingleConfiguredCamera;                        // 0x0578(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrameSettingHeightOffset;                          // 0x057C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FrameSettingExpansionOffset;                       // 0x0580(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortUICameraFrameTargetBoundingBehavior      FrameSettingBoundingBehavior;                      // 0x0584(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_585[0x3];                                      // 0x0585(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FrameSettingZoomInBoundsScale;                     // 0x0588(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideTargetBounds;                             // 0x058C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortUICameraFrameTargetBounds         OverrideTargetBounds;                              // 0x0590(0x0020)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UChildActorComponent*                   PreviewVehicleActorComponent;                      // 0x05B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AVehicleCosmeticsPreviewVehicle*        PreviewVehicleActor;                               // 0x05B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C0[0x10];                                     // 0x05C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleBoostFinished();
	void HandleBoostStarted();
	void HandleDriftTrailStarted();
	void HandleVehicleCosmeticsReady();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemVehiclePreviewActor">();
	}
	static class AFortItemVehiclePreviewActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortItemVehiclePreviewActor>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsAIControllerInterface
// 0x0000 (0x0000 - 0x0000)
class IVehicleCosmeticsAIControllerInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsAIControllerInterface">();
	}
	static class IVehicleCosmeticsAIControllerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IVehicleCosmeticsAIControllerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsPreviewConfigs
// 0x00A0 (0x00D0 - 0x0030)
class UVehicleCosmeticsPreviewConfigs final : public UPrimaryDataAsset
{
public:
	TSoftClassPtr<class UClass>                   VehiclePreviewActorClass;                          // 0x0030(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultBoostPreviewActorClass;                     // 0x0050(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultTrailPreviewActorClass;                     // 0x0070(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   VehiclePreviewPrefabAssetClass;                    // 0x0090(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFortVehicleCosmeticsItemDefinition_Body> VehiclePreviewDefaultPreviewBody; // 0x00B0(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsPreviewConfigs">();
	}
	static class UVehicleCosmeticsPreviewConfigs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsPreviewConfigs>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsPreviewVehicle
// 0x00C0 (0x2170 - 0x20B0)
class AVehicleCosmeticsPreviewVehicle final : public AFortAthenaSKVehicle
{
public:
	uint8                                         Pad_20B0[0xC0];                                    // 0x20B0(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnBoostApplied();
	void HandleOnDriftTrailApplied();
	void HandleOnVehicleCosmeticsFinished();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsPreviewVehicle">();
	}
	static class AVehicleCosmeticsPreviewVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVehicleCosmeticsPreviewVehicle>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UVehicleCosmeticsBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetMaxSignificanceLOD_BoostFX();
	static int32 GetMaxSignificanceLOD_FrontWheelDriftFX();
	static int32 GetMaxSignificanceLOD_Generic();
	static int32 GetMaxSignificanceLOD_RearWheelDriftFX();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsBlueprintLibrary">();
	}
	static class UVehicleCosmeticsBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsBlueprintLibrary>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition
// 0x0090 (0x0598 - 0x0508)
class UFortVehicleCosmeticsItemDefinition : public UAthenaCosmeticItemDefinition
{
public:
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVehicleCosmeticsItemDefinition> VehicleCosmeticsItemDef;                   // 0x0510(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UVehicleCosmeticsItemDefinition>> VehicleCosmeticsItemDefForTiers;   // 0x0530(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ItemTypeTag;                                       // 0x0540(0x0004)(Edit, DisableEditOnInstance, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVehicleCosmeticsPreviewConfigs> PreviewConfig;                             // 0x0548(0x0020)(Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FVehicleCosmeticsRestrictionDefinition> RestrictionDefinitions;                    // 0x0568(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortVehicleCosmeticsItemDefinition> ItemPreviewVehicleBody;                // 0x0578(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition">();
	}
	static class UFortVehicleCosmeticsItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_Body
// 0x0000 (0x0598 - 0x0598)
class UFortVehicleCosmeticsItemDefinition_Body final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_Body">();
	}
	static class UFortVehicleCosmeticsItemDefinition_Body* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_Body>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_Booster
// 0x0000 (0x0598 - 0x0598)
class UFortVehicleCosmeticsItemDefinition_Booster final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_Booster">();
	}
	static class UFortVehicleCosmeticsItemDefinition_Booster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_Booster>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_DriftTrail
// 0x0000 (0x0598 - 0x0598)
class UFortVehicleCosmeticsItemDefinition_DriftTrail final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_DriftTrail">();
	}
	static class UFortVehicleCosmeticsItemDefinition_DriftTrail* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_DriftTrail>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_EngineAudio
// 0x0000 (0x0598 - 0x0598)
class UFortVehicleCosmeticsItemDefinition_EngineAudio final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_EngineAudio">();
	}
	static class UFortVehicleCosmeticsItemDefinition_EngineAudio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_EngineAudio>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_Skin
// 0x0000 (0x0598 - 0x0598)
class UFortVehicleCosmeticsItemDefinition_Skin final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_Skin">();
	}
	static class UFortVehicleCosmeticsItemDefinition_Skin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_Skin>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsItemDefinition_Wheel
// 0x0000 (0x0598 - 0x0598)
class UFortVehicleCosmeticsItemDefinition_Wheel final : public UFortVehicleCosmeticsItemDefinition
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsItemDefinition_Wheel">();
	}
	static class UFortVehicleCosmeticsItemDefinition_Wheel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsItemDefinition_Wheel>();
	}
};

// Class VehicleCosmeticsRuntime.FortVehicleCosmeticsVariantTokenType
// 0x0000 (0x01D0 - 0x01D0)
class UFortVehicleCosmeticsVariantTokenType final : public UFortVariantTokenType
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleCosmeticsVariantTokenType">();
	}
	static class UFortVehicleCosmeticsVariantTokenType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleCosmeticsVariantTokenType>();
	}
};

// Class VehicleCosmeticsRuntime.PlayerCustomizableObjectCacheComponent
// 0x0050 (0x00F0 - 0x00A0)
class UPlayerCustomizableObjectCacheComponent final : public UPlayerStateComponent
{
public:
	TMap<TSubclassOf<class AFortAthenaVehicle>, class UCustomizableObjectInstance*> CachedInstanceMap; // 0x00A0(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void OnPlayerDisconnected(class AFortPlayerStateAthena* PlayerState, bool bIsDisconnected);
	void OnSeamlessTravelStart(class UWorld* CurrentWorld, const class FString& LevelName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayerCustomizableObjectCacheComponent">();
	}
	static class UPlayerCustomizableObjectCacheComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerCustomizableObjectCacheComponent>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsActorSpawnLogic
// 0x0000 (0x0028 - 0x0028)
class UVehicleCosmeticsActorSpawnLogic : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsActorSpawnLogic">();
	}
	static class UVehicleCosmeticsActorSpawnLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsActorSpawnLogic>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsActorSpawnLogic_AttachTo
// 0x0008 (0x0030 - 0x0028)
class UVehicleCosmeticsActorSpawnLogic_AttachTo final : public UVehicleCosmeticsActorSpawnLogic
{
public:
	class FName                                   AttachSocket;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsActorSpawnLogic_AttachTo">();
	}
	static class UVehicleCosmeticsActorSpawnLogic_AttachTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsActorSpawnLogic_AttachTo>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsActorSpawnLogic_AttachToEach
// 0x0010 (0x0038 - 0x0028)
class UVehicleCosmeticsActorSpawnLogic_AttachToEach final : public UVehicleCosmeticsActorSpawnLogic
{
public:
	TArray<class FName>                           AttachSockets;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsActorSpawnLogic_AttachToEach">();
	}
	static class UVehicleCosmeticsActorSpawnLogic_AttachToEach* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsActorSpawnLogic_AttachToEach>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsActorSpawnLogic_Booster
// 0x0000 (0x0028 - 0x0028)
class UVehicleCosmeticsActorSpawnLogic_Booster final : public UVehicleCosmeticsActorSpawnLogic
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsActorSpawnLogic_Booster">();
	}
	static class UVehicleCosmeticsActorSpawnLogic_Booster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsActorSpawnLogic_Booster>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsActor
// 0x0048 (0x02D8 - 0x0290)
class AVehicleCosmeticsActor final : public AActor
{
public:
	class UVehicleCosmeticsActorSpawnLogic*       SpawnLogic;                                        // 0x0290(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AVehicleCosmeticsActor>> CosmeticDependencies;                          // 0x0298(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TScriptInterface<class IFortVehicleInterface> VehicleInterface;                                  // 0x02A8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IVehicleCosmeticsInterface> VehicleCosmeticsInterface;                    // 0x02B8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActorComponent*                        VehicleCosmeticComponent;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SocketAttachedTo;                                  // 0x02D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BoosterPortsNum;                                   // 0x02D4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ApplyCosmetic();
	void BoostFinished();
	void BoostStarted();
	void BP_OnBonusSpeedActivated();
	void BP_OnBonusSpeedDeactivated();
	void BP_OnBoostFinished();
	void BP_OnBoostStarted();
	void BP_OnColorReady(class FName Color, const struct FVehicleCosmeticsAdditionalParameterInfos& AdditionalInfo);
	void BP_OnCosmeticApplied();
	void BP_OnDeactivated();
	void BP_OnDriftFinished();
	void BP_OnDriftStarted();
	void BP_OnVehicleLanded(float LandingForced, bool bLandedKickflip);
	void BP_OnVehicleWheelsLeftGround();
	void ColorReady(const class FName InColor, const struct FVehicleCosmeticsAdditionalParameterInfos& InInfo);
	void DriftFinished();
	void DriftStarted();

	class USkeletalMeshComponent* GetBodyMeshComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsActor">();
	}
	static class AVehicleCosmeticsActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVehicleCosmeticsActor>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsAnimInstance
// 0x0050 (0x08B0 - 0x0860)
#pragma pack(push, 0x1)
class alignas(0x10) UVehicleCosmeticsAnimInstance : public UVehicleBouncyChassisAnimInstance
{
public:
	bool                                          bDriftBoostActive;                                 // 0x0858(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnderthrustActive;                                // 0x0859(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDriftActive;                                      // 0x085A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKickflipActive;                                   // 0x085B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJumpActive;                                       // 0x085C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTurboActive;                                      // 0x085D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartlineBoostActive;                             // 0x085E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDraftingActive;                                   // 0x085F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasTireMod;                                       // 0x0860(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoosting;                                       // 0x0861(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldWheelSpinForPreview;                        // 0x0862(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_863[0x1];                                      // 0x0863(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreviewWheelSpinVelocity;                          // 0x0864(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviewWheelSpin;                                  // 0x0868(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterTransition_IdleToBoostStart;              // 0x086C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterTransition_BoostStartToBoostLoop;         // 0x086D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterTransition_BoostLoopToBoostEnd;           // 0x086E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEnterTransition_BoostEndToIdle;                // 0x086F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCachedAnimRelevancyData               BoostStartToBoostLoopRelevancyData;                // 0x0870(0x0014)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FCachedAnimRelevancyData               BoostEndToIdleRelevancyData;                       // 0x0884(0x0014)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                         BoostStartToBoostLoopRemainingTimeThreshold;       // 0x0898(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostEndToIdleRemainingTimeThreshold;              // 0x089C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A0[0x8];                                      // 0x08A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsAnimInstance">();
	}
	static class UVehicleCosmeticsAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsAnimInstance>();
	}
};
#pragma pack(pop)

// Class VehicleCosmeticsRuntime.VehicleCosmeticsAssembledMeshUserComponent
// 0x0648 (0x0730 - 0x00E8)
class UVehicleCosmeticsAssembledMeshUserComponent final : public UAssembledMeshUserComponent
{
public:
	uint8                                         Pad_E8[0x28];                                      // 0x00E8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizableObjectInstance*            TempCustomizableObjectInstance;                    // 0x0110(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x20];                                     // 0x0118(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReplicatedCosmeticLoadoutData         OwningCosmeticLoadoutData;                         // 0x0138(0x0018)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVehicleCosmeticsDefaultLoadoutInfo> DefaultLoadoutInfos;                          // 0x0160(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_170[0x1];                                      // 0x0170(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bVehicleCosmeticsEnabled;                          // 0x0171(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVehicleCosmeticsActor*>         SpawnedCosmeticActors_Body;                        // 0x0178(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class AVehicleCosmeticsActor*>         SpawnedCosmeticActors_Wheel;                       // 0x0188(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class AVehicleCosmeticsActor*>         SpawnedCosmeticActors_Booster;                     // 0x0198(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class AVehicleCosmeticsActor*>         SpawnedCosmeticActors_DriftTrail;                  // 0x01A8(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class AVehicleCosmeticsActor*>         SpawnedCosmeticActors_Skin;                        // 0x01B8(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, bool>                       HasBeenCustomizedMap;                              // 0x01C8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<int32, class UAssembledMeshSchema*>      MeshPartDataMap;                                   // 0x0218(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_268[0x380];                                    // 0x0268(0x0380)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTirePopReplacementInfo>        TirePopReplacementInfos;                           // 0x05E8(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      LoadoutSlotTagQuery;                               // 0x05F8(0x0048)(Transient, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class AVehicleCosmeticsActor* CosmeticActor)> OnCosmeticActorSpawned; // 0x0640(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CustomizationEnabled;                              // 0x0650(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CosmeticsLoadoutFXLoopTime;                        // 0x0678(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(TSoftObjectPtr<class UVehicleCosmeticsItemDefinition_EngineAudio> Item)> OnEngineAudioUpdated; // 0x06A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVehicleCosmeticsFailureInfo& ReasonInfo)> OnVehicleCosmeticsFailed; // 0x06B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C0[0x70];                                     // 0x06C0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientOnCosmeticsFailed(const struct FVehicleCosmeticsFailureInfo& ReasonInfo);
	void HandleBeginVehicleCosmetics();
	void HandleBodyPhysicsChanges();
	void HandleBoostFinished();
	void HandleBoostStarted();
	void HandleDriftFinished();
	void HandleDriftStarted();
	void HandleForceApplyVehicleCosmetics(const struct FSpawnerInfoForcedCosmetics& ForcedCosmetics);
	void HandleModApplied(const class AFortAthenaVehicle* Vehicle, const struct FGameplayTag& ModTag);
	void HandleOnExplode(const class AController* LastDamageInstigator, class AFortAthenaVehicle* Vehicle);
	void HandleTirePopped(const int32 TireIndex);
	void HandleTireRepaired(const int32 TireIndex);
	void OnRep_OwningCosmeticsLoadoutData();
	void SetVehicleCosmeticsEnabled(const bool bEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsAssembledMeshUserComponent">();
	}
	static class UVehicleCosmeticsAssembledMeshUserComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsAssembledMeshUserComponent>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager
// 0x0000 (0x0028 - 0x0028)
class UVehicleCosmeticsCheatManager final : public UChildCheatManager
{
public:
	void ClearVehicleCosmeticsLoadout();
	void CustomizeAllVehicles(const class FString& BodyName, const class FString& WheelName, const class FString& SkinName, const class FString& BoosterName, const class FString& DriftTrailName, const class FString& BodyPainted, const class FString& WheelPainted, const class FString& BodyColor, const class FString& SkinColor, const class FString& SkinPainted, const class FString& BoosterPainted, const class FString& DriftTrailPainted);
	void CustomizeVehicle(const class FString& BodyName, const class FString& WheelName, const class FString& SkinName, const class FString& BoosterName, const class FString& DriftTrailName, const class FString& BodyPainted, const class FString& WheelPainted, const class FString& BodyColor, const class FString& SkinColor, const class FString& SkinPainted, const class FString& BoosterPainted, const class FString& DriftTrailPainted);
	void DumpVehicleCosmeticsLoadedAssetCheatNames();
	void DumpVehicleCosmeticsLoadedAssetSkeletalMeshes();
	void DumpVehicleCosmeticsLoadedAssetTemplateIds();
	void DumpVehicleCosmeticsLoadedAssetVariantTokenTypes();
	void DumpVehicleCosmeticsPhysicsShapeCollision();
	void GrantVehicleCosmeticsLoadedAssets(const class FString& CheatName);
	void SetVehicleActiveArchetype(const class FName VehicleArchetypeTagName);
	void SetVehicleCosmetics_BoosterPainted(const class FString& PaintName);
	void SetVehicleCosmetics_DriftTrailPainted(const class FString& PaintName);
	void SetVehicleCosmeticsLoadout(const class FString& BodyName, const class FString& WheelName, const class FString& SkinName, const class FString& BoosterName, const class FString& DriftTrailName, const class FString& BodyPainted, const class FString& WheelPainted, const class FString& BodyColor, const class FString& SkinColor, const class FString& SkinPainted, const class FString& BoosterPainted, const class FString& DriftTrailPainted);
	void SetVehicleCosmeticsLoadout_Body(const class FString& BodyName);
	void SetVehicleCosmeticsLoadout_BodyColor(const class FString& BodyColor, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_BodyPainted(const class FString& PaintName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_Booster(const class FString& BoosterName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_BoosterPainted(const class FString& PaintName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_DriftTrail(const class FString& DriftSmokeName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_DriftTrailPainted(const class FString& PaintName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_Skin(const class FString& SkinName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_SkinColor(const class FString& SkinColor, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_SkinPainted(const class FString& PaintName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_Wheel(const class FString& WheelName, class FName VehicleArchetypeTagName);
	void SetVehicleCosmeticsLoadout_WheelPainted(const class FString& PaintName, class FName VehicleArchetypeTagName);
	void VehicleCosmeticsDriftEnabled(const bool bNewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsCheatManager">();
	}
	static class UVehicleCosmeticsCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsCheatManager>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsInterface
// 0x0000 (0x0000 - 0x0000)
class IVehicleCosmeticsInterface final
{
public:
	class FName GetBodyItemName() const;
	float GetDraftingAppliedBonusSpeed() const;
	class FName GetDriftTrailItemName() const;
	class FName GetTurboItemName() const;
	class FName GetWheelItemName() const;
	bool IsDriftBoostActive() const;
	bool IsDrifting() const;
	bool IsJumpAbilityActive() const;
	bool IsKickflipActive() const;
	bool IsStartlineBoostActive() const;
	bool IsTurboActive() const;
	bool IsUnderthrustActive() const;
	bool ShouldWheelSpinForPreview() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsInterface">();
	}
	static class IVehicleCosmeticsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IVehicleCosmeticsInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsItemDefinition
// 0x0020 (0x0200 - 0x01E0)
class UVehicleCosmeticsItemDefinition : public UAssembledMeshSchema
{
public:
	TArray<TSoftClassPtr<class UClass>>           CosmeticAttachments;                               // 0x01E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class FString>                         CheatNames;                                        // 0x01F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsItemDefinition">();
	}
	static class UVehicleCosmeticsItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsItemDefinition>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsItemDefinition_Body
// 0x01D8 (0x03D8 - 0x0200)
class UVehicleCosmeticsItemDefinition_Body final : public UVehicleCosmeticsItemDefinition
{
public:
	uint8                                         Pad_200[0x8];                                      // 0x0200(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleCosmeticsCustomizableObjectIntInfo BodyGroup;                                     // 0x0208(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   SkinDataTableParameterName;                        // 0x0210(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BodyColorParameterName;                            // 0x0214(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SkinColorParameterName;                            // 0x0218(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PaintedDataTableParameterName;                     // 0x021C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FVehicleCosmeticsAdditionalParameterInfos> AdditionalVariantInfos; // 0x0220(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVehicleCosmeticsBodyPhysicsQueryInfo> PhysicsQueryInfos;                          // 0x0270(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVehicleCosmeticsAnimInfo>      AnimInfos;                                         // 0x0280(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USkeleton>               WheelAttachSkeletonReference;                      // 0x0290(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FWheelAttachInfo>               WheelAttachInfos;                                  // 0x02B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class USkeleton>               BoosterAttachSkeletonReference;                    // 0x02C0(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FBoosterAttachInfo>             BoosterAttachInfos;                                // 0x02E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UVehicleCosmeticsItemDefinition_Wheel> DefaultWheelItemDef;                 // 0x02F0(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    DefaultSkinRow;                                    // 0x0310(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UVehicleCosmeticsItemDefinition_EngineAudio> AudioData;                     // 0x0320(0x0020)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      BodyTypeTagQuery;                                  // 0x0340(0x0048)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TagsToAdd;                                         // 0x0388(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TagsToRemove;                                      // 0x03A8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVehicleCosmeticsBodyWindowQueryInfo> WindowQueryInfos;                            // 0x03C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsItemDefinition_Body">();
	}
	static class UVehicleCosmeticsItemDefinition_Body* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsItemDefinition_Body>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsItemDefinition_Booster
// 0x0050 (0x0250 - 0x0200)
class UVehicleCosmeticsItemDefinition_Booster final : public UVehicleCosmeticsItemDefinition
{
public:
	TMap<struct FGameplayTag, struct FVehicleCosmeticsAdditionalParameterInfos> AdditionalVariantInfos; // 0x0200(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsItemDefinition_Booster">();
	}
	static class UVehicleCosmeticsItemDefinition_Booster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsItemDefinition_Booster>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsItemDefinition_DriftTrail
// 0x0050 (0x0250 - 0x0200)
class UVehicleCosmeticsItemDefinition_DriftTrail final : public UVehicleCosmeticsItemDefinition
{
public:
	TMap<struct FGameplayTag, struct FVehicleCosmeticsAdditionalParameterInfos> AdditionalVariantInfos; // 0x0200(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsItemDefinition_DriftTrail">();
	}
	static class UVehicleCosmeticsItemDefinition_DriftTrail* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsItemDefinition_DriftTrail>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleAudioCosmeticData
// 0x0060 (0x0090 - 0x0030)
class UVehicleAudioCosmeticData final : public UDataAsset
{
public:
	TSoftObjectPtr<class USoundBase>              EngineSound;                                       // 0x0030(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundBase>              EngineSound_LowSpec;                               // 0x0050(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             EngineIgnitionSound;                               // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             EngineOffSound;                                    // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             HornSound;                                         // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIP;                                             // 0x0088(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanIgnoreLoadManagement;                          // 0x0089(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreShifting;                                   // 0x008A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreExhaustPops;                                // 0x008B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TSoftObjectPtr<class USoundBase> GetEngineSound(bool bHighSpec);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleAudioCosmeticData">();
	}
	static class UVehicleAudioCosmeticData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleAudioCosmeticData>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsItemDefinition_EngineAudio
// 0x0020 (0x0220 - 0x0200)
class UVehicleCosmeticsItemDefinition_EngineAudio final : public UVehicleCosmeticsItemDefinition
{
public:
	TSoftObjectPtr<class UVehicleAudioCosmeticData> Data;                                            // 0x0200(0x0020)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsItemDefinition_EngineAudio">();
	}
	static class UVehicleCosmeticsItemDefinition_EngineAudio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsItemDefinition_EngineAudio>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsItemDefinition_Skin
// 0x0040 (0x0240 - 0x0200)
class UVehicleCosmeticsItemDefinition_Skin final : public UVehicleCosmeticsItemDefinition
{
public:
	bool                                          bLockColor;                                        // 0x0200(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LockedBodyColor;                                   // 0x0204(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           LockedSkinColor;                                   // 0x0214(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PaintedDataTableParameterName;                     // 0x0224(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PaintedEnumParameterName;                          // 0x0228(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVehicleCosmeticsAdditionalParameterInfos> AdditionalSkinInfos;                    // 0x0230(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsItemDefinition_Skin">();
	}
	static class UVehicleCosmeticsItemDefinition_Skin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsItemDefinition_Skin>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsItemDefinition_Wheel
// 0x0098 (0x0298 - 0x0200)
class UVehicleCosmeticsItemDefinition_Wheel final : public UVehicleCosmeticsItemDefinition
{
public:
	uint8                                         Pad_200[0x8];                                      // 0x0200(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleCosmeticsCustomizableObjectIntInfo WheelGroup;                                    // 0x0208(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   PaintedDataTableParameterName;                     // 0x0210(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       WheelTirePoppedInfo;                               // 0x0218(0x0010)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FVehicleCosmeticsAdditionalParameterInfos> AdditionalVariantInfos; // 0x0228(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVehicleCosmeticsAnimInfo>      AnimInfos;                                         // 0x0278(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FWheelSetupInfo>                WheelSetupInfos;                                   // 0x0288(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsItemDefinition_Wheel">();
	}
	static class UVehicleCosmeticsItemDefinition_Wheel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsItemDefinition_Wheel>();
	}
};

// Class VehicleCosmeticsRuntime.VehicleCosmeticsWheelAnimInstance
// 0x0030 (0x08E0 - 0x08B0)
class UVehicleCosmeticsWheelAnimInstance final : public UVehicleCosmeticsAnimInstance
{
public:
	struct FRotator                               SpinnerSpin;                                       // 0x08A8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C0[0x20];                                     // 0x08C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleCosmeticsWheelAnimInstance">();
	}
	static class UVehicleCosmeticsWheelAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleCosmeticsWheelAnimInstance>();
	}
};

}

