#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleCosmeticsAudioRuntime

#include "Basic.hpp"

#include "VehicleCosmeticsRuntime_structs.hpp"
#include "VehicleCosmeticsAudioRuntime_structs.hpp"


namespace SDK::Params
{

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.BP_OnAudioDataLoaded
// 0x0008 (0x0008 - 0x0000)
struct VehicleCosmeticsAudioController_BP_OnAudioDataLoaded final
{
public:
	const class USoundBase*                       Sound;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.BP_OnCosmeticsFailed
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsAudioController_BP_OnCosmeticsFailed final
{
public:
	struct FVehicleCosmeticsFailureInfo           ReasonInfo;                                        // 0x0000(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.BP_OnUpdateAudioData
// 0x0008 (0x0008 - 0x0000)
struct VehicleCosmeticsAudioController_BP_OnUpdateAudioData final
{
public:
	const class UVehicleAudioCosmeticData*        CosmeticData;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.HandleEngineAudioCosmeticsFailed
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsAudioController_HandleEngineAudioCosmeticsFailed final
{
public:
	struct FVehicleCosmeticsFailureInfo           ReasonInfo;                                        // 0x0000(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.HandleEngineAudioItemUpdated
// 0x0020 (0x0020 - 0x0000)
struct VehicleCosmeticsAudioController_HandleEngineAudioItemUpdated final
{
public:
	TSoftObjectPtr<class UVehicleCosmeticsItemDefinition_EngineAudio> EngineAudioItem;               // 0x0000(0x0020)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioController.UpdateAudioData
// 0x0008 (0x0008 - 0x0000)
struct VehicleCosmeticsAudioController_UpdateAudioData final
{
public:
	const class UVehicleAudioCosmeticData*        CosmeticData;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioManager.RegisterVehicleWithAsset
// 0x0038 (0x0038 - 0x0000)
struct VehicleCosmeticsAudioManager_RegisterVehicleWithAsset final
{
public:
	struct FVehicleCosmeticLoadRequestInfo        RequestInfo;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioManager.SetVehicleBudgetOverride
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsAudioManager_SetVehicleBudgetOverride final
{
public:
	int32                                         NewBudget;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsAudioRuntime.VehicleCosmeticsAudioManager.UnregisterVehcle
// 0x0010 (0x0010 - 0x0000)
struct VehicleCosmeticsAudioManager_UnregisterVehcle final
{
public:
	TScriptInterface<class IVehicleCosmeticsAudioUser> Vehicle;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

