#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleCosmeticsRuntime

#include "Basic.hpp"

#include "VehicleCosmeticsRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function VehicleCosmeticsRuntime.VehicleCosmeticsBlueprintLibrary.GetMaxSignificanceLOD_BoostFX
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsBlueprintLibrary_GetMaxSignificanceLOD_BoostFX final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsBlueprintLibrary.GetMaxSignificanceLOD_FrontWheelDriftFX
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsBlueprintLibrary_GetMaxSignificanceLOD_FrontWheelDriftFX final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsBlueprintLibrary.GetMaxSignificanceLOD_Generic
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsBlueprintLibrary_GetMaxSignificanceLOD_Generic final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsBlueprintLibrary.GetMaxSignificanceLOD_RearWheelDriftFX
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsBlueprintLibrary_GetMaxSignificanceLOD_RearWheelDriftFX final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.PlayerCustomizableObjectCacheComponent.OnPlayerDisconnected
// 0x0010 (0x0010 - 0x0000)
struct PlayerCustomizableObjectCacheComponent_OnPlayerDisconnected final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDisconnected;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.PlayerCustomizableObjectCacheComponent.OnSeamlessTravelStart
// 0x0018 (0x0018 - 0x0000)
struct PlayerCustomizableObjectCacheComponent_OnSeamlessTravelStart final
{
public:
	class UWorld*                                 CurrentWorld;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsActor.BP_OnColorReady
// 0x0038 (0x0038 - 0x0000)
struct VehicleCosmeticsActor_BP_OnColorReady final
{
public:
	class FName                                   Color;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleCosmeticsAdditionalParameterInfos AdditionalInfo;                                 // 0x0008(0x0030)(Parm, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsActor.BP_OnVehicleLanded
// 0x0008 (0x0008 - 0x0000)
struct VehicleCosmeticsActor_BP_OnVehicleLanded final
{
public:
	float                                         LandingForced;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandedKickflip;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsActor.ColorReady
// 0x0038 (0x0038 - 0x0000)
struct VehicleCosmeticsActor_ColorReady final
{
public:
	class FName                                   InColor;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleCosmeticsAdditionalParameterInfos InInfo;                                         // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsActor.GetBodyMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct VehicleCosmeticsActor_GetBodyMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsAssembledMeshUserComponent.ClientOnCosmeticsFailed
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsAssembledMeshUserComponent_ClientOnCosmeticsFailed final
{
public:
	struct FVehicleCosmeticsFailureInfo           ReasonInfo;                                        // 0x0000(0x0001)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsAssembledMeshUserComponent.HandleForceApplyVehicleCosmetics
// 0x0048 (0x0048 - 0x0000)
struct VehicleCosmeticsAssembledMeshUserComponent_HandleForceApplyVehicleCosmetics final
{
public:
	struct FSpawnerInfoForcedCosmetics            ForcedCosmetics;                                   // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsAssembledMeshUserComponent.HandleModApplied
// 0x0010 (0x0010 - 0x0000)
struct VehicleCosmeticsAssembledMeshUserComponent_HandleModApplied final
{
public:
	const class AFortAthenaVehicle*               Vehicle;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ModTag;                                            // 0x0008(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsAssembledMeshUserComponent.HandleOnExplode
// 0x0010 (0x0010 - 0x0000)
struct VehicleCosmeticsAssembledMeshUserComponent_HandleOnExplode final
{
public:
	const class AController*                      LastDamageInstigator;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsAssembledMeshUserComponent.HandleTirePopped
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsAssembledMeshUserComponent_HandleTirePopped final
{
public:
	int32                                         TireIndex;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsAssembledMeshUserComponent.HandleTireRepaired
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsAssembledMeshUserComponent_HandleTireRepaired final
{
public:
	int32                                         TireIndex;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsAssembledMeshUserComponent.SetVehicleCosmeticsEnabled
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsAssembledMeshUserComponent_SetVehicleCosmeticsEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.CustomizeAllVehicles
// 0x00C0 (0x00C0 - 0x0000)
struct VehicleCosmeticsCheatManager_CustomizeAllVehicles final
{
public:
	class FString                                 BodyName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WheelName;                                         // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinName;                                          // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoosterName;                                       // 0x0030(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DriftTrailName;                                    // 0x0040(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BodyPainted;                                       // 0x0050(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WheelPainted;                                      // 0x0060(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BodyColor;                                         // 0x0070(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinColor;                                         // 0x0080(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinPainted;                                       // 0x0090(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoosterPainted;                                    // 0x00A0(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DriftTrailPainted;                                 // 0x00B0(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.CustomizeVehicle
// 0x00C0 (0x00C0 - 0x0000)
struct VehicleCosmeticsCheatManager_CustomizeVehicle final
{
public:
	class FString                                 BodyName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WheelName;                                         // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinName;                                          // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoosterName;                                       // 0x0030(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DriftTrailName;                                    // 0x0040(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BodyPainted;                                       // 0x0050(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WheelPainted;                                      // 0x0060(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BodyColor;                                         // 0x0070(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinColor;                                         // 0x0080(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinPainted;                                       // 0x0090(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoosterPainted;                                    // 0x00A0(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DriftTrailPainted;                                 // 0x00B0(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.GrantVehicleCosmeticsLoadedAssets
// 0x0010 (0x0010 - 0x0000)
struct VehicleCosmeticsCheatManager_GrantVehicleCosmeticsLoadedAssets final
{
public:
	class FString                                 CheatName;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleActiveArchetype
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleActiveArchetype final
{
public:
	class FName                                   VehicleArchetypeTagName;                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmetics_BoosterPainted
// 0x0010 (0x0010 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmetics_BoosterPainted final
{
public:
	class FString                                 PaintName;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmetics_DriftTrailPainted
// 0x0010 (0x0010 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmetics_DriftTrailPainted final
{
public:
	class FString                                 PaintName;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout
// 0x00C0 (0x00C0 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout final
{
public:
	class FString                                 BodyName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WheelName;                                         // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinName;                                          // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoosterName;                                       // 0x0030(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DriftTrailName;                                    // 0x0040(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BodyPainted;                                       // 0x0050(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WheelPainted;                                      // 0x0060(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BodyColor;                                         // 0x0070(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinColor;                                         // 0x0080(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinPainted;                                       // 0x0090(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoosterPainted;                                    // 0x00A0(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DriftTrailPainted;                                 // 0x00B0(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_Body
// 0x0010 (0x0010 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_Body final
{
public:
	class FString                                 BodyName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_BodyColor
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_BodyColor final
{
public:
	class FString                                 BodyColor;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_BodyPainted
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_BodyPainted final
{
public:
	class FString                                 PaintName;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_Booster
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_Booster final
{
public:
	class FString                                 BoosterName;                                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_BoosterPainted
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_BoosterPainted final
{
public:
	class FString                                 PaintName;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_DriftTrail
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_DriftTrail final
{
public:
	class FString                                 DriftSmokeName;                                    // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_DriftTrailPainted
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_DriftTrailPainted final
{
public:
	class FString                                 PaintName;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_Skin
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_Skin final
{
public:
	class FString                                 SkinName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_SkinColor
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_SkinColor final
{
public:
	class FString                                 SkinColor;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_SkinPainted
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_SkinPainted final
{
public:
	class FString                                 PaintName;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_Wheel
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_Wheel final
{
public:
	class FString                                 WheelName;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.SetVehicleCosmeticsLoadout_WheelPainted
// 0x0018 (0x0018 - 0x0000)
struct VehicleCosmeticsCheatManager_SetVehicleCosmeticsLoadout_WheelPainted final
{
public:
	class FString                                 PaintName;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VehicleArchetypeTagName;                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsCheatManager.VehicleCosmeticsDriftEnabled
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsCheatManager_VehicleCosmeticsDriftEnabled final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.GetBodyItemName
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsInterface_GetBodyItemName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.GetDraftingAppliedBonusSpeed
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsInterface_GetDraftingAppliedBonusSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.GetDriftTrailItemName
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsInterface_GetDriftTrailItemName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.GetTurboItemName
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsInterface_GetTurboItemName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.GetWheelItemName
// 0x0004 (0x0004 - 0x0000)
struct VehicleCosmeticsInterface_GetWheelItemName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.IsDriftBoostActive
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsInterface_IsDriftBoostActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.IsDrifting
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsInterface_IsDrifting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.IsJumpAbilityActive
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsInterface_IsJumpAbilityActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.IsKickflipActive
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsInterface_IsKickflipActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.IsStartlineBoostActive
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsInterface_IsStartlineBoostActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.IsTurboActive
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsInterface_IsTurboActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.IsUnderthrustActive
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsInterface_IsUnderthrustActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleCosmeticsInterface.ShouldWheelSpinForPreview
// 0x0001 (0x0001 - 0x0000)
struct VehicleCosmeticsInterface_ShouldWheelSpinForPreview final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleCosmeticsRuntime.VehicleAudioCosmeticData.GetEngineSound
// 0x0028 (0x0028 - 0x0000)
struct VehicleAudioCosmeticData_GetEngineSound final
{
public:
	bool                                          bHighSpec;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USoundBase>              ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

