#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleAudioRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "VehicleAudioRuntime_structs.hpp"
#include "Engine_classes.hpp"
#include "AudioMotorSim_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameFeatures_classes.hpp"


namespace SDK
{

// Class VehicleAudioRuntime.FortMotorSimComponent_PatternPlayer
// 0x00C0 (0x0170 - 0x00B0)
class UFortMotorSimComponent_PatternPlayer final : public UAudioMotorSimComponent
{
public:
	float                                         PatternResetCooldown;                              // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMotorSimPatternState              DriftState;                                        // 0x00B8(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FFortMotorSimPatternState              AirState;                                          // 0x00E8(0x0030)(Edit, NativeAccessSpecifierPublic)
	struct FFortMotorSimPatternState              StartlineState;                                    // 0x0118(0x0030)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x20];                                     // 0x0148(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           CurrentCurve;                                      // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMotorSimComponent_PatternPlayer">();
	}
	static class UFortMotorSimComponent_PatternPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMotorSimComponent_PatternPlayer>();
	}
};

// Class VehicleAudioRuntime.FortMotorSimComponent_SurfaceModifier
// 0x0070 (0x0120 - 0x00B0)
class UFortMotorSimComponent_SurfaceModifier final : public UAudioMotorSimComponent
{
public:
	TMap<class FName, class UCurveFloat*>         Surfaces;                                          // 0x00B0(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FVector2f                              ThrottleRange;                                     // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         OnsetInterpTime;                                   // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CurrentCurve;                                      // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetSurface(class FName NewSurface);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortMotorSimComponent_SurfaceModifier">();
	}
	static class UFortMotorSimComponent_SurfaceModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMotorSimComponent_SurfaceModifier>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerInterface
// 0x0000 (0x0000 - 0x0000)
class IFortVehicleAudioControllerInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerInterface">();
	}
	static class IFortVehicleAudioControllerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortVehicleAudioControllerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerSubsystem
// 0x00C8 (0x00F8 - 0x0030)
class UFortVehicleAudioControllerSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FFortVehicleAudioControllerUpdateGroup> RegisteredUpdateGroups; // 0x0058(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UObject>, struct FGameplayTag> ControllerClassToUpdateGroupMappings;      // 0x00A8(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerSubsystem">();
	}
	static class UFortVehicleAudioControllerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAudioControllerSubsystem>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerUpdater
// 0x0000 (0x0028 - 0x0028)
class UFortVehicleAudioControllerUpdater : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerUpdater">();
	}
	static class UFortVehicleAudioControllerUpdater* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAudioControllerUpdater>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerUpdater_UpdateAll
// 0x0000 (0x0028 - 0x0028)
class UFortVehicleAudioControllerUpdater_UpdateAll final : public UFortVehicleAudioControllerUpdater
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerUpdater_UpdateAll">();
	}
	static class UFortVehicleAudioControllerUpdater_UpdateAll* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAudioControllerUpdater_UpdateAll>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerUpdater_Proximity
// 0x0020 (0x0048 - 0x0028)
class UFortVehicleAudioControllerUpdater_Proximity final : public UFortVehicleAudioControllerUpdater
{
public:
	class USoundAttenuation*                      SoundAttenuation;                                  // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdateRadius;                                      // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UpdateCap;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerUpdater_Proximity">();
	}
	static class UFortVehicleAudioControllerUpdater_Proximity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAudioControllerUpdater_Proximity>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioControllerUpdater_Significance
// 0x0008 (0x0030 - 0x0028)
class UFortVehicleAudioControllerUpdater_Significance final : public UFortVehicleAudioControllerUpdater
{
public:
	int32                                         LODBucketCap;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioControllerUpdater_Significance">();
	}
	static class UFortVehicleAudioControllerUpdater_Significance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleAudioControllerUpdater_Significance>();
	}
};

// Class VehicleAudioRuntime.FortVehicleSoundComponent
// 0x0018 (0x00B8 - 0x00A0)
class UFortVehicleSoundComponent : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AFortVehicleAudioController> AudioController;                               // 0x00A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Init();
	void Pause();
	void Resume();
	void Shutdown();
	void Update(float DeltaSeconds);

	class AFortVehicleAudioController* GetAudioController() const;
	class UAudioParameterComponent* GetAudioParameterComponent() const;
	class UAudioComponent* GetEngineAudioComponent() const;
	class UFortLayeredAudioComponent* GetLayeredAudioComponent() const;
	class UAudioMotorModelComponent* GetMotorModelComponent() const;
	const class UFortPhysicsVehicleConfigs* GetPhysicsVehicleConfigs() const;
	class UREVComponent* GetREVComponent() const;
	class USceneComponent* GetRootComponent() const;
	bool GetUseMetasounds() const;
	class AFortAthenaVehicle* GetVehicleActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSoundComponent">();
	}
	static class UFortVehicleSoundComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSoundComponent>();
	}
};

// Class VehicleAudioRuntime.FortVehicleSoundComponent_DamageState
// 0x0038 (0x00F0 - 0x00B8)
class UFortVehicleSoundComponent_DamageState final : public UFortVehicleSoundComponent
{
public:
	struct FFortVehicleSoundComponent_DamageStateContext Context;                                    // 0x00B8(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleVehicleExploded(const class AController* LastDamageInstigator, class AFortAthenaVehicle* Vehicle);
	void OnExplode(const class AController* LastDamageInstigator, class AFortAthenaVehicle* Vehicle);
	void OnScrapingSidesOrTop(const bool bIsScraping);
	void OnScrapingSidesOrTopChanged(const bool bNewScrapingState);
	void OnSleepStateChanged(const bool bIsAwake);
	void OnVehicleSleepStateChanged(const bool bIsAwake);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSoundComponent_DamageState">();
	}
	static class UFortVehicleSoundComponent_DamageState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSoundComponent_DamageState>();
	}
};

// Class VehicleAudioRuntime.GameFeatureAction_RegisterVehicleAudioClassMappings
// 0x0060 (0x0088 - 0x0028)
class UGameFeatureAction_RegisterVehicleAudioClassMappings final : public UGameFeatureAction
{
public:
	TMap<struct FSoftClassPath, struct FGameplayTag> ClassMappings;                                  // 0x0028(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterVehicleAudioClassMappings">();
	}
	static class UGameFeatureAction_RegisterVehicleAudioClassMappings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterVehicleAudioClassMappings>();
	}
};

// Class VehicleAudioRuntime.GameFeatureAction_RegisterVehicleAudioControllerGroup
// 0x0060 (0x0088 - 0x0028)
class UGameFeatureAction_RegisterVehicleAudioControllerGroup final : public UGameFeatureAction
{
public:
	TMap<struct FGameplayTag, class UFortVehicleAudioControllerUpdater*> GroupsToRegister;           // 0x0028(0x0050)(Edit, ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameFeatureAction_RegisterVehicleAudioControllerGroup">();
	}
	static class UGameFeatureAction_RegisterVehicleAudioControllerGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_RegisterVehicleAudioControllerGroup>();
	}
};

// Class VehicleAudioRuntime.VehicleAudioLifecycleInterface
// 0x0000 (0x0000 - 0x0000)
class IVehicleAudioLifecycleInterface final
{
public:
	void OnInit();
	void OnShutdown();
	void OnUpdate(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleAudioLifecycleInterface">();
	}
	static class IVehicleAudioLifecycleInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IVehicleAudioLifecycleInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class VehicleAudioRuntime.VehicleSoundSurfaceData
// 0x0018 (0x0048 - 0x0030)
class UVehicleSoundSurfaceData final : public UPrimaryDataAsset
{
public:
	class UDataTable*                             SurfaceData;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             DefaultSound;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             InAirSound;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class USoundBase* BP_GetSoundForSurface(const EPhysicalSurface InSurface, const bool InAir);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VehicleSoundSurfaceData">();
	}
	static class UVehicleSoundSurfaceData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleSoundSurfaceData>();
	}
};

// Class VehicleAudioRuntime.FortVehicleAudioController
// 0x00F0 (0x0380 - 0x0290)
class AFortVehicleAudioController : public AActor
{
public:
	uint8                                         Pad_290[0x18];                                     // 0x0290(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortVehicleSoundData*                  VehicleSoundData;                                  // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B0[0x4];                                      // 0x02B0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSignificance;                               // 0x02B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bListenerInRange;                                  // 0x02B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceUpdatePastListenerRange;                     // 0x02B9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRedlineAllowed;                                   // 0x02BA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BB[0x1];                                      // 0x02BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JitterTime;                                        // 0x02BC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaVehicle*                     VehicleBase;                                       // 0x02C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortPhysicsVehicleConfigs*             PhysicsVehicleConfigs;                             // 0x02C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TOptional<struct FVehicleCollisionAudioConfig> VehicleCollisionAudioConfig;                      // 0x02D0(0x0058)(ZeroConstructor, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UFortLayeredAudioComponent*             LayeredAudioComponent;                             // 0x0328(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioParameterComponent*               AudioParameterComponent;                           // 0x0330(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioMotorModelComponent*              AudioMotorModelComponent;                          // 0x0338(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UREVComponent*                          REVComponent;                                      // 0x0340(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                        EngineComponent;                                   // 0x0348(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UFortVehicleSoundComponent*>     VehicleSoundComponents;                            // 0x0350(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UMetasoundGeneratorHandle*              MetasoundGeneratorHandle;                          // 0x0360(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMetasoundParameterPack*                CachedParameterPack;                               // 0x0368(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_370[0x10];                                     // 0x0370(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindVehicleCollisionEvent(const struct FVehicleCollisionAudioConfig& CollisionAudioConfig);
	void CacheJitterTime();
	void OnVehicleRecentlyHit(class AFortAthenaVehicle* SelfActor, class AActor* HitActor, const struct FVector& HitLocation, const struct FVector& NormalImpulse);
	void OnVehicleSleepStateChanged(const bool bIsAwake);
	void SetLayeredAudioComponent(class UFortLayeredAudioComponent* InComponent);
	void SetMetasoundGeneratorHandle(class UAudioComponent* TargetComponent);
	void SetRedlineActive(bool bEnabled);
	void SetVehicle(class AFortAthenaVehicle* InVehicle);
	void UpdateCollisionAudioNative(class AActor* CollisionTarget, const struct FVector& HitLocation);
	void UpdateMotorModelNative(float DeltaSeconds);
	void UpdateSpringCompressionNative(class UFortCollisionAudioComponent* TargetCollisionAudioComponent, const struct FVector& VehicleLocationOffset, bool* OutResult, float* OutMagnitude);

	class UAudioMotorModelComponent* GetAudioMotorModelComponent() const;
	class UAudioParameterComponent* GetAudioParameterComponent() const;
	float GetBrakingNative() const;
	class UAudioComponent* GetEngineAudioComponent() const;
	float GetJitterTime() const;
	class UFortLayeredAudioComponent* GetLayeredAudioComponent() const;
	const class UFortPhysicsVehicleConfigs* GetPhysicsVehicleConfigs() const;
	bool GetRedlineActive() const;
	class UREVComponent* GetREVComponent() const;
	bool GetShouldUpdate() const;
	float GetThrottleNative() const;
	class AFortAthenaVehicle* GetVehicleActor() const;
	bool IsNativizationEnabled() const;
	bool UseMetasounds() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleAudioController">();
	}
	static class AFortVehicleAudioController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortVehicleAudioController>();
	}
};

// Class VehicleAudioRuntime.FortVehicleSoundComponent_Speed
// 0x0040 (0x00F8 - 0x00B8)
class UFortVehicleSoundComponent_Speed final : public UFortVehicleSoundComponent
{
public:
	struct FFortAudioFloatParameter               Speed;                                             // 0x00B8(0x0038)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReversedChanged(bool bReversing);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSoundComponent_Speed">();
	}
	static class UFortVehicleSoundComponent_Speed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSoundComponent_Speed>();
	}
};

// Class VehicleAudioRuntime.FortVehicleSoundComponent_Surface
// 0x01B0 (0x0268 - 0x00B8)
class UFortVehicleSoundComponent_Surface final : public UFortVehicleSoundComponent
{
public:
	struct FFortVehicleSoundComponent_SurfaceContext Context;                                        // 0x00B8(0x0170)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UAudioComponent*                        NativeSurfaceAudio1;                               // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        NativeSurfaceAudio2;                               // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        BrakeAudioComponent;                               // 0x0238(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_240[0x28];                                     // 0x0240(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float CalculateSurfaceSpeed(const float& CurrentSurfaceSpeed, const float& InterpSpeed, const float& DeltaTime, float* OutNormalizedVehicleSpeed);
	float GetSpringCompressionMagnitude(const float MaxSpringCompMultiplier);
	void OnBrakingChanged(bool bNewState);
	void OnEnteredWaterBody(class AFortAthenaVehicle* Vehicle, class AFortWaterBodyActor* WaterBody);
	void OnExitWaterBody(class AFortAthenaVehicle* Vehicle, class AFortWaterBodyActor* WaterBody);
	void OnInAirChanged(bool bNewState);
	void OnSkiddingChanged(bool bNewState);
	void OnSpringCompression_Native();
	void OnSurfaceChanged(EPhysicalSurface NewSurface);
	void SetFloatParameterOnAudioComponents(class FName InName, float InFloat);
	void SetTriggerParameterOnAudioComponents(class FName InName);
	void UpdateSurface_Native(const float& DeltaTime);
	float UpdateSurfaceMagnitude_Native(const float& SurfaceMagnitudeParam, const float& SpringCompressionMagnitude, const float& SpringCompMagnitudeAttack, const float& SpringCompMagnitudeRelease, const float& DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSoundComponent_Surface">();
	}
	static class UFortVehicleSoundComponent_Surface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSoundComponent_Surface>();
	}
};

// Class VehicleAudioRuntime.FortVehicleSoundData
// 0x0040 (0x0070 - 0x0030)
class UFortVehicleSoundData final : public UDataAsset
{
public:
	TArray<class UFortVehicleSoundComponent*>     SoundComponents;                                   // 0x0030(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bUpdateDataFromController;                         // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxBrakeThreshold;                                 // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThrottleMultiplier;                                // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SurfaceFrictionModifier;                           // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MotorFrictionModifier;                             // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              FrictionJitter;                                    // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanShiftOverride;                                 // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortVehicleSoundData">();
	}
	static class UFortVehicleSoundData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVehicleSoundData>();
	}
};

}

