#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleAudioRuntime

#include "Basic.hpp"

#include "VehicleAudioRuntime_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function VehicleAudioRuntime.FortMotorSimComponent_SurfaceModifier.SetSurface
// 0x0004 (0x0004 - 0x0000)
struct FortMotorSimComponent_SurfaceModifier_SetSurface final
{
public:
	class FName                                   NewSurface;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.Update
// 0x0004 (0x0004 - 0x0000)
struct FortVehicleSoundComponent_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.GetAudioController
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_GetAudioController final
{
public:
	class AFortVehicleAudioController*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.GetAudioParameterComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_GetAudioParameterComponent final
{
public:
	class UAudioParameterComponent*               ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.GetEngineAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_GetEngineAudioComponent final
{
public:
	class UAudioComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.GetLayeredAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_GetLayeredAudioComponent final
{
public:
	class UFortLayeredAudioComponent*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.GetMotorModelComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_GetMotorModelComponent final
{
public:
	class UAudioMotorModelComponent*              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.GetPhysicsVehicleConfigs
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_GetPhysicsVehicleConfigs final
{
public:
	const class UFortPhysicsVehicleConfigs*       ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.GetREVComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_GetREVComponent final
{
public:
	class UREVComponent*                          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.GetRootComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_GetRootComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.GetUseMetasounds
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleSoundComponent_GetUseMetasounds final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent.GetVehicleActor
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_GetVehicleActor final
{
public:
	class AFortAthenaVehicle*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_DamageState.HandleVehicleExploded
// 0x0010 (0x0010 - 0x0000)
struct FortVehicleSoundComponent_DamageState_HandleVehicleExploded final
{
public:
	const class AController*                      LastDamageInstigator;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_DamageState.OnExplode
// 0x0010 (0x0010 - 0x0000)
struct FortVehicleSoundComponent_DamageState_OnExplode final
{
public:
	const class AController*                      LastDamageInstigator;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_DamageState.OnScrapingSidesOrTop
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleSoundComponent_DamageState_OnScrapingSidesOrTop final
{
public:
	bool                                          bIsScraping;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_DamageState.OnScrapingSidesOrTopChanged
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleSoundComponent_DamageState_OnScrapingSidesOrTopChanged final
{
public:
	bool                                          bNewScrapingState;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_DamageState.OnSleepStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleSoundComponent_DamageState_OnSleepStateChanged final
{
public:
	bool                                          bIsAwake;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_DamageState.OnVehicleSleepStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleSoundComponent_DamageState_OnVehicleSleepStateChanged final
{
public:
	bool                                          bIsAwake;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.VehicleAudioLifecycleInterface.OnUpdate
// 0x0004 (0x0004 - 0x0000)
struct VehicleAudioLifecycleInterface_OnUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.VehicleSoundSurfaceData.BP_GetSoundForSurface
// 0x0010 (0x0010 - 0x0000)
struct VehicleSoundSurfaceData_BP_GetSoundForSurface final
{
public:
	EPhysicalSurface                              InSurface;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InAir;                                             // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.BindVehicleCollisionEvent
// 0x0050 (0x0050 - 0x0000)
struct FortVehicleAudioController_BindVehicleCollisionEvent final
{
public:
	struct FVehicleCollisionAudioConfig           CollisionAudioConfig;                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.OnVehicleRecentlyHit
// 0x0040 (0x0040 - 0x0000)
struct FortVehicleAudioController_OnVehicleRecentlyHit final
{
public:
	class AFortAthenaVehicle*                     SelfActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 HitActor;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0028(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.OnVehicleSleepStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleAudioController_OnVehicleSleepStateChanged final
{
public:
	bool                                          bIsAwake;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.SetLayeredAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleAudioController_SetLayeredAudioComponent final
{
public:
	class UFortLayeredAudioComponent*             InComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.SetMetasoundGeneratorHandle
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleAudioController_SetMetasoundGeneratorHandle final
{
public:
	class UAudioComponent*                        TargetComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.SetRedlineActive
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleAudioController_SetRedlineActive final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.SetVehicle
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleAudioController_SetVehicle final
{
public:
	class AFortAthenaVehicle*                     InVehicle;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.UpdateCollisionAudioNative
// 0x0020 (0x0020 - 0x0000)
struct FortVehicleAudioController_UpdateCollisionAudioNative final
{
public:
	class AActor*                                 CollisionTarget;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.UpdateMotorModelNative
// 0x0004 (0x0004 - 0x0000)
struct FortVehicleAudioController_UpdateMotorModelNative final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.UpdateSpringCompressionNative
// 0x0028 (0x0028 - 0x0000)
struct FortVehicleAudioController_UpdateSpringCompressionNative final
{
public:
	class UFortCollisionAudioComponent*           TargetCollisionAudioComponent;                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VehicleLocationOffset;                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutMagnitude;                                      // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetAudioMotorModelComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleAudioController_GetAudioMotorModelComponent final
{
public:
	class UAudioMotorModelComponent*              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetAudioParameterComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleAudioController_GetAudioParameterComponent final
{
public:
	class UAudioParameterComponent*               ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetBrakingNative
// 0x0004 (0x0004 - 0x0000)
struct FortVehicleAudioController_GetBrakingNative final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetEngineAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleAudioController_GetEngineAudioComponent final
{
public:
	class UAudioComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetJitterTime
// 0x0004 (0x0004 - 0x0000)
struct FortVehicleAudioController_GetJitterTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetLayeredAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleAudioController_GetLayeredAudioComponent final
{
public:
	class UFortLayeredAudioComponent*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetPhysicsVehicleConfigs
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleAudioController_GetPhysicsVehicleConfigs final
{
public:
	const class UFortPhysicsVehicleConfigs*       ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetRedlineActive
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleAudioController_GetRedlineActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetREVComponent
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleAudioController_GetREVComponent final
{
public:
	class UREVComponent*                          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetShouldUpdate
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleAudioController_GetShouldUpdate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetThrottleNative
// 0x0004 (0x0004 - 0x0000)
struct FortVehicleAudioController_GetThrottleNative final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.GetVehicleActor
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleAudioController_GetVehicleActor final
{
public:
	class AFortAthenaVehicle*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.IsNativizationEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleAudioController_IsNativizationEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleAudioController.UseMetasounds
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleAudioController_UseMetasounds final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Speed.OnReversedChanged
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleSoundComponent_Speed_OnReversedChanged final
{
public:
	bool                                          bReversing;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.CalculateSurfaceSpeed
// 0x0014 (0x0014 - 0x0000)
struct FortVehicleSoundComponent_Surface_CalculateSurfaceSpeed final
{
public:
	float                                         CurrentSurfaceSpeed;                               // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpSpeed;                                       // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutNormalizedVehicleSpeed;                         // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.GetSpringCompressionMagnitude
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_Surface_GetSpringCompressionMagnitude final
{
public:
	float                                         MaxSpringCompMultiplier;                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.OnBrakingChanged
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleSoundComponent_Surface_OnBrakingChanged final
{
public:
	bool                                          bNewState;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.OnEnteredWaterBody
// 0x0010 (0x0010 - 0x0000)
struct FortVehicleSoundComponent_Surface_OnEnteredWaterBody final
{
public:
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.OnExitWaterBody
// 0x0010 (0x0010 - 0x0000)
struct FortVehicleSoundComponent_Surface_OnExitWaterBody final
{
public:
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWaterBodyActor*                    WaterBody;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.OnInAirChanged
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleSoundComponent_Surface_OnInAirChanged final
{
public:
	bool                                          bNewState;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.OnSkiddingChanged
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleSoundComponent_Surface_OnSkiddingChanged final
{
public:
	bool                                          bNewState;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.OnSurfaceChanged
// 0x0001 (0x0001 - 0x0000)
struct FortVehicleSoundComponent_Surface_OnSurfaceChanged final
{
public:
	EPhysicalSurface                              NewSurface;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.SetFloatParameterOnAudioComponents
// 0x0008 (0x0008 - 0x0000)
struct FortVehicleSoundComponent_Surface_SetFloatParameterOnAudioComponents final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InFloat;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.SetTriggerParameterOnAudioComponents
// 0x0004 (0x0004 - 0x0000)
struct FortVehicleSoundComponent_Surface_SetTriggerParameterOnAudioComponents final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.UpdateSurface_Native
// 0x0004 (0x0004 - 0x0000)
struct FortVehicleSoundComponent_Surface_UpdateSurface_Native final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function VehicleAudioRuntime.FortVehicleSoundComponent_Surface.UpdateSurfaceMagnitude_Native
// 0x0018 (0x0018 - 0x0000)
struct FortVehicleSoundComponent_Surface_UpdateSurfaceMagnitude_Native final
{
public:
	float                                         SurfaceMagnitudeParam;                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringCompressionMagnitude;                        // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringCompMagnitudeAttack;                         // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringCompMagnitudeRelease;                        // 0x000C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

