#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseAssets

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "VerseNative_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class VerseAssets.VerseMaterialInstanceDynamic
// 0x0038 (0x0300 - 0x02C8)
class UVerseMaterialInstanceDynamic final : public UMaterialInstanceDynamic
{
public:
	uint8                                         Pad_2C8[0x38];                                     // 0x02C8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseMaterialInstanceDynamic">();
	}
	static class UVerseMaterialInstanceDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseMaterialInstanceDynamic>();
	}
};

// Class VerseAssets.VerseAssetPtr
// 0x0050 (0x0080 - 0x0030)
class UVerseAssetPtr : public UVerseAsset
{
public:
	TSoftObjectPtr<class UObject>                 AssetForEditor;                                    // 0x0030(0x0020)(Edit, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AssetPathName;                                     // 0x0050(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Object;                                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0x20];                                      // 0x0060(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_AssetPathName();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseAssetPtr">();
	}
	static class UVerseAssetPtr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseAssetPtr>();
	}
};

// Class VerseAssets.EditableDataObject
// 0x0020 (0x0048 - 0x0028)
class UEditableDataObject final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditableDataObject">();
	}
	static class UEditableDataObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableDataObject>();
	}
};

// Class VerseAssets.EditableDataObjectGeneratedClass
// 0x0000 (0x0360 - 0x0360)
class UEditableDataObjectGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditableDataObjectGeneratedClass">();
	}
	static class UEditableDataObjectGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableDataObjectGeneratedClass>();
	}
};

}

