#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteInternal

#include "Basic.hpp"

#include "VerseFortniteInternal_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseColors_structs.hpp"


namespace SDK::Params
{

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rbegin
// 0x0001 (0x0001 - 0x0000)
struct Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rbegin final
{
public:
	struct VerseFortniteInternal::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rend
// 0x0001 (0x0001 - 0x0000)
struct Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rend final
{
public:
	struct VerseFortniteInternal::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rexists
// 0x0002 (0x0002 - 0x0000)
struct Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rexists final
{
public:
	struct VerseFortniteInternal::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rpause
// 0x0001 (0x0001 - 0x0000)
struct Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rpause final
{
public:
	struct VerseFortniteInternal::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rreset
// 0x0068 (0x0068 - 0x0000)
struct Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_Rreset final
{
public:
	struct VerseFortniteInternal::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_0;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0008(0x0010)(HasGetValueTypeHash)
	struct VerseFortniteInternal::Ftuple_L_R      _ExprResult_2;                                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_3;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_4;                                         // 0x0020(0x0010)(HasGetValueTypeHash)
	struct VerseFortniteInternal::Ftuple_L_R      _ExprResult_5;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_6;                          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x0038(0x0010)(HasGetValueTypeHash)
	struct VerseFortniteInternal::Ftuple_L_R      _ExprResult_8;                                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_9;                          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x0050(0x0010)(HasGetValueTypeHash)
	struct VerseFortniteInternal::Ftuple_L_R      _ExprResult_11;                                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_StormController_storm_controller_component._L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_RsetBattleRoyalePhases
// 0x10C8 (0x10C8 - 0x0000)
struct Game_StormController_storm_controller_component__L_2fFortnite_2ecom_2fGame_2fStormController_2fstorm__controller__component_N_RsetBattleRoyalePhases final
{
public:
	struct VerseFortniteInternal::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGame_StormController_storm_phase*> _AssignmentScratch_0;                           // 0x0008(0x0010)(ContainsInstancedReference)
	TArray<class UGame_StormController_storm_phase*> _ExprResult_1;                                  // 0x0018(0x0010)(ContainsInstancedReference)
	class UGame_StormController_storm_phase*      _ExprResult_2;                                     // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_4;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_5;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_6;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_7;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_8;                  // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_9;                                     // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_10;                               // 0x0088(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_11;                                    // 0x00D8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x00E8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x00F8(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_14;                                    // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_15;                               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_16;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_17;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_18;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_19;                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_20;                 // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_21;                                    // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_22;                               // 0x0168(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_23;                                    // 0x01B8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_24;                                    // 0x01C8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_25;                                    // 0x01D8(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_26;                                    // 0x01E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_27;                               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_28;                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_29;                  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_30;         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_31;                 // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_32;                 // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_33;                                    // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_34;                               // 0x0248(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_35;                                    // 0x0298(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_36;                                    // 0x02A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_37;                                    // 0x02B8(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_38;                                    // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_39;                               // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_40;                    // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_41;                  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_42;         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_43;                 // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_44;                 // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_45;                                    // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_46;                               // 0x0328(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_47;                                    // 0x0378(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_48;                                    // 0x0388(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_49;                                    // 0x0398(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_50;                                    // 0x03A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_51;                               // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_52;                    // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_53;                  // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_54;         // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_55;                 // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_56;                 // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_57;                                    // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_58;                               // 0x0408(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_59;                                    // 0x0458(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_60;                                    // 0x0468(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_61;                                    // 0x0478(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_62;                                    // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_63;                               // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_64;                    // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_65;                  // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_66;         // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_67;                 // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x3902DD0B_moves_68 : 1;                   // 0x04B8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xDA5EE7C4_minMovementDistancePercentage_69; // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7B63CDBA_maxMovementDistancePercentage_70; // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_71;                 // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_72;                                    // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_73;                               // 0x0500(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_74;                                    // 0x0550(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_75;                                    // 0x0560(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_76;                                    // 0x0570(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_77;                                    // 0x0580(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_78;                               // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_79;                    // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_80;                  // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_81;         // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_82;                 // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x3902DD0B_moves_83 : 1;                   // 0x05B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xDA5EE7C4_minMovementDistancePercentage_84; // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7B63CDBA_maxMovementDistancePercentage_85; // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_86;                 // 0x05C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_87;                                    // 0x05E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_88;                               // 0x05F8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_89;                                    // 0x0648(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_90;                                    // 0x0658(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_91;                                    // 0x0668(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_92;                                    // 0x0678(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_93;                               // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_94;                    // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_95;                  // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_96;         // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_97;                 // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x3902DD0B_moves_98 : 1;                   // 0x06A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xDA5EE7C4_minMovementDistancePercentage_99; // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7B63CDBA_maxMovementDistancePercentage_100; // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_101;                // 0x06C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_102;                                   // 0x06D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_103;                              // 0x06F0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_104;                                   // 0x0740(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_105;                                   // 0x0750(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_106;                                   // 0x0760(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_107;                                   // 0x0770(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_108;                              // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_109;                   // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_110;                 // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_111;        // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_112;                // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x3902DD0B_moves_113 : 1;                  // 0x07A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_7A1[0x7];                                      // 0x07A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xDA5EE7C4_minMovementDistancePercentage_114; // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7B63CDBA_maxMovementDistancePercentage_115; // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_116;                // 0x07B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_117;                                   // 0x07D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_118;                              // 0x07E8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_119;                                   // 0x0838(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_120;                                   // 0x0848(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_121;                                   // 0x0858(0x0010)(HasGetValueTypeHash)
	TArray<class UGame_StormController_storm_phase*> _AssignmentScratch_122;                         // 0x0868(0x0010)(ContainsInstancedReference)
	TArray<class UGame_StormController_storm_phase*> _ExprResult_123;                                // 0x0878(0x0010)(ContainsInstancedReference)
	class UGame_StormController_storm_phase*      _ExprResult_124;                                   // 0x0888(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_125;                              // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_126;                   // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_127;                 // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_128;        // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_129;                // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_130;                // 0x08B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_131;                                   // 0x08D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_132;                              // 0x08E8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_133;                                   // 0x0938(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_134;                                   // 0x0948(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_135;                                   // 0x0958(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_136;                                   // 0x0968(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_137;                              // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_138;                   // 0x0978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_139;                 // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_140;        // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_141;                // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_142;                // 0x0998(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_143;                                   // 0x09B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_144;                              // 0x09C8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_145;                                   // 0x0A18(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_146;                                   // 0x0A28(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_147;                                   // 0x0A38(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_148;                                   // 0x0A48(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_149;                              // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_150;                   // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_151;                 // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_152;        // 0x0A68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_153;                // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_154;                // 0x0A78(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_155;                                   // 0x0A90(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_156;                              // 0x0AA8(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_157;                                   // 0x0AF8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_158;                                   // 0x0B08(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_159;                                   // 0x0B18(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_160;                                   // 0x0B28(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_161;                              // 0x0B30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_162;                   // 0x0B38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_163;                 // 0x0B40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_164;        // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_165;                // 0x0B50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_166;                // 0x0B58(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_167;                                   // 0x0B70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_168;                              // 0x0B88(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_169;                                   // 0x0BD8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_170;                                   // 0x0BE8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_171;                                   // 0x0BF8(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_172;                                   // 0x0C08(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_173;                              // 0x0C10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_174;                   // 0x0C18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_175;                 // 0x0C20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_176;        // 0x0C28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_177;                // 0x0C30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_178;                // 0x0C38(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_179;                                   // 0x0C50(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_180;                              // 0x0C68(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_181;                                   // 0x0CB8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_182;                                   // 0x0CC8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_183;                                   // 0x0CD8(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_184;                                   // 0x0CE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_185;                              // 0x0CF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_186;                   // 0x0CF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_187;                 // 0x0D00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_188;        // 0x0D08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_189;                // 0x0D10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x3902DD0B_moves_190 : 1;                  // 0x0D18(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_D19[0x7];                                      // 0x0D19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xDA5EE7C4_minMovementDistancePercentage_191; // 0x0D20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7B63CDBA_maxMovementDistancePercentage_192; // 0x0D28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_193;                // 0x0D30(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_194;                                   // 0x0D48(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_195;                              // 0x0D60(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_196;                                   // 0x0DB0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_197;                                   // 0x0DC0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_198;                                   // 0x0DD0(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_199;                                   // 0x0DE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_200;                              // 0x0DE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_201;                   // 0x0DF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_202;                 // 0x0DF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_203;        // 0x0E00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_204;                // 0x0E08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x3902DD0B_moves_205 : 1;                  // 0x0E10(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_E11[0x7];                                      // 0x0E11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xDA5EE7C4_minMovementDistancePercentage_206; // 0x0E18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7B63CDBA_maxMovementDistancePercentage_207; // 0x0E20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_208;                // 0x0E28(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_209;                                   // 0x0E40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_210;                              // 0x0E58(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_211;                                   // 0x0EA8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_212;                                   // 0x0EB8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_213;                                   // 0x0EC8(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_214;                                   // 0x0ED8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_215;                              // 0x0EE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_216;                   // 0x0EE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_217;                 // 0x0EF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_218;        // 0x0EF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_219;                // 0x0F00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x3902DD0B_moves_220 : 1;                  // 0x0F08(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_F09[0x7];                                      // 0x0F09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xDA5EE7C4_minMovementDistancePercentage_221; // 0x0F10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7B63CDBA_maxMovementDistancePercentage_222; // 0x0F18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_223;                // 0x0F20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_224;                                   // 0x0F38(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_225;                              // 0x0F50(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_226;                                   // 0x0FA0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_227;                                   // 0x0FB0(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_228;                                   // 0x0FC0(0x0010)(HasGetValueTypeHash)
	class UGame_StormController_storm_phase*      _ExprResult_229;                                   // 0x0FD0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_230;                              // 0x0FD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4CDBEC4D_waitTime_231;                   // 0x0FE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xDFEF9A4E_shrinkTime_232;                 // 0x0FE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x61AAA523_endRadiusPercentage_233;        // 0x0FF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x7781DBF3_damageIndex_234;                // 0x0FF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x3902DD0B_moves_235 : 1;                  // 0x1000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1001[0x7];                                     // 0x1001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xDA5EE7C4_minMovementDistancePercentage_236; // 0x1008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x7B63CDBA_maxMovementDistancePercentage_237; // 0x1010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0xD6F5A7B7_endLocation_238;                // 0x1018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSpatialMath_vector3                   _ExprResult_239;                                   // 0x1030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_240;                              // 0x1048(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_241;                                   // 0x1098(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_242;                                   // 0x10A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_243;                                   // 0x10B8(0x0010)(HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_Player_PlayerStatus._L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R
// 0x0018 (0x0018 - 0x0000)
struct Game_Player_PlayerStatus__L_2fFortnite_2ecom_2fGame_2fPlayer_2fPlayerStatus_N_RgetStatus_L_Nplayer__component_M_Nplayer__status__type_R final
{
public:
	struct Ftuple_Lplayer__component_Mplayer__status__type_R __verse_0xB2CDDD72_Argument;            // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_Item_PlayerPickupComponent._L_2fFortnite_2ecom_2fGame_2fItem_2fPlayerPickupComponent_N_RcreatePickup_L_Nvk__component_M_Nfort__item__definition_M_Nint_M_Nvector3_R
// 0x0038 (0x0038 - 0x0000)
struct Game_Item_PlayerPickupComponent__L_2fFortnite_2ecom_2fGame_2fItem_2fPlayerPickupComponent_N_RcreatePickup_L_Nvk__component_M_Nfort__item__definition_M_Nint_M_Nvector3_R final
{
public:
	struct Ftuple_Lvk__component_Mfort__item__definition_Mint_Mvector3_R __verse_0xB2CDDD72_Argument; // 0x0000(0x0030)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<class UGame_Item_player_pickup_component*, true> RetVal;                               // 0x0030(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuilding_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetBuildingOnWater_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditing_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetEditingHostile_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_building_settings_component._L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fort_building_settings_component__L_2fFortnite_2ecom_2fGame_2ffort__building__settings__component_N_RsetTrapPlacement_L_NPlayerSettingState_R final
{
public:
	EGame_PlayerSettingState                      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fort_playspace_component.__WaitForPlayerEliminated
// 0x0028 (0x0028 - 0x0000)
struct Game_fort_playspace_component___WaitForPlayerEliminated final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortniteInternal::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged
// 0x0002 (0x0002 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeDamaged final
{
public:
	struct VerseFortniteInternal::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced
// 0x0002 (0x0002 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RcanBeReplaced final
{
public:
	struct VerseFortniteInternal::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeDamaged_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R
// 0x0001 (0x0001 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RsetCanBeReplaced_L_Nlogic_R final
{
public:
	uint8                                         __verse_0xB2CDDD72_Argument : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_fortnite_building_component._L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt
// 0x0002 (0x0002 - 0x0000)
struct Game_fortnite_building_component__L_2fFortnite_2ecom_2fGame_2ffortnite__building__component_N_RwasPlayerBuilt final
{
public:
	struct VerseFortniteInternal::Ftuple_L_R      __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Nvk__component_M_NType_20where_20Type_R
// 0x0020 (0x0020 - 0x0000)
struct Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RgetAllComponentsOfType_L_Nvk__component_M_NType_20where_20Type_R final
{
public:
	struct Ftuple_Lvk__component_Mvk__component_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UEntityComponent*>               RetVal;                                            // 0x0010(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseFortniteInternal.Game_VerseFortniteHacks._L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R
// 0x0010 (0x0010 - 0x0000)
struct Game_VerseFortniteHacks__L_2fFortnite_2ecom_2fGame_2fVerseFortniteHacks_N_RGetPawnCollisionEntityID_L_Nplayer__component_R final
{
public:
	class USimulation_player_component*           __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

