#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteGameplayAbilities_0

#include "Basic.hpp"

#include "VerseFortniteGameplayAbilities_0_structs.hpp"
#include "VerseAssets_0_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseFortniteGameplayAbilities_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseNative_0_classes.hpp"


namespace SDK
{

// VerseClass VerseFortniteGameplayAbilities.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseFortniteGameplayAbilities_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseFortniteGameplayAbilities.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseFortniteGameplayAbilities_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseFortniteGameplayAbilities_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseFortniteGameplayAbilities.Game_Attributes_gameplay_attribute
// 0x0048 (0x0070 - 0x0028)
class UGame_Attributes_gameplay_attribute : public UVerseGameplayAttribute
{
public:
	FVerseStringProperty_                         __verse_0xF8DF8FBE_AttributePathString;            // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_38[0x38];                                      // 0x0038(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Attributes_gameplay_attribute">();
	}
	static class UGame_Attributes_gameplay_attribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Attributes_gameplay_attribute>();
	}
};

// VerseClass VerseFortniteGameplayAbilities.Game_Attributes_health_attribute
// 0x0000 (0x0070 - 0x0070)
class UGame_Attributes_health_attribute final : public UGame_Attributes_gameplay_attribute
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Attributes_health_attribute">();
	}
	static class UGame_Attributes_health_attribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Attributes_health_attribute>();
	}
};

// VerseClass VerseFortniteGameplayAbilities.Game_Abilities_gameplay_effect_asset
// 0x0000 (0x00C8 - 0x00C8)
class UGame_Abilities_gameplay_effect_asset final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Abilities_gameplay_effect_asset">();
	}
	static class UGame_Abilities_gameplay_effect_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Abilities_gameplay_effect_asset>();
	}
};

// VerseClass VerseFortniteGameplayAbilities.Game_Abilities_AbilityComponent
// 0x0000 (0x0028 - 0x0028)
class UGame_Abilities_AbilityComponent final : public UObject
{
public:
	static TOptional<class UGame_Abilities_vk_fort_ability_component*, true> _L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForCharacter_L_Nfort__character_R(class UObject* __verse_0xB2CDDD72_Argument);
	static TOptional<class UGame_Abilities_vk_fort_ability_component*, true> _L_2fFortnite_2ecom_2fGame_2fAbilities_2fAbilityComponent_N_RGetAbilityComponentForPlayer_L_Nplayer__component_R(class USimulation_player_component* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Abilities_AbilityComponent">();
	}
	static class UGame_Abilities_AbilityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Abilities_AbilityComponent>();
	}
};

// VerseClass VerseFortniteGameplayAbilities.task_Game_Abilities_vk_fort_ability_component$ActivateAbility_L_Ngameplay__ability__asset_M_N_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R
// 0x0028 (0x0180 - 0x0158)
class Utask_Game_Abilities_vk_fort_ability_component_ActivateAbility_L_Ngameplay__ability__asset_M_N_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R final : public UConcurrency_task
{
public:
	class UGame_Abilities_vk_fort_ability_component* _Self;                                          // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct Ftuple_Lgameplay__ability__asset_M_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0160(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGame_Abilities_activate_ability_result       _RetVal;                                           // 0x0178(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Game_Abilities_vk_fort_ability_component$ActivateAbility_L_Ngameplay__ability__asset_M_N_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R">();
	}
	static class Utask_Game_Abilities_vk_fort_ability_component_ActivateAbility_L_Ngameplay__ability__asset_M_N_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Game_Abilities_vk_fort_ability_component_ActivateAbility_L_Ngameplay__ability__asset_M_N_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R>();
	}
};

// VerseClass VerseFortniteGameplayAbilities.Game_Abilities_vk_fort_ability_component
// 0x00A8 (0x0138 - 0x0090)
class UGame_Abilities_vk_fort_ability_component final : public UVerseFortniteAbilityComponentBase
{
public:
	FVerseFunctionProperty_                       __verse_0x4E83BDEE__L_2fFortnite_2ecom_2fGame_2fAbilities_2fvk__fort__ability__component_N_RAddAbility_L_Ngameplay__ability__asset_R; // 0x0090(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xEFB3DCB5__L_2fFortnite_2ecom_2fGame_2fAbilities_2fvk__fort__ability__component_N_RRemoveAbility_L_Ngameplay__ability__asset_R; // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1A22FD7D_ActivateAbility_L_Ngameplay__ability__asset_M_N_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R; // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC5B3E1AB__L_2fFortnite_2ecom_2fGame_2fAbilities_2fvk__fort__ability__component_N_RApplyGameplayEffect_L_Ngameplay__effect__asset_M_Nfloat_R; // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_D0[0x68];                                      // 0x00D0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	EGame_Abilities_add_ability_result _L_2fFortnite_2ecom_2fGame_2fAbilities_2fvk__fort__ability__component_N_RAddAbility_L_Ngameplay__ability__asset_R(class UGame_Abilities_gameplay_ability_asset* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fAbilities_2fvk__fort__ability__component_N_RApplyGameplayEffect_L_Ngameplay__effect__asset_M_Nfloat_R(const struct Ftuple_Lgameplay__effect__asset_Mfloat_R& __verse_0xB2CDDD72_Argument);
	EGame_Abilities_remove_ability_result _L_2fFortnite_2ecom_2fGame_2fAbilities_2fvk__fort__ability__component_N_RRemoveAbility_L_Ngameplay__ability__asset_R(class UGame_Abilities_gameplay_ability_asset* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* ActivateAbility_L_Ngameplay__ability__asset_M_N_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lgameplay__ability__asset_M_QTarget_N_Qagent_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Abilities_vk_fort_ability_component">();
	}
	static class UGame_Abilities_vk_fort_ability_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Abilities_vk_fort_ability_component>();
	}
};

// VerseClass VerseFortniteGameplayAbilities.Game_Abilities_gameplay_ability_asset
// 0x0000 (0x00C8 - 0x00C8)
class UGame_Abilities_gameplay_ability_asset final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_Abilities_gameplay_ability_asset">();
	}
	static class UGame_Abilities_gameplay_ability_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_Abilities_gameplay_ability_asset>();
	}
};

}

