#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum VerseFortnite.ECharacterLook
// NumValues: 0x0003
enum class ECharacterLook : uint8
{
	FortniteCharacter                        = 0,
	CharacterBlueprint                       = 1,
	ECharacterLook_MAX                       = 2,
};

// Enum VerseFortnite.ENPCCharacterMovement
// NumValues: 0x0004
enum class ENPCCharacterMovement : uint8
{
	Default                                  = 0,
	RetargetFromFortniteCharacter            = 1,
	AnimationPreset                          = 2,
	ENPCCharacterMovement_MAX                = 3,
};

// Enum VerseFortnite.ETeamOption
// NumValues: 0x0004
enum class ETeamOption : uint8
{
	Index                                    = 0,
	WildlifeAndCreature                      = 1,
	Neutral                                  = 2,
	ETeamOption_MAX                          = 3,
};

// Enum VerseFortnite.ENPCIndicatorCondition
// NumValues: 0x0005
enum class ENPCIndicatorCondition : uint8
{
	Never                                    = 0,
	Allies                                   = 1,
	Hostiles                                 = 2,
	Always                                   = 3,
	ENPCIndicatorCondition_MAX               = 4,
};

// ScriptStruct VerseFortnite.AIComponentSettings
// 0x0010 (0x0010 - 0x0000)
struct FAIComponentSettings final
{
public:
	TSubclassOf<class UObject>                    AIComponentClass;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIComponentData*                       AIComponentData;                                   // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseFortnite.CharacterPreviewMesh
// 0x0040 (0x0040 - 0x0000)
struct FCharacterPreviewMesh final
{
public:
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh;                                      // 0x0000(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  MeshDescriptor;                                    // 0x0020(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseFortnite.CharacterModifierEmote
// 0x0020 (0x0020 - 0x0000)
struct FCharacterModifierEmote final
{
public:
	TSoftObjectPtr<class UAthenaDanceItemDefinition> EmoteDefinition;                                // 0x0000(0x0020)(Edit, BlueprintVisible, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseFortnite.CharacterModifierInventoryItem
// 0x0028 (0x0028 - 0x0000)
struct FCharacterModifierInventoryItem final
{
public:
	TSoftObjectPtr<class UFortItemDefinition>     ItemDefinition;                                    // 0x0000(0x0020)(Edit, BlueprintVisible, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemQuantity;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseFortnite.DefaultCharacterCustomizationData
// 0x0050 (0x0050 - 0x0000)
struct FDefaultCharacterCustomizationData final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCustomCharacterPart*>           CharacterParts;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseFortnite.CharacterTypePreset
// 0x0040 (0x0040 - 0x0000)
struct FCharacterTypePreset final
{
public:
	TSoftClassPtr<class UClass>                   SpawnerData;                                       // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   AdditionalData;                                    // 0x0020(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

