#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseNative_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseNative_0_structs.hpp"


namespace SDK
{

// VerseClass VerseNative.Native
// 0x0000 (0x0028 - 0x0028)
class UNative final : public UObject
{
public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Native">();
	}
	static class UNative* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNative>();
	}
};

// VerseClass VerseNative.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseNative_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseNative.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseNative_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseNative_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseNative.Concurrency
// 0x0000 (0x0028 - 0x0028)
class UConcurrency final : public UObject
{
public:
	static class UClass* _L_2fVerse_2eorg_2fConcurrency_N_Rawaitable(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fVerse_2eorg_2fConcurrency_N_Rawaitable_L_Npayload_20where_20payload_R(class UClass* __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fVerse_2eorg_2fConcurrency_N_Rtask_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Concurrency">();
	}
	static class UConcurrency* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcurrency>();
	}
};

// VerseClass VerseNative.Concurrency_task_group
// 0x0028 (0x0050 - 0x0028)
class UConcurrency_task_group final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0xE139E9C7__L_2fVerse_2eorg_2fConcurrency_2ftask__group_N_RGetNumActive; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	int64 _L_2fVerse_2eorg_2fConcurrency_2ftask__group_N_RGetNumActive(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Concurrency_task_group">();
	}
	static class UConcurrency_task_group* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcurrency_task_group>();
	}
};

// VerseClass VerseNative.Concurrency_awaitable
// 0x0000 (0x0028 - 0x0028)
class UConcurrency_awaitable final : public UObject
{
public:
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Concurrency_awaitable">();
	}
	static class UConcurrency_awaitable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcurrency_awaitable>();
	}
};

// VerseClass VerseNative.Concurrency_task
// 0x0130 (0x0158 - 0x0028)
class UConcurrency_task : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x985516B1__L_2fVerse_2eorg_2fConcurrency_2ftask_N_RActive; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x157A9889__L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCompleted; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCC34C7FE__L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCanceling; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF4D06D76__L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCanceled; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB61081EB__L_2fVerse_2eorg_2fConcurrency_2ftask_N_RUnsettled; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x75AC3686__L_2fVerse_2eorg_2fConcurrency_2ftask_N_RSettled; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x931046A0__L_2fVerse_2eorg_2fConcurrency_2ftask_N_RUninterrupted; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x57FC6F38__L_2fVerse_2eorg_2fConcurrency_2ftask_N_RInterrupted; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8AFA7CD5__L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCancel; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8DE7DBE5_Await;                          // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x90];                                      // 0x00C8(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RActive(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCancel(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCanceled(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCanceling(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RCompleted(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RInterrupted(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RSettled(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RUninterrupted(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fConcurrency_2ftask_N_RUnsettled(const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseNative_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Concurrency_task">();
	}
	static class UConcurrency_task* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcurrency_task>();
	}
};

// VerseClass VerseNative.task_Concurrency_awaitable$Await
// 0x0020 (0x0178 - 0x0158)
class Utask_Concurrency_awaitable_Await final : public UConcurrency_task
{
public:
	class UConcurrency_awaitable*                 _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNative_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _RetVal;                                           // 0x0168(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Concurrency_awaitable$Await">();
	}
	static class Utask_Concurrency_awaitable_Await* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Concurrency_awaitable_Await>();
	}
};

// VerseClass VerseNative.task_Concurrency_task$Await
// 0x0020 (0x0178 - 0x0158)
class Utask_Concurrency_task_Await final : public UConcurrency_task
{
public:
	class UConcurrency_task*                      _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseNative_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _RetVal;                                           // 0x0168(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Concurrency_task$Await">();
	}
	static class Utask_Concurrency_task_Await* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Concurrency_task_Await>();
	}
};

}

