#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseInput

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "VerseInput_structs.hpp"


namespace SDK
{

// Class VerseInput.VerseInputActionBase
// 0x0010 (0x0038 - 0x0028)
class UVerseInputActionBase : public UObject
{
public:
	struct FGuid                                  Guid;                                              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseInputActionBase">();
	}
	static class UVerseInputActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInputActionBase>();
	}
};

// Class VerseInput.VerseInputTriggerBase
// 0x0000 (0x0028 - 0x0028)
class UVerseInputTriggerBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseInputTriggerBase">();
	}
	static class UVerseInputTriggerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInputTriggerBase>();
	}
};

// Class VerseInput.VerseInputModifierBase
// 0x0000 (0x0028 - 0x0028)
class UVerseInputModifierBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseInputModifierBase">();
	}
	static class UVerseInputModifierBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInputModifierBase>();
	}
};

// Class VerseInput.VerseInputClientActionBase
// 0x0000 (0x0028 - 0x0028)
class UVerseInputClientActionBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseInputClientActionBase">();
	}
	static class UVerseInputClientActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInputClientActionBase>();
	}
};

// Class VerseInput.VerseInputWorldSubsystem
// 0x0050 (0x0080 - 0x0030)
class UVerseInputWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseInputWorldSubsystem">();
	}
	static class UVerseInputWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseInputWorldSubsystem>();
	}
};

// Class VerseInput.VerseReplicatedInputDataComponent
// 0x0130 (0x01D0 - 0x00A0)
class UVerseReplicatedInputDataComponent : public UActorComponent
{
public:
	struct FVerseInputActionDataList              InputActions;                                      // 0x00A0(0x0120)(Net, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UEnhancedInputComponent*                InputComponent;                                    // 0x01C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputMappingContext*                   CurrentInputMappingContext;                        // 0x01C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnInputActionTriggered(const struct FInputActionInstance& ActionInstance);

	void ServerInputActionTriggered(const struct FGuid& Guid, const struct FVector& InputValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseReplicatedInputDataComponent">();
	}
	static class UVerseReplicatedInputDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseReplicatedInputDataComponent>();
	}
};

}

