#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery

#include "Basic.hpp"


namespace SDK
{

// VerseStruct VerseQuery.overlap_result
// 0x0018 (0x0018 - 0x0000)
struct Foverlap_result final
{
public:
	TOptional<class Ucollision_component*, true>  __verse_0xE03F93D3_CollisionComponent;             // 0x0000(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              __verse_0x21031EF9_Entities;                       // 0x0008(0x0010)(InstancedReference, ContainsInstancedReference)
};

// VerseStruct VerseQuery.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseQuery::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mcomponent_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lentity_Mtuple_L_R_Mcomponent_R final
{
public:
	class Entity_0::UEntity*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery::Ftuple_L_R                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mconvex__hull3_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lentity_Mtuple_L_R_Mconvex__hull3_R final
{
public:
	class Entity_0::UEntity*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery::Ftuple_L_R                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Uconvex_hull3*                          __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mentity_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lentity_Mtuple_L_R_Mentity_R final
{
public:
	class Entity_0::UEntity*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery::Ftuple_L_R                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseQuery.tuple_Lentity_Mtuple_L_R_Mtag_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lentity_Mtuple_L_R_Mtag_R final
{
public:
	class Entity_0::UEntity*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseQuery::Ftuple_L_R                 __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTags_tag*                              __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

}

