#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseInput_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VerseInput_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseInput_0_structs.hpp"


namespace SDK
{

// VerseClass VerseInput.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseInput_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseInput.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseInput_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseInput_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseInput.ControlInput_trigger
// 0x0000 (0x0028 - 0x0028)
class UControlInput_trigger : public UVerseInputTriggerBase
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_trigger">();
	}
	static class UControlInput_trigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_trigger>();
	}
};

// VerseClass VerseInput.ControlInput_pressed
// 0x0008 (0x0030 - 0x0028)
class UControlInput_pressed final : public UControlInput_trigger
{
public:
	double                                        __verse_0x95BB44BB_ActuationThreshold;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_pressed">();
	}
	static class UControlInput_pressed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_pressed>();
	}
};

// VerseClass VerseInput.ControlInput_modifier
// 0x0000 (0x0028 - 0x0028)
class UControlInput_modifier : public UVerseInputModifierBase
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_modifier">();
	}
	static class UControlInput_modifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_modifier>();
	}
};

// VerseClass VerseInput.ControlInput_player_input
// 0x0040 (0x0210 - 0x01D0)
class UControlInput_player_input final : public UVerseReplicatedInputDataComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x909AE6E3__L_2fVerse_2eorg_2fControlInput_2fplayer__input_N_RAddInputAction_L_Ninput__action_R; // 0x01D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x54492006__L_2fVerse_2eorg_2fControlInput_2fplayer__input_N_RRemoveInputAction_L_Ninput__action_R; // 0x01E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9ACBE37C__L_2fVerse_2eorg_2fControlInput_2fplayer__input_N_RAddInputActions_L_N_Kinput__action_R; // 0x01F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0D1CFCBC__L_2fVerse_2eorg_2fControlInput_2fplayer__input_N_RRemoveInputActions_L_N_Kinput__action_R; // 0x0200(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fVerse_2eorg_2fControlInput_2fplayer__input_N_RAddInputAction_L_Ninput__action_R(class UControlInput_input_action* __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fControlInput_2fplayer__input_N_RAddInputActions_L_N_Kinput__action_R(const TArray<class UControlInput_input_action*>& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fControlInput_2fplayer__input_N_RRemoveInputAction_L_Ninput__action_R(class UControlInput_input_action* __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fControlInput_2fplayer__input_N_RRemoveInputActions_L_N_Kinput__action_R(const TArray<class UControlInput_input_action*>& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_player_input">();
	}
	static class UControlInput_player_input* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_player_input>();
	}
};

// VerseClass VerseInput.ControlInput
// 0x0000 (0x0028 - 0x0028)
class UControlInput final : public UObject
{
public:
	static TOptional<class UControlInput_player_input*, true> _L_2fVerse_2eorg_2fControlInput_N_RGetPlayerInput_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput">();
	}
	static class UControlInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput>();
	}
};

// VerseClass VerseInput.ControlInput_InputVerbs
// 0x0068 (0x0090 - 0x0028)
class UControlInput_InputVerbs final : public UObject
{
public:
	class UControlInput_verb*                     __verse_0x95682886_MoveForward;                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0xD179DEA5_MoveRight;                      // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0xB4EB57A6_MoveUp;                         // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0x8F2FB679_Turn;                           // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0xCD6D1FF5_LookUp;                         // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0x91E44EAA_Jump;                           // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0x19F8ABA1_Sprint;                         // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0xE4D0BB73_Crouch;                         // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0x0E1322C6_Fire;                           // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0x459049A1_Target;                         // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0xE2CE634B_Reload;                         // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0x317A2AF1_Use;                            // 0x0080(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UControlInput_verb*                     __verse_0x784F885F_Emote;                          // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_InputVerbs">();
	}
	static class UControlInput_InputVerbs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_InputVerbs>();
	}
};

// VerseClass VerseInput.ControlInput_apply_impulse_action
// 0x0018 (0x0040 - 0x0028)
class UControlInput_apply_impulse_action final : public UVerseInputClientActionBase
{
public:
	struct FSpatialMath_vector3                   __verse_0xA963B36A_Impulse;                        // 0x0028(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_apply_impulse_action">();
	}
	static class UControlInput_apply_impulse_action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_apply_impulse_action>();
	}
};

// VerseClass VerseInput.ControlInput_input_action
// 0x0040 (0x0078 - 0x0038)
class UControlInput_input_action final : public UVerseInputActionBase
{
public:
	uint8                                         __verse_0x038764DF_ConsumeInput : 1;               // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UControlInput_verb*                     __verse_0xA858D8B8_Verb;                           // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UControlInput_trigger*>          __verse_0x6DA99CE5_Triggers;                       // 0x0048(0x0010)(InstancedReference, ContainsInstancedReference)
	TArray<class UControlInput_modifier*>         __verse_0x686BA12E_Modifiers;                      // 0x0058(0x0010)(InstancedReference, ContainsInstancedReference)
	TArray<class UVerseInputClientActionBase*>    __verse_0xE91D96EF_Actions;                        // 0x0068(0x0010)(InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_input_action">();
	}
	static class UControlInput_input_action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_input_action>();
	}
};

// VerseClass VerseInput.ControlInput_released
// 0x0008 (0x0030 - 0x0028)
class UControlInput_released final : public UControlInput_trigger
{
public:
	double                                        __verse_0x95BB44BB_ActuationThreshold;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_released">();
	}
	static class UControlInput_released* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_released>();
	}
};

// VerseClass VerseInput.ControlInput_dead_zone
// 0x0018 (0x0040 - 0x0028)
class UControlInput_dead_zone final : public UControlInput_modifier
{
public:
	double                                        __verse_0xD4A41BF5_LowerThreshold;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x8355FBA2_UpperThreshold;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EControlInput_dead_zone_type                  __verse_0x72E298E9_Type;                           // 0x0038(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_dead_zone">();
	}
	static class UControlInput_dead_zone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_dead_zone>();
	}
};

// VerseClass VerseInput.ControlInput_hold_and_release
// 0x0018 (0x0040 - 0x0028)
class UControlInput_hold_and_release final : public UControlInput_trigger
{
public:
	double                                        __verse_0x95BB44BB_ActuationThreshold;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x6D798861_HoldTimeThreshold;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x6A46DDEB_AffectedByTimeDilation : 1;     // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_hold_and_release">();
	}
	static class UControlInput_hold_and_release* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_hold_and_release>();
	}
};

// VerseClass VerseInput.ControlInput_launch_action
// 0x0018 (0x0040 - 0x0028)
class UControlInput_launch_action final : public UVerseInputClientActionBase
{
public:
	struct FSpatialMath_vector3                   __verse_0xD4431ECF_Velocity;                       // 0x0028(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_launch_action">();
	}
	static class UControlInput_launch_action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_launch_action>();
	}
};

// VerseClass VerseInput.ControlInput_tap
// 0x0018 (0x0040 - 0x0028)
class UControlInput_tap final : public UControlInput_trigger
{
public:
	double                                        __verse_0x95BB44BB_ActuationThreshold;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xC367085D_TapReleaseTimeThreshold;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x6A46DDEB_AffectedByTimeDilation : 1;     // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_tap">();
	}
	static class UControlInput_tap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_tap>();
	}
};

// VerseClass VerseInput.ControlInput_exponential_response
// 0x0018 (0x0040 - 0x0028)
class UControlInput_exponential_response final : public UControlInput_modifier
{
public:
	struct FSpatialMath_vector3                   __verse_0x1A7A4E2F_CurveExponent;                  // 0x0028(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_exponential_response">();
	}
	static class UControlInput_exponential_response* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_exponential_response>();
	}
};

// VerseClass VerseInput.ControlInput_verb
// 0x0018 (0x0040 - 0x0028)
class UControlInput_verb final : public UObject
{
public:
	TArray<FVerseStringProperty_>                 __verse_0xEDC690FD_InputNames;                     // 0x0028(0x0010)(InstancedReference, ContainsInstancedReference)
	uint8                                         __verse_0x7D5B20A2_IsAxis : 1;                     // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_verb">();
	}
	static class UControlInput_verb* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_verb>();
	}
};

// VerseClass VerseInput.ControlInput_negate
// 0x0008 (0x0030 - 0x0028)
class UControlInput_negate final : public UControlInput_modifier
{
public:
	uint8                                         __verse_0x51F8FD2F_X : 1;                          // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_28_1 : 7;                                   // 0x0028(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x349F4197_Y : 1;                          // 0x0029(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_29_1 : 7;                                   // 0x0029(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xDA30F485_Z : 1;                          // 0x002A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_negate">();
	}
	static class UControlInput_negate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_negate>();
	}
};

// VerseClass VerseInput.ControlInput_play_animation_action
// 0x0008 (0x0030 - 0x0028)
class UControlInput_play_animation_action final : public UVerseInputClientActionBase
{
public:
	class UAssets_animation*                      __verse_0xC8C4AEBA_Animation;                      // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_play_animation_action">();
	}
	static class UControlInput_play_animation_action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_play_animation_action>();
	}
};

// VerseClass VerseInput.ControlInput_play_sound_action
// 0x0008 (0x0030 - 0x0028)
class UControlInput_play_sound_action final : public UVerseInputClientActionBase
{
public:
	class UAssets_sound*                          __verse_0xF013250F_Sound;                          // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_play_sound_action">();
	}
	static class UControlInput_play_sound_action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_play_sound_action>();
	}
};

// VerseClass VerseInput.ControlInput_scale
// 0x0018 (0x0040 - 0x0028)
class UControlInput_scale final : public UControlInput_modifier
{
public:
	struct FSpatialMath_vector3                   __verse_0xA376805D_Scale;                          // 0x0028(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_scale">();
	}
	static class UControlInput_scale* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_scale>();
	}
};

// VerseClass VerseInput.ControlInput_smooth
// 0x0000 (0x0028 - 0x0028)
class UControlInput_smooth final : public UControlInput_modifier
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_smooth">();
	}
	static class UControlInput_smooth* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_smooth>();
	}
};

// VerseClass VerseInput.ControlInput_spawn_particle_effect_action
// 0x0008 (0x0030 - 0x0028)
class UControlInput_spawn_particle_effect_action final : public UVerseInputClientActionBase
{
public:
	class UAssets_particle_system*                __verse_0x1CB585BF_ParticleSystem;                 // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_spawn_particle_effect_action">();
	}
	static class UControlInput_spawn_particle_effect_action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_spawn_particle_effect_action>();
	}
};

// VerseClass VerseInput.ControlInput_swizzle
// 0x0008 (0x0030 - 0x0028)
class UControlInput_swizzle final : public UControlInput_modifier
{
public:
	EControlInput_swizzle_order                   __verse_0x7F4C1D6C_Order;                          // 0x0028(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_swizzle">();
	}
	static class UControlInput_swizzle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_swizzle>();
	}
};

// VerseClass VerseInput.ControlInput_down
// 0x0008 (0x0030 - 0x0028)
class UControlInput_down final : public UControlInput_trigger
{
public:
	double                                        __verse_0x95BB44BB_ActuationThreshold;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_down">();
	}
	static class UControlInput_down* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_down>();
	}
};

// VerseClass VerseInput.ControlInput_hold
// 0x0018 (0x0040 - 0x0028)
class UControlInput_hold final : public UControlInput_trigger
{
public:
	double                                        __verse_0x95BB44BB_ActuationThreshold;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x6D798861_HoldTimeThreshold;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0xD8A724DF_IsOneShot : 1;                  // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_38_1 : 7;                                   // 0x0038(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x6A46DDEB_AffectedByTimeDilation : 1;     // 0x0039(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlInput_hold">();
	}
	static class UControlInput_hold* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlInput_hold>();
	}
};

}

