#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseEngine_0

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VerseNative_0_classes.hpp"
#include "VerseEngine_0_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK
{

// VerseClass VerseEngine.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseEngine_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseEngine.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseEngine_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseEngine_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseEngine.VerseEngine_multicast_delegate_base
// 0x0000 (0x0028 - 0x0028)
class UVerseEngine_multicast_delegate_base : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_multicast_delegate_base">();
	}
	static class UVerseEngine_multicast_delegate_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_multicast_delegate_base>();
	}
};

// VerseClass VerseEngine.VerseEngine_multicast_delegate
// 0x0070 (0x0098 - 0x0028)
class UVerseEngine_multicast_delegate : public UVerseEngine_multicast_delegate_base
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       __verse_0xA72D4FD7__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_N_RBroadcast_L_Nt_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAC026137__L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_N_REmpty; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD8DCC5F0__L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_N_RBroadcast_L_Nt_R(FVerseDynamicProperty_ __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2fmulticast__delegate_N_REmpty(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_multicast_delegate">();
	}
	static class UVerseEngine_multicast_delegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_multicast_delegate>();
	}
};

// VerseClass VerseEngine.VerseEngine_Entity_EntityHelpers
// 0x0000 (0x0028 - 0x0028)
class UVerseEngine_Entity_EntityHelpers final : public UObject
{
public:
	static uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RDestroyObject_L_Nvk__component_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);
	static TOptional<class UEntityComponent*, true> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetComponentOfTypeC_L_Nvk__component_M_NType_20where_20Type_R(const struct VerseEngine_0::Ftuple_Lvk__component_Many_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVerseEngine_Entity_vk_entity*, true> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fEntityHelpers_N_RGetEntityFromComponent_L_Nvk__component_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_Entity_EntityHelpers">();
	}
	static class UVerseEngine_Entity_EntityHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_Entity_EntityHelpers>();
	}
};

// VerseClass VerseEngine.task_VerseEngine_subscribable_event$Await
// 0x0020 (0x0178 - 0x0158)
class Utask_VerseEngine_subscribable_event_Await final : public UConcurrency_task
{
public:
	class UVerseEngine_subscribable_event*        _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseEngine_0::Ftuple_L_R              __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseDynamicProperty_                        _RetVal;                                           // 0x0168(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VerseEngine_subscribable_event$Await">();
	}
	static class Utask_VerseEngine_subscribable_event_Await* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VerseEngine_subscribable_event_Await>();
	}
};

// VerseClass VerseEngine.VerseEngine
// 0x0000 (0x0028 - 0x0028)
class UVerseEngine final : public UObject
{
public:
	static class UClass* _L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fVerse_2eorg_2fVerseEngine_N_Rmulticast__delegate_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fVerse_2eorg_2fVerseEngine_N_Rsubscribable__event_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine">();
	}
	static class UVerseEngine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine>();
	}
};

// VerseClass VerseEngine.VerseEngine_Entity_vk_entity
// 0x00B8 (0x00E0 - 0x0028)
class UVerseEngine_Entity_vk_entity final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x39750A21__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x943F899C__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RRemoveComponent_L_Nvk__component_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x33689819__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RHasComponents_L_N_Ksubtype_Lvk__component_R_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x224FF2E8__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_REnsureComponents_L_N_Ksubtype_Lvk__component_R_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4538B135__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7C70D1BD__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF6EF0A21__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4CE98D4C__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RDestroy; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6167D089__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetName; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x09660D4B__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetFullname; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x95C4EDE3__L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RIsEqual_L_Nvk__entity_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UEntityComponent*, true> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RAddComponent_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RDestroy(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_REnsureComponents_L_N_Ksubtype_Lvk__component_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	TArray<class UEntityComponent*> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetAllComponentsOfType_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	TOptional<class UEntityComponent*, true> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetComponentOfType_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetFullname(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetName(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UEntityComponent*, true> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RGetOrCreateComponentOfType_L_NComponentType_20where_20ComponentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RHasComponents_L_N_Ksubtype_Lvk__component_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RIsEqual_L_Nvk__entity_R(class UVerseEngine_Entity_vk_entity* __verse_0xB2CDDD72_Argument);
	uint8 _L_2fVerse_2eorg_2fVerseEngine_2fEntity_2fvk__entity_N_RRemoveComponent_L_Nvk__component_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_Entity_vk_entity">();
	}
	static class UVerseEngine_Entity_vk_entity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_Entity_vk_entity>();
	}
};

// VerseClass VerseEngine.VerseEngine_multicast_delegate_subscription
// 0x0028 (0x0050 - 0x0028)
class UVerseEngine_multicast_delegate_subscription final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x08089514__L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseEngine_multicast_delegate_base*, true> __verse_0xC5BA7E5B_InternalDelegate; // 0x0040(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fVerse_2eorg_2fVerse_2fcancelable_N_RCancel(const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_multicast_delegate_subscription">();
	}
	static class UVerseEngine_multicast_delegate_subscription* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_multicast_delegate_subscription>();
	}
};

// VerseClass VerseEngine.VerseEngine_subscribable_event
// 0x0038 (0x00D0 - 0x0098)
class UVerseEngine_subscribable_event final : public UVerseEngine_multicast_delegate
{
public:
	FVerseFunctionProperty_                       __verse_0x8DE7DBE5_Await;                          // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x28];                                      // 0x00A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseEngine_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseEngine_subscribable_event">();
	}
	static class UVerseEngine_subscribable_event* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseEngine_subscribable_event>();
	}
};

}

