#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseEnum VerseFortnite.AI_action_result
// NumValues: 0x0004
enum class EAI_action_result : uint8
{
	Success                                  = 0,
	Canceled                                 = 1,
	Disallowed                               = 2,
	AI_action_MAX                            = 3,
};

// VerseEnum VerseFortnite.AI_fallible_action_result
// NumValues: 0x0005
enum class EAI_fallible_action_result : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	Canceled                                 = 2,
	Disallowed                               = 3,
	AI_fallible_action_MAX                   = 4,
};

// VerseEnum VerseFortnite.AI_fort_guard_alert_level
// NumValues: 0x0005
enum class EAI_fort_guard_alert_level : uint8
{
	Unaware                                  = 0,
	Suspicious                               = 1,
	LostTarget                               = 2,
	Alerted                                  = 3,
	AI_fort_guard_alert_MAX                  = 4,
};

// VerseEnum VerseFortnite.AI_fort_obstacle_status
// NumValues: 0x0004
enum class EAI_fort_obstacle_status : uint8
{
	incoming_obstacle                        = 0,
	blocked_by_obstacle                      = 1,
	trap_obstacle                            = 2,
	AI_fort_obstacle_MAX                     = 3,
};

// VerseEnum VerseFortnite.AI_movement_style
// NumValues: 0x0003
enum class EAI_movement_style : uint8
{
	Walking                                  = 0,
	Running                                  = 1,
	AI_movement_MAX                          = 2,
};

// VerseEnum VerseFortnite.AI_navigation_result
// NumValues: 0x0006
enum class EAI_navigation_result : uint8
{
	Reached                                  = 0,
	PartiallyReached                         = 1,
	Interrupted                              = 2,
	Blocked                                  = 3,
	Unreachable                              = 4,
	AI_navigation_MAX                        = 5,
};

// VerseEnum VerseFortnite.AI_play_emote_result
// NumValues: 0x0004
enum class EAI_play_emote_result : uint8
{
	Success                                  = 0,
	Error                                    = 1,
	Interrupted                              = 2,
	AI_play_emote_MAX                        = 3,
};

// VerseEnum VerseFortnite.Animation_PlayAnimation_play_animation_result
// NumValues: 0x0004
enum class EAnimation_PlayAnimation_play_animation_result : uint8
{
	Completed                                = 0,
	Interrupted                              = 1,
	Error                                    = 2,
	Animation_PlayAnimation_play_animation_MAX = 3,
};

// VerseEnum VerseFortnite.Animation_PlayAnimation_play_animation_state
// NumValues: 0x0008
enum class EAnimation_PlayAnimation_play_animation_state : uint8
{
	BlendingIn                               = 0,
	Playing                                  = 1,
	BlendingOut                              = 2,
	Completed                                = 3,
	Stopped                                  = 4,
	Interrupted                              = 5,
	Error                                    = 6,
	Animation_PlayAnimation_play_animation_MAX = 7,
};

// VerseEnum VerseFortnite.Game_teleport_to_result
// NumValues: 0x0008
enum class EGame_teleport_to_result : uint8
{
	Ok                                       = 0,
	UnknownError                             = 1,
	InvalidDestination                       = 2,
	CollidingDestination                     = 3,
	InvalidObject                            = 4,
	ScaleNotAllowed                          = 5,
	DestinationOutOfBounds                   = 6,
	Game_teleport_to_MAX                     = 7,
};

// VerseEnum VerseFortnite.Teams_team_attitude
// NumValues: 0x0004
enum class ETeams_team_attitude : uint8
{
	Friendly                                 = 0,
	Neutral                                  = 1,
	Hostile                                  = 2,
	Teams_team_MAX                           = 3,
};

// VerseStruct VerseFortnite.AI_fort_obstacle_info
// 0x0028 (0x0028 - 0x0000)
struct FAI_fort_obstacle_info final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB0C27E0A_Location;                       // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	EAI_fort_obstacle_status                      __verse_0xFA60180E_Status;                         // 0x0018(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Entity_0::UEntity*                      __verse_0x82A44C52_Obstacle;                       // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.AI_target_info
// 0x0030 (0x0030 - 0x0000)
struct FAI_target_info final
{
public:
	class Entity_0::UEntity*                      __verse_0x459049A1_Target;                         // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x4A328DE2_LastKnownPosition;              // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         __verse_0xAC2B8860_HasLineOfSight : 1;             // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	ETeams_team_attitude                          __verse_0xA972C52D_Attitude;                       // 0x0021(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAI_fort_guard_alert_level                    __verse_0x735E7C84_AlertLevel;                     // 0x0022(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0xD];                                       // 0x0023(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// VerseStruct VerseFortnite.Characters_stasis_args
// 0x0003 (0x0003 - 0x0000)
struct FCharacters_stasis_args final
{
public:
	uint8                                         __verse_0xADC8E6AA_AllowTurning : 1;               // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_0_1 : 7;                                    // 0x0000(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x04C721DA_AllowFalling : 1;               // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_1_1 : 7;                                    // 0x0001(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x178F77CA_AllowEmotes : 1;                // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct VerseFortnite.Game_damage_args
// 0x0018 (0x0018 - 0x0000)
struct FGame_damage_args final
{
public:
	TOptional<class UObject*, true>               __verse_0x8B9AF22A_Instigator;                     // 0x0000(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0xB1B721CE_Source;                         // 0x0008(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        __verse_0x193A13B7_Amount;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.Game_damage_result
// 0x0020 (0x0020 - 0x0000)
struct FGame_damage_result final
{
public:
	class UObject*                                __verse_0x459049A1_Target;                         // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0x193A13B7_Amount;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0x8B9AF22A_Instigator;                     // 0x0010(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0xB1B721CE_Source;                         // 0x0018(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.Game_elimination_result
// 0x0010 (0x0010 - 0x0000)
struct FGame_elimination_result final
{
public:
	class UObject*                                __verse_0xC5F618E8_EliminatedCharacter;            // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0x9B605FD1_EliminatingCharacter;           // 0x0008(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.Game_healing_args
// 0x0018 (0x0018 - 0x0000)
struct FGame_healing_args final
{
public:
	TOptional<class UObject*, true>               __verse_0x8B9AF22A_Instigator;                     // 0x0000(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0xB1B721CE_Source;                         // 0x0008(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	double                                        __verse_0x193A13B7_Amount;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.Game_healing_result
// 0x0020 (0x0020 - 0x0000)
struct FGame_healing_result final
{
public:
	class UObject*                                __verse_0x459049A1_Target;                         // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0x193A13B7_Amount;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0x8B9AF22A_Instigator;                     // 0x0010(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UObject*, true>               __verse_0xB1B721CE_Source;                         // 0x0018(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_L_Kchar_M_Kchar_M_Kchar_R
// 0x0030 (0x0030 - 0x0000)
struct Ftuple_L_Kchar_M_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x932BF92E_Elem2;                          // 0x0020(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_L_Kchar_M_Kchar_R
// 0x0020 (0x0020 - 0x0000)
struct VerseFortnite_0::Ftuple_L_Kchar_M_Kchar_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0010)(InstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFortnite_0::Ftuple_L_Kchar_M_QLevel_Nlog__level_20_3d_20_2e_2e_2e_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_L_Kchar_M_QLevel_Nlog__level_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFortnite_0::Ftuple_L_Kchar_M_QLevel_Nlog__level_R final
{
public:
	FVerseStringProperty_                         __verse_0x18E3F084_Elem0;                          // 0x0000(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<EDiagnostics_log_level>             __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0002)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseFortnite_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lagent_Magent_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lagent_Magent_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lagent_Mentity_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lagent_Mentity_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Entity_0::UEntity*                      __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lagent_Mfloat_Mfloat_R
// 0x0018 (0x0018 - 0x0000)
struct VerseFortnite_0::Ftuple_Lagent_Mfloat_Mfloat_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lagent_Mteam_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lagent_Mteam_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_team*                       __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lagent_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lvector3_Mrotation_R
// 0x0040 (0x0040 - 0x0000)
struct VerseFortnite_0::Ftuple_Lvector3_Mrotation_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0x7D844C3C_Elem1;                          // 0x0020(0x0020)(InstancedReference, NoDestructor)
};

// VerseStruct VerseFortnite.tuple_Lagent_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R
// 0x0050 (0x0050 - 0x0000)
struct Ftuple_Lagent_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R final
{
public:
	class USimulation_agent*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct VerseFortnite_0::Ftuple_Lvector3_Mrotation_R __verse_0x932BF92E_Elem2;                    // 0x0010(0x0040)(InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lanimation__sequence_M_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0048 (0x0048 - 0x0000)
struct Ftuple_Lanimation__sequence_M_QPlayRate_Nfloat_20_3d_20_2e_2e_2e_M_QStartPositionSeconds_Nfloat_20_3d_20_2e_2e_2e_M_QBlendInTime_Nfloat_20_3d_20_2e_2e_2e_M_QBlendOutTime_Nfloat_20_3d_20_2e_2e_2e_R final
{
public:
	class UAssets_animation_sequence*             __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x932BF92E_Elem2;                          // 0x0018(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0xF64C4596_Elem3;                          // 0x0028(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x4F74920B_Elem4;                          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lanimation__sequence_Mplay__animation__instance_Mlogic_Mfloat_Mfloat_Mfloat_Mfloat_R
// 0x0038 (0x0038 - 0x0000)
struct Ftuple_Lanimation__sequence_Mplay__animation__instance_Mlogic_Mfloat_Mfloat_Mfloat_Mfloat_R final
{
public:
	class UAssets_animation_sequence*             __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnimation_PlayAnimation_play_animation_instance* __verse_0x7D844C3C_Elem1;                // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x932BF92E_Elem2 : 1;                      // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __verse_0xF64C4596_Elem3;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4F74920B_Elem4;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x2A132EB3_Elem5;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0xC4BC9BA1_Elem6;                          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lentity_Mentity_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lentity_Mentity_R final
{
public:
	class Entity_0::UEntity*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Entity_0::UEntity*                      __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lentity_Mteam__tag_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lentity_Mteam__tag_R final
{
public:
	class Entity_0::UEntity*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTeams_team_tag*                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lentity_Mteam_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lentity_Mteam_R final
{
public:
	class Entity_0::UEntity*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_team*                       __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lentity_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lentity_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class Entity_0::UEntity*                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class UObject*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lfort__guard__alert__level_Mdamage__perception__settings_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lfort__guard__alert__level_Mdamage__perception__settings_R final
{
public:
	EAI_fort_guard_alert_level                    __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAI_damage_perception_settings*         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lfort__guard__alert__level_Mhearing__perception__settings_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lfort__guard__alert__level_Mhearing__perception__settings_R final
{
public:
	EAI_fort_guard_alert_level                    __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAI_hearing_perception_settings*        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lfort__guard__alert__level_Msight__perception__settings_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lfort__guard__alert__level_Msight__perception__settings_R final
{
public:
	EAI_fort_guard_alert_level                    __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAI_sight_perception_settings*          __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lfort__guard__alert__level_Mtouch__perception__settings_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lfort__guard__alert__level_Mtouch__perception__settings_R final
{
public:
	EAI_fort_guard_alert_level                    __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAI_touch_perception_settings*          __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lgame__action__instigator_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lgame__action__instigator_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class UObject*                                __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
// 0x0028 (0x0028 - 0x0000)
struct VerseFortnite_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R final
{
public:
	class UAI_navigation_target*                  __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UAI_movement_type*, true>     __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<double>                             __verse_0x932BF92E_Elem2;                          // 0x0010(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<uint8>                              __verse_0xF64C4596_Elem3;                          // 0x0020(0x0002)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lplayer_Mtuple_L_R_Mplayer_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lplayer_Mtuple_L_R_Mplayer_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player*                     __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lplayer_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	class USimulation_player*                     __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0009(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Ltarget__info_Mtuple_L_R_Mtuple_L_R_R
// 0x0038 (0x0038 - 0x0000)
struct VerseFortnite_0::Ftuple_Ltarget__info_Mtuple_L_R_Mtuple_L_R_R final
{
public:
	struct FAI_target_info                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0030)(InstancedReference, NoDestructor)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x7D844C3C_Elem1;                          // 0x0030(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0x932BF92E_Elem2;                          // 0x0031(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lteam__tag_Mteam_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lteam__tag_Mteam_R final
{
public:
	class UTeams_team_tag*                        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_team*                       __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lteam_Mteam_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lteam_Mteam_R final
{
public:
	class USimulation_team*                       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_team*                       __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseFortnite.tuple_Lteleport__to__result_Mtransform_R
// 0x0070 (0x0070 - 0x0000)
struct VerseFortnite_0::Ftuple_Lteleport__to__result_Mtransform_R final
{
public:
	EGame_teleport_to_result                      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0060)(InstancedReference, NoDestructor)
};

// VerseStruct VerseFortnite.tuple_Lvector3_Mfloat_Mfloat_R
// 0x0028 (0x0028 - 0x0000)
struct VerseFortnite_0::Ftuple_Lvector3_Mfloat_Mfloat_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0x18E3F084_Elem0;                          // 0x0000(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x932BF92E_Elem2;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

