#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseDevices_0

#include "Basic.hpp"

#include "VerseAssets_0_classes.hpp"
#include "VerseDevices_0_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "UnrealEngineExperimental_0_classes.hpp"
#include "VerseFortnite_0_structs.hpp"
#include "VerseNative_structs.hpp"
#include "VerseDevices_classes.hpp"
#include "VerseColors_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseNative_0_classes.hpp"
#include "EpicGamesTemporary_structs.hpp"


namespace SDK
{

// VerseClass VerseDevices.Devices_function_parameter_base
// 0x0000 (0x0028 - 0x0028)
class UDevices_function_parameter_base : public UObject
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_base">();
	}
	static class UDevices_function_parameter_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_base>();
	}
};

// VerseClass VerseDevices.Devices_function_parameter_float
// 0x0008 (0x0030 - 0x0028)
class UDevices_function_parameter_float final : public UDevices_function_parameter_base
{
public:
	double                                        __verse_0x31A8F10C_Value;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_float">();
	}
	static class UDevices_function_parameter_float* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_float>();
	}
};

// VerseClass VerseDevices.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseDevices_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseDevices.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseDevices_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseDevices_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseDevices.Devices_creative_device
// 0x00B8 (0x0170 - 0x00B8)
class alignas(0x10) UDevices_creative_device final : public UVerseCreativeDevice
{
public:
	FVerseFunctionProperty_                       __verse_0x1F792AAA_OnBegin;                        // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3DFFEDE4__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0AA415A9__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x826ED8B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x592F1135__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x57F532B5__L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x873CD458__L_2fFortnite_2ecom_2fDevices_2fcreative__object__interface_N_RGetPlayspaceEpicInternal; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UObject*, true>               __verse_0x0B6F4FC4_PlayspaceEpicInternal;          // 0x0160(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RHide(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_ROnEnd(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RShow(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__device_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fDevices_2fcreative__object__interface_N_RGetPlayspaceEpicInternal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Ntransform_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Ltransform_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device">();
	}
	static class UDevices_creative_device* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device>();
	}
};

// VerseClass VerseDevices.Devices
// 0x0008 (0x0030 - 0x0028)
class UDevices final : public UObject
{
public:
	class UDevices_creative_prop_asset*           __verse_0x88F30926_DefaultCreativePropAsset;       // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* _L_2fFortnite_2ecom_2fDevices_N_Rdevice__event(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	static class UClass* _L_2fFortnite_2ecom_2fDevices_N_Rdevice__event_L_Nt_20where_20t_R(class UClass* __verse_0xB2CDDD72_Argument);
	static TArray<class UObject*> _L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTag_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	static TArray<class UObject*> _L_2fFortnite_2ecom_2fDevices_N_RGetCreativeObjectsWithTags_L_Ntag__search__criteria_R(class UTags_tag_search_criteria* __verse_0xB2CDDD72_Argument);
	static EDevices_move_to_result _L_2fFortnite_2ecom_2fDevices_N_RHandleMoveToInternalResult_L_Nmove__to__internal__result_R(EDevices_move_to_internal_result __verse_0xB2CDDD72_Argument);
	static TOptional<class Entity_0::UEntity*, true> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetEntity_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetPlayspace_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class Usimulation_entity*, true> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetSimulationEntity_U_L_Ncreative__device_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__device_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class Usimulation_entity*, true> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetSimulationEntity_U_L_Ncreative__object_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static class UObject* _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTags_U_L_Ncreative__object__interface_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__object__interface_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FSpatialMath_transform _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eGetTransformInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_R_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_R_R& __verse_0xB2CDDD72_Argument);
	static EGame_teleport_to_result _L_2fFortnite_2ecom_2fDevices_N_Roperator_U_2eTeleportToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntransform_R(const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static struct Ftuple_L_Qcreative__prop_Mspawn__prop__result_R _L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Ntransform_R(const struct Ftuple_Lcreative__prop__asset_Mtransform_R& __verse_0xB2CDDD72_Argument);
	static struct Ftuple_L_Qcreative__prop_Mspawn__prop__result_R _L_2fFortnite_2ecom_2fDevices_N_RSpawnProp_L_Ncreative__prop__asset_M_Nvector3_M_Nrotation_R(const struct Ftuple_Lcreative__prop__asset_Mvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	static FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_N_RToString_L_Nmove__to__internal__result_R(EDevices_move_to_internal_result __verse_0xB2CDDD72_Argument);
	static struct FDevices_device_ai_interaction_result Devices_device_ai_interaction_result_Factory();
	static struct FDevices_device_ai_interaction_result Devices_device_ai_interaction_result_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static class UConcurrency_task* operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R& __verse_0xB2CDDD72_Argument);
	static class UConcurrency_task* operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Lvector3_Mrotation_Mfloat_R_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Lvector3_Mrotation_Mfloat_R_R& __verse_0xB2CDDD72_Argument);
	static class UConcurrency_task* operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices">();
	}
	static class UDevices* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_base
// 0x0010 (0x0038 - 0x0028)
class UDevices_device_function_set_base : public UObject
{
public:
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_base">();
	}
	static class UDevices_device_function_set_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_base>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_float
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_float final : public UDevices_device_function_set_base
{
public:
	FVerseFunctionProperty_                       __verse_0xBE6D2C82__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__float_N_RInvoke_L_Nfloat_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__float_N_RInvoke_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_float">();
	}
	static class UDevices_device_function_set_float* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_float>();
	}
};

// VerseClass VerseDevices.Devices_creative_device_asset
// 0x0000 (0x00C8 - 0x00C8)
class UDevices_creative_device_asset final : public UAssets_asset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device_asset">();
	}
	static class UDevices_creative_device_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device_asset>();
	}
};

// VerseClass VerseDevices.Devices_creative_object
// 0x0070 (0x0130 - 0x00C0)
#pragma pack(push, 0x1)
class alignas(0x10) UDevices_creative_object : public UVerseCreativeObject
{
public:
	FVerseFunctionProperty_                       __verse_0x5139375F__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0A483613__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CEDCD6B_MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3F1971E6_MoveTo_L_Ntransform_M_Nfloat_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x49B5636B__L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RSetTeam_L_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_20255_7d_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x873CD458__L_2fFortnite_2ecom_2fDevices_2fcreative__object__interface_N_RGetPlayspaceEpicInternal; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fFortnite_2ecom_2fDevices_2fcreative__object__interface_N_RGetPlayspaceEpicInternal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RSetTeam_L_Ntype_7b__X_Nint_20where_200_20_3c_3d_20__X_M_20__X_20_3c_3d_20255_7d_R(int64 __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__object_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseDevices_0::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Ntransform_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Ltransform_Mfloat_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveTo_L_Nvector3_M_Nrotation_M_Nfloat_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct Ftuple_Lvector3_Mrotation_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_object">();
	}
	static class UDevices_creative_object* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_object>();
	}
};
#pragma pack(pop)

// VerseClass VerseDevices.Devices_device_function_set_multi_parameter_base
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_multi_parameter_base : public UDevices_device_function_set_base
{
public:
	TOptional<class UClass*>                      __verse_0xBF5FC553_ReturnType;                     // 0x0038(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_multi_parameter_base">();
	}
	static class UDevices_device_function_set_multi_parameter_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_multi_parameter_base>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_params_by_name
// 0x0060 (0x00A8 - 0x0048)
class UDevices_device_function_set_params_by_name : public UDevices_device_function_set_multi_parameter_base
{
public:
	FVerseFunctionProperty_                       __verse_0xD67AF8BF__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name_N_RInvoke_L_N_5b_Kchar_5dfunction__parameter__base_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	TMap<FVerseStringProperty_, class UClass*>    __verse_0x8F623C81_ParameterTypes;                 // 0x0058(0x0050)(InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UDevices_function_parameter_base*, true> _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name_N_RInvoke_L_N_5b_Kchar_5dfunction__parameter__base_R(const TMap<FVerseStringProperty_, class UDevices_function_parameter_base*>& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_params_by_name">();
	}
	static class UDevices_device_function_set_params_by_name* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_params_by_name>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_params_by_name_const
// 0x0010 (0x00B8 - 0x00A8)
class UDevices_device_function_set_params_by_name_const final : public UDevices_device_function_set_params_by_name
{
public:
	FVerseFunctionProperty_                       __verse_0xE5C254F3__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name__const_N_RInvokeConst_L_N_5b_Kchar_5dfunction__parameter__base_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class UDevices_function_parameter_base*, true> _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__params__by__name__const_N_RInvokeConst_L_N_5b_Kchar_5dfunction__parameter__base_R(const TMap<FVerseStringProperty_, class UDevices_function_parameter_base*>& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_params_by_name_const">();
	}
	static class UDevices_device_function_set_params_by_name_const* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_params_by_name_const>();
	}
};

// VerseClass VerseDevices.Devices_creative_prop
// 0x0080 (0x01B0 - 0x0130)
class UDevices_creative_prop final : public UDevices_creative_object
{
public:
	FVerseFunctionProperty_                       __verse_0xB6F57275__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsDisposed; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC4FF6975__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7DCCC181__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_M_N_QIndex_Nint_20_3d_20_2e_2e_2e_R; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6E31A773__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow; // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x60EB84F3__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide; // 0x0168(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x909F40CD__L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden; // 0x0178(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E6B9248__L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid; // 0x0188(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5201150D__L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose; // 0x0198(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RHide(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsDisposed(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RIsHidden(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMaterial_L_Nmaterial_M_N_QIndex_Nint_20_3d_20_2e_2e_2e_R(const struct Ftuple_Lmaterial_M_QIndex_Nint_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RSetMesh_L_Nmesh_R(class UAssets_mesh* __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__prop_N_RShow(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fVerse_2eorg_2fVerse_2fdisposable_N_RDispose(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fVerse_2eorg_2fVerse_2finvalidatable_N_RIsValid(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop">();
	}
	static class UDevices_creative_prop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop>();
	}
};

// VerseClass VerseDevices.Devices_device_event
// 0x0060 (0x0088 - 0x0028)
class UDevices_device_event : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0xD8DCC5F0__L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8DE7DBE5_Await;                          // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0x21011A72_EventName;                      // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_58[0x30];                                      // 0x0058(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event">();
	}
	static class UDevices_device_event* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event>();
	}
};

// VerseClass VerseDevices.Devices_device_event_agent
// 0x0000 (0x0088 - 0x0088)
class UDevices_device_event_agent final : public UDevices_device_event
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event_agent">();
	}
	static class UDevices_device_event_agent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event_agent>();
	}
};

// VerseClass VerseDevices.Devices_creative_device_base
// 0x0020 (0x0150 - 0x0130)
class UDevices_creative_device_base final : public UDevices_creative_object
{
public:
	FVerseFunctionProperty_                       __verse_0x0182371F__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E46A055__L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RHide__Internal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fcreative__device__base_N_RShow__Internal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_device_base">();
	}
	static class UDevices_creative_device_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_device_base>();
	}
};

// VerseClass VerseDevices.task_Devices$operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R
// 0x0308 (0x0460 - 0x0158)
class Utask_Devices_operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R final : public UConcurrency_task
{
public:
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R __verse_0xB2CDDD72_Argument; // 0x0160(0x0080)(Parm, NoDestructor, HasGetValueTypeHash)
	EDevices_move_to_result                       _RetVal;                                           // 0x01E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDevices_move_to_internal_result              __verse_0x95D09D0E_Result_1;                       // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_0;                                      // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_1;                                 // 0x01F0(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R _ExprResult_2; // 0x0200(0x0080)(NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_3;                                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0xF];                                      // 0x0281(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Ltransform_Mfloat_R             _ExprResult_4;                                     // 0x0290(0x0070)(NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_5;                                    // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0308(0x0010)(HasGetValueTypeHash)
	EDevices_move_to_internal_result              __verse_0x95D09D0E_Result_2;                       // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      _AsyncTask_7;                                      // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_8;                                 // 0x0328(0x0010)(HasGetValueTypeHash)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R _ExprResult_9; // 0x0340(0x0080)(NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_10;                                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0xF];                                      // 0x03C1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Ltransform_Mfloat_R             _ExprResult_11;                                    // 0x03D0(0x0070)(NoDestructor, HasGetValueTypeHash)
	int64                                         _AsyncResult_12;                                   // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x0448(0x0010)(HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Devices$operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R">();
	}
	static class Utask_Devices_operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Devices_operator_U_2eMoveToInternal_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R>();
	}
};

// VerseClass VerseDevices.Devices_device_function_get_base
// 0x0010 (0x0038 - 0x0028)
class UDevices_device_function_get_base : public UObject
{
public:
	FVerseStringProperty_                         __verse_0xF8B4D924_FunctionName;                   // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_base">();
	}
	static class UDevices_device_function_get_base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_base>();
	}
};

// VerseClass VerseDevices.Devices_device_function_get_logic
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_logic final : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0x546054FC__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__logic_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__logic_N_RInvoke(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_logic">();
	}
	static class UDevices_device_function_get_logic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_logic>();
	}
};

// VerseClass VerseDevices.Devices_creative_object_interface
// 0x0000 (0x0028 - 0x0028)
class UDevices_creative_object_interface final : public UObject
{
public:
	class UObject* _L_2fFortnite_2ecom_2fDevices_2fcreative__object__interface_N_RGetPlayspaceEpicInternal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_object_interface">();
	}
	static class UDevices_creative_object_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_object_interface>();
	}
};

// VerseClass VerseDevices.Devices_device_event_vehicle
// 0x0000 (0x0088 - 0x0088)
class UDevices_device_event_vehicle final : public UDevices_device_event
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event_vehicle">();
	}
	static class UDevices_device_event_vehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event_vehicle>();
	}
};

// VerseClass VerseDevices.Devices_creative_prop_asset
// 0x0000 (0x0090 - 0x0090)
class UDevices_creative_prop_asset final : public UVerseCreativePropAsset
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop_asset">();
	}
	static class UDevices_creative_prop_asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop_asset>();
	}
};

// VerseClass VerseDevices.task_Devices_creative_device$OnBegin
// 0x0010 (0x0168 - 0x0158)
class Utask_Devices_creative_device_OnBegin final : public UConcurrency_task
{
public:
	class UDevices_creative_device*               _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_Devices_creative_device$OnBegin">();
	}
	static class Utask_Devices_creative_device_OnBegin* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_Devices_creative_device_OnBegin>();
	}
};

// VerseClass VerseDevices.Devices_device_function_get_vector3
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_vector3 final : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0xED077618__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__vector3_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	struct FSpatialMath_vector3 _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__vector3_N_RInvoke(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_vector3">();
	}
	static class UDevices_device_function_get_vector3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_vector3>();
	}
};

// VerseClass VerseDevices.Devices_device_event_optional_agent
// 0x0000 (0x0088 - 0x0088)
class UDevices_device_event_optional_agent final : public UDevices_device_event
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event_optional_agent">();
	}
	static class UDevices_device_event_optional_agent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event_optional_agent>();
	}
};

// VerseClass VerseDevices.Devices_creative_prop_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_creative_prop_debug_log final : public UDiagnostics_log_channel
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_creative_prop_debug_log">();
	}
	static class UDevices_creative_prop_debug_log* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_creative_prop_debug_log>();
	}
};

// VerseClass VerseDevices.Devices_CreativeAnimation
// 0x0000 (0x0028 - 0x0028)
class UDevices_CreativeAnimation final : public UObject
{
public:
	static struct Ftuple_L_Qanimation__controller_Mget__animation__controller__result_R _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_RGetAnimationController_L_Ncreative__movable__object__base_R(class UVerseMovableObjectBase* __verse_0xB2CDDD72_Argument);
	static TOptional<class UDevices_CreativeAnimation_animation_controller*, true> _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_N_Roperator_U_2eGetAnimationController_U_L_Ncreative__prop_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct Ftuple_Lcreative__prop_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FDevices_CreativeAnimation_cubic_bezier_parameters Devices_CreativeAnimation_cubic_bezier_parameters_Factory();
	static struct FDevices_CreativeAnimation_cubic_bezier_parameters Devices_CreativeAnimation_cubic_bezier_parameters_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FDevices_CreativeAnimation_keyframe_delta Devices_CreativeAnimation_keyframe_delta_Factory();
	static struct FDevices_CreativeAnimation_keyframe_delta Devices_CreativeAnimation_keyframe_delta_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation">();
	}
	static class UDevices_CreativeAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation>();
	}
};

// VerseClass VerseDevices.Devices_CreativeAnimation_animation_controller
// 0x0140 (0x0168 - 0x0028)
class UDevices_CreativeAnimation_animation_controller final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x0E85E6FA__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x053E8BA6_AwaitNextKeyframe;              // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5D81E59F__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B727DF3__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlay; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1A1EC93E__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E385FBF__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPause; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDF78CD56__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x230023B8__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStop; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4A2A0F34__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDCA25E7B__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xECB7EA34__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_N_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x30521B48__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RToString_L_Nset__animation__result_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8C3C09A2__L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimation_L_N_Kkeyframe__delta_M_N_QMode_Nanimation__mode_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UDiagnostics_log*                       __verse_0x63A8D5FA_DebugLog;                       // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0x1A3A2D49_KeyframeReachedEvent;           // 0x0100(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xEC8DE8C6_MovementCompleteEvent;          // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                __verse_0xDE60FD58_StateChangedEvent;              // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_118[0x50];                                     // 0x0118(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	EDevices_CreativeAnimation_animation_controller_state _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RGetState(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RIsValid(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RLogPlayStopPauseResultIfError_L_N_Kchar_M_Nplaystoppause__result_R(const struct Ftuple_L_Kchar_Mplaystoppause__result_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPause(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	EDevices_CreativeAnimation_playstoppause_result _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPauseInternal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlay(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	EDevices_CreativeAnimation_playstoppause_result _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RPlayInternal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimation_L_N_Kkeyframe__delta_M_N_QMode_Nanimation__mode_R(const struct Ftuple_L_Kkeyframe__delta_M_QMode_Nanimation__mode_R& __verse_0xB2CDDD72_Argument);
	EDevices_CreativeAnimation_set_animation_result _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RSetAnimationInternal_L_N_Kkeyframe__delta_M_N_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R(const struct Ftuple_L_Kkeyframe__delta_M_QAnimationMode_Nanimation__mode_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStop(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	EDevices_CreativeAnimation_playstoppause_result _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RStopInternal(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fFortnite_2ecom_2fDevices_2fCreativeAnimation_2fanimation__controller_N_RToString_L_Nset__animation__result_R(EDevices_CreativeAnimation_set_animation_result __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* AwaitNextKeyframe(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_animation_controller">();
	}
	static class UDevices_CreativeAnimation_animation_controller* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_animation_controller>();
	}
};

// VerseClass VerseDevices.Devices_function_parameter_int
// 0x0008 (0x0030 - 0x0028)
class UDevices_function_parameter_int final : public UDevices_function_parameter_base
{
public:
	int64                                         __verse_0x31A8F10C_Value;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_int">();
	}
	static class UDevices_function_parameter_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_int>();
	}
};

// VerseClass VerseDevices.Devices_CreativeAnimation_animation_controller_debug_log
// 0x0000 (0x0028 - 0x0028)
class UDevices_CreativeAnimation_animation_controller_debug_log final : public UDiagnostics_log_channel
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_animation_controller_debug_log">();
	}
	static class UDevices_CreativeAnimation_animation_controller_debug_log* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_animation_controller_debug_log>();
	}
};

// VerseClass VerseDevices.Devices_function_parameter_logic
// 0x0008 (0x0030 - 0x0028)
class UDevices_function_parameter_logic final : public UDevices_function_parameter_base
{
public:
	uint8                                         __verse_0x31A8F10C_Value : 1;                      // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_logic">();
	}
	static class UDevices_function_parameter_logic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_logic>();
	}
};

// VerseClass VerseDevices.Devices_device_function_set_message
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_set_message final : public UDevices_device_function_set_base
{
public:
	FVerseFunctionProperty_                       __verse_0xEE3C8C22__L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__message_N_RInvoke_L_Nmessage_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fDevices_2fdevice__function__set__message_N_RInvoke_L_Nmessage_R(class UVerse_message* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_set_message">();
	}
	static class UDevices_device_function_set_message* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_set_message>();
	}
};

// VerseClass VerseDevices.Devices_device_function_get_agent
// 0x0010 (0x0048 - 0x0038)
class UDevices_device_function_get_agent final : public UDevices_device_function_get_base
{
public:
	FVerseFunctionProperty_                       __verse_0x2376EEDD__L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__agent_N_RInvoke; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class USimulation_agent*, true> _L_2fFortnite_2ecom_2fDevices_2fdevice__function__get__agent_N_RInvoke(const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_function_get_agent">();
	}
	static class UDevices_device_function_get_agent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_function_get_agent>();
	}
};

// VerseClass VerseDevices.Devices_CreativeAnimation_InterpolationTypes
// 0x00A0 (0x00C8 - 0x0028)
class UDevices_CreativeAnimation_InterpolationTypes final : public UObject
{
public:
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x9B27EB9D_Linear;             // 0x0028(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x9CD14C25_Ease;               // 0x0048(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0xB345298C_EaseIn;             // 0x0068(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0xF59E2BD2_EaseOut;            // 0x0088(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	struct FDevices_CreativeAnimation_cubic_bezier_parameters __verse_0x29A389AE_EaseInOut;          // 0x00A8(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_CreativeAnimation_InterpolationTypes">();
	}
	static class UDevices_CreativeAnimation_InterpolationTypes* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_CreativeAnimation_InterpolationTypes>();
	}
};

// VerseClass VerseDevices.Devices_function_parameter_vector3
// 0x0018 (0x0040 - 0x0028)
class UDevices_function_parameter_vector3 final : public UDevices_function_parameter_base
{
public:
	struct FSpatialMath_vector3                   __verse_0x31A8F10C_Value;                          // 0x0028(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_function_parameter_vector3">();
	}
	static class UDevices_function_parameter_vector3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_function_parameter_vector3>();
	}
};

// VerseClass VerseDevices.Devices_device_event_agent_float
// 0x0000 (0x0088 - 0x0088)
class UDevices_device_event_agent_float final : public UDevices_device_event
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event_agent_float">();
	}
	static class UDevices_device_event_agent_float* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event_agent_float>();
	}
};

// VerseClass VerseDevices.Devices_device_event_agent_int
// 0x0000 (0x0088 - 0x0088)
class UDevices_device_event_agent_int final : public UDevices_device_event
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fVerse_2eorg_2fVerse_2fsubscribable_N_RSubscribe_L_Nt_Tvoid_R(FVerseFunctionProperty_ __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Await(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseDevices_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Devices_device_event_agent_int">();
	}
	static class UDevices_device_event_agent_int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDevices_device_event_agent_int>();
	}
};

// VerseClass VerseDevices.task_Devices$operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R
// 0x0CB8 (0x0E10 - 0x0158)
class Utask_Devices_operator_U_2eMoveToInternalImpl_U_L_Ncreative__movable__object__base_M_Ntuple_L_R_M_Ntuple_Ltransform_Mfloat_R_R final : public UConcurrency_task
{
public:
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_Ltransform_Mfloat_R_R __verse_0xB2CDDD72_Argument; // 0x0160(0x0080)(Parm, NoDestructor, HasGetValueTypeHash)
	EDevices_move_to_internal_result              _RetVal;                                           // 0x01E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<double>                             _ExprResultStack_0;                                // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Ftuple_L_Qanimation__controller_Mget__animation__controller__result_R __verse_0xA8BECD0D_GetControllerResult_1; // 0x01F8(0x0010)(NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0208(0x0010)(HasGetValueTypeHash)
	class UDevices_CreativeAnimation_animation_controller* __verse_0x995129C4_Controller_4;          // 0x0218(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UDevices_CreativeAnimation_animation_controller*, true> _ExprResultStack_2;      // 0x0220(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 __verse_0x80B800AD_CurrentTransform_4;             // 0x0230(0x0060)(NoDestructor)
	FVerseFunctionProperty_                       _Callee_3;                                         // 0x0290(0x0010)(HasGetValueTypeHash)
	struct Ftuple_Lcreative__movable__object__base_Mtuple_L_R_Mtuple_L_R_R _ExprResult_4;            // 0x02A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_5;                                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseDevices_0::Ftuple_L_R             _ExprResult_6;                                     // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDevices_CreativeAnimation_keyframe_delta> __verse_0xB23BEFD6_KeyframeArray_4;     // 0x02B8(0x0010)(ContainsInstancedReference)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDevices_CreativeAnimation_keyframe_delta _ExprResult_7;                                  // 0x02D0(0x0080)(NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_8;                                // 0x0350(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x03A0(0x0010)(HasGetValueTypeHash)
