#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseBasicGameplay

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseBasicGameplay_structs.hpp"
#include "VerseNative_structs.hpp"


namespace SDK::Params
{

// Function VerseBasicGameplay.task_VerseBasicGameplay_PlayerManager_basic_player_manager_impl$BeginWaitingForEvents.Update
// 0x0008 (0x0008 - 0x0000)
struct task_VerseBasicGameplay_PlayerManager_basic_player_manager_impl_BeginWaitingForEvents_Update final
{
public:
	int64                                         RetVal;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseBasicGameplay.VerseBasicGameplay_PlayerManager._L_2fUnrealEngine_2ecom_2fTemporary_2fVerseBasicGameplay_2fPlayerManager_N_RGetPlayerManagerForLocation_L_Nvector3_R
// 0x02A8 (0x02A8 - 0x0000)
struct VerseBasicGameplay_PlayerManager__L_2fUnrealEngine_2ecom_2fTemporary_2fVerseBasicGameplay_2fPlayerManager_N_RGetPlayerManagerForLocation_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<class UVerseBasicGameplay_PlayerManager_basic_player_manager*, true> RetVal;           // 0x0018(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__1;                             // 0x0020(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseEngine_Entity_vk_entity*, true> __verse_0xE3700E84_MaybeEntity_2;          // 0x0028(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0030(0x0010)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_Lvector3_M_Kchar_R _ExprResult_1;                              // 0x0040(0x0028)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0068(0x0010)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x5F5E89D8_ValidEntity_3;                  // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_3;                        // 0x0080(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x0A5C85D0_PosComp_3;                  // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _FallibleType_4;              // 0x0090(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_5;                                // 0x0098(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_6;                                     // 0x00A0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__4;                             // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_7;                                         // 0x00B0(0x0010)(HasGetValueTypeHash)
	class UPlayspace_playspace_component*         __verse_0x9F23064A_ThePlayspaceComp_3;             // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UPlayspace_playspace_component*, true> _FallibleType_8;                          // 0x00C8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_9;                                // 0x00D0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_10;                                    // 0x00D8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__5;                             // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_11;                                        // 0x00E8(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__7;                         // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_12;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_13;                                        // 0x0108(0x0010)(HasGetValueTypeHash)
	class UVerseBasicGameplay_PlayerManager_basic_player_manager_impl* __verse_0xD8BFBA84_BasicPlayerManager_6; // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_14;                               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayspace_playspace_component*         __verse_0xBC454097_ThePlayspace_15;                // 0x0128(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseBasicGameplay_PlayerManager_basic_player_manager_impl* __verse_0x00000000__8;        // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_16;                                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_17;                                // 0x0140(0x0010)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_18;                                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_19;                                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_20 : 1;                                // 0x0160(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_21;                               // 0x0161(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseFalse>                        __verse_0x00000000__10;                            // 0x0163(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UVerseEngine_Entity_vk_entity*, true> __verse_0xE3700E84_MaybeEntity_11;         // 0x0168(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_22;                                        // 0x0170(0x0010)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_Lvector3_M_Kchar_R _ExprResult_23;                             // 0x0180(0x0028)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_24;                                    // 0x01A8(0x0010)(HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x5F5E89D8_ValidEntity_12;                 // 0x01B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVerseEngine_Entity_vk_entity*, true> _ExprResultStack_25;                       // 0x01C0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x0A5C85D0_PosComp_12;                 // 0x01C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UVGameplayRst_Transform_position_component*, true> _FallibleType_26;             // 0x01D0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_27;                               // 0x01D8(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_28;                                    // 0x01E0(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__13;                            // 0x01E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_29;                                        // 0x01F0(0x0010)(HasGetValueTypeHash)
	class UPlayspace_playspace_component*         __verse_0x9F23064A_ThePlayspaceComp_12;            // 0x0200(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TOptional<class UPlayspace_playspace_component*, true> _FallibleType_30;                         // 0x0208(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResultStack_31;                               // 0x0210(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class UEntityComponent*, true>      _ExprResult_32;                                    // 0x0218(0x0008)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UVerseEngine_Entity_vk_entity*          __verse_0x00000000__14;                            // 0x0220(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_33;                                        // 0x0228(0x0010)(HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x00000000__16;                        // 0x0238(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EVerseTrue                                    _InvokeSureResultDummy_34;                         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FVerseFunctionProperty_                       _Callee_35;                                        // 0x0248(0x0010)(HasGetValueTypeHash)
	class UVerseBasicGameplay_PlayerManager_basic_player_manager_impl* __verse_0xD8BFBA84_BasicPlayerManager_15; // 0x0258(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_36;                               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayspace_playspace_component*         __verse_0xBC454097_ThePlayspace_37;                // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseBasicGameplay_PlayerManager_basic_player_manager_impl* __verse_0x00000000__17;       // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConcurrency_task*                      _AsyncTask_38;                                     // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _AsyncTaskClass_39;                                // 0x0280(0x0010)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_40;                                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         _AsyncResult_41;                                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_42 : 1;                                // 0x02A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	TOptional<EVerseFalse>                        _ExprResultStack_43;                               // 0x02A1(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseBasicGameplay.VerseBasicGameplay_PlayerManager_basic_player_manager._L_2fUnrealEngine_2ecom_2fTemporary_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayerCount
// 0x0040 (0x0040 - 0x0000)
struct VerseBasicGameplay_PlayerManager_basic_player_manager__L_2fUnrealEngine_2ecom_2fTemporary_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayerCount final
{
public:
	struct VerseBasicGameplay::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayspace_playspace_component*         __verse_0x00000000__1;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_0;                                         // 0x0018(0x0010)(HasGetValueTypeHash)
	class UPlayspace_playspace_component*         __verse_0x00000000__2;                             // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_1;                                         // 0x0030(0x0010)(HasGetValueTypeHash)
};

// Function VerseBasicGameplay.VerseBasicGameplay_PlayerManager_basic_player_manager._L_2fUnrealEngine_2ecom_2fTemporary_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayers
// 0x0108 (0x0108 - 0x0000)
struct VerseBasicGameplay_PlayerManager_basic_player_manager__L_2fUnrealEngine_2ecom_2fTemporary_2fVerseBasicGameplay_2fPlayerManager_2fbasic__player__manager_N_RGetPlayers final
{
public:
	struct VerseBasicGameplay::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player*>             RetVal;                                            // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class USimulation_player*>             _ForResult_0;                                      // 0x0018(0x0010)(ContainsInstancedReference)
	TArray<class USimulation_player_component*>   _ForIterable_1;                                    // 0x0028(0x0010)(ContainsInstancedReference)
	class UPlayspace_playspace_component*         __verse_0x00000000__3;                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_2;                                         // 0x0040(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_3;                                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_4;                                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x1AA69DA0_PlayerComp_4;                   // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player*                     _ExprResult_5;                                     // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x00000000__7;                             // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_6;                                         // 0x0078(0x0010)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_7;                                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USimulation_player*>             _ForResult_8;                                      // 0x0090(0x0010)(ContainsInstancedReference)
	TArray<class USimulation_player_component*>   _ForIterable_9;                                    // 0x00A0(0x0010)(ContainsInstancedReference)
	class UPlayspace_playspace_component*         __verse_0x00000000__10;                            // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_10;                                        // 0x00B8(0x0010)(HasGetValueTypeHash)
	int64                                         _ForIndex_11;                                      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         _ForLength_12;                                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x1AA69DA0_PlayerComp_11;                  // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player*                     _ExprResult_13;                                    // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimulation_player_component*           __verse_0x00000000__14;                            // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       _Callee_14;                                        // 0x00F0(0x0010)(HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         _ExprResult_15;                                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseBasicGameplay.VerseBasicGameplay_PlayerManager_basic_player_manager_impl.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct VerseBasicGameplay_PlayerManager_basic_player_manager_impl__InitCDO final
{
public:
	class USimulation_player_multicast_delegate*  _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player_multicast_delegate*  _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player_multicast_delegate*  _ExprResult_4;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_5;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimulation_player_multicast_delegate*  _ExprResult_6;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseBasicGameplay.VerseBasicGameplay_PlayerManager_basic_player_manager_impl.BeginWaitingForEvents
// 0x0028 (0x0028 - 0x0000)
struct VerseBasicGameplay_PlayerManager_basic_player_manager_impl_BeginWaitingForEvents final
{
public:
	class UConcurrency_task*                      __verse_0xC1E81372_CallingTask;                    // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0xA3A00DDB_CallerResumeState;              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         __verse_0x2AC0E4D8_CallerCancelState;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct VerseBasicGameplay::Ftuple_L_R         __verse_0xB2CDDD72_Argument;                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConcurrency_task*                      RetVal;                                            // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

}

