#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseInput

#include "Basic.hpp"

#include "StructUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NetCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK
{

// ScriptStruct VerseInput.VerseInputActionData
// 0x0084 (0x0090 - 0x000C)
struct FVerseInputActionData final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           InputAction;                                       // 0x0010(0x0008)(ZeroConstructor, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInputActionKeyMapping>         ActionKeys;                                        // 0x0018(0x0010)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	TArray<struct FInputAxisKeyMapping>           AxisKeys;                                          // 0x0028(0x0010)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               Triggers;                                          // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               Modifiers;                                         // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               Actions;                                           // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           InputNames;                                        // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bConsumeInput;                                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAxis;                                           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputActionDataList
// 0x0018 (0x0120 - 0x0108)
struct FVerseInputActionDataList final : public FFastArraySerializer
{
public:
	TArray<struct FVerseInputActionData>          InputActions;                                      // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UVerseReplicatedInputDataComponent*     OwnerComponent;                                    // 0x0118(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// ScriptStruct VerseInput.VerseInputClientActionBaseData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FVerseInputClientActionBaseData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputClientActionData_ApplyImpulse
// 0x0018 (0x0020 - 0x0008)
struct FVerseInputClientActionData_ApplyImpulse final : public FVerseInputClientActionBaseData
{
public:
	struct FVector                                Impulse;                                           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseInput.VerseInputClientActionData_Launch
// 0x0018 (0x0020 - 0x0008)
struct FVerseInputClientActionData_Launch final : public FVerseInputClientActionBaseData
{
public:
	struct FVector                                Velocity;                                          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseInput.VerseInputClientActionData_PlayAnimation
// 0x0008 (0x0010 - 0x0008)
struct FVerseInputClientActionData_PlayAnimation final : public FVerseInputClientActionBaseData
{
public:
	class FName                                   AssetPath;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputClientActionData_PlaySound
// 0x0008 (0x0010 - 0x0008)
struct FVerseInputClientActionData_PlaySound final : public FVerseInputClientActionBaseData
{
public:
	class FName                                   AssetPath;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputClientActionData_SpawnParticleEffect
// 0x0008 (0x0010 - 0x0008)
struct FVerseInputClientActionData_SpawnParticleEffect final : public FVerseInputClientActionBaseData
{
public:
	class FName                                   AssetPath;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputModifierBaseData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FVerseInputModifierBaseData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputModifierData_DeadZone
// 0x0010 (0x0018 - 0x0008)
struct FVerseInputModifierData_DeadZone final : public FVerseInputModifierBaseData
{
public:
	float                                         LowerThreshold;                                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpperThreshold;                                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDeadZoneType                                 Type;                                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputModifierData_Negate
// 0x0008 (0x0010 - 0x0008)
struct FVerseInputModifierData_Negate final : public FVerseInputModifierBaseData
{
public:
	bool                                          bX;                                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bY;                                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bZ;                                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputModifierData_Scalar
// 0x0018 (0x0020 - 0x0008)
struct FVerseInputModifierData_Scalar final : public FVerseInputModifierBaseData
{
public:
	struct FVector                                Scalar;                                            // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseInput.VerseInputModifierData_Smooth
// 0x0000 (0x0008 - 0x0008)
struct FVerseInputModifierData_Smooth final : public FVerseInputModifierBaseData
{
};

// ScriptStruct VerseInput.VerseInputModifierData_ResponseCurveExponential
// 0x0018 (0x0020 - 0x0008)
struct FVerseInputModifierData_ResponseCurveExponential final : public FVerseInputModifierBaseData
{
public:
	struct FVector                                CurveExponent;                                     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseInput.VerseInputModifierData_Swizzle
// 0x0008 (0x0010 - 0x0008)
struct FVerseInputModifierData_Swizzle final : public FVerseInputModifierBaseData
{
public:
	EInputAxisSwizzle                             Order;                                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputTriggerBaseData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FVerseInputTriggerBaseData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActuationThreshold;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputTriggerData_Down
// 0x0000 (0x0010 - 0x0010)
struct FVerseInputTriggerData_Down final : public FVerseInputTriggerBaseData
{
};

// ScriptStruct VerseInput.VerseInputTriggerData_Pressed
// 0x0000 (0x0010 - 0x0010)
struct FVerseInputTriggerData_Pressed final : public FVerseInputTriggerBaseData
{
};

// ScriptStruct VerseInput.VerseInputTriggerData_Released
// 0x0000 (0x0010 - 0x0010)
struct FVerseInputTriggerData_Released final : public FVerseInputTriggerBaseData
{
};

// ScriptStruct VerseInput.VerseInputTriggerData_Hold
// 0x0008 (0x0018 - 0x0010)
struct FVerseInputTriggerData_Hold final : public FVerseInputTriggerBaseData
{
public:
	float                                         HoldTimeThreshold;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOneShot;                                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AffectedByTimeDilation;                            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputTriggerData_HoldAndRelease
// 0x0008 (0x0018 - 0x0010)
struct FVerseInputTriggerData_HoldAndRelease final : public FVerseInputTriggerBaseData
{
public:
	float                                         HoldTimeThreshold;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AffectedByTimeDilation;                            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseInput.VerseInputTriggerData_Tap
// 0x0008 (0x0018 - 0x0010)
struct FVerseInputTriggerData_Tap final : public FVerseInputTriggerBaseData
{
public:
	float                                         TapReleaseTimeThreshold;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AffectedByTimeDilation;                            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

