#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseCamera_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EpicGamesTemporary_structs.hpp"
#include "VerseGameplayTags_structs.hpp"
#include "VerseNative_structs.hpp"
#include "Entity_0_classes.hpp"
#include "VerseCamera_classes.hpp"
#include "Component_0_classes.hpp"
#include "VerseGameplayTags_0_classes.hpp"


namespace SDK
{

// VerseClass VerseCamera.VerseCamera_camera_evaluation_context
// 0x0020 (0x0058 - 0x0038)
class UVerseCamera_camera_evaluation_context : public UVerseCameraEvaluationContext
{
public:
	FVerseFunctionProperty_                       __verse_0x7376A46D__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__evaluation__context_N_RUpdate_L_Ncamera__evaluation__context__input__parameters_M_Ncamera__evaluation__context__output__parameters_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UVerseCamera_camera_evaluation_context_input_parameters* __verse_0x1470B699_InputParameters_Internal; // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_evaluation_context_output_parameters* __verse_0x037EA061_OutputParameters_Internal; // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__evaluation__context_N_RUpdate_L_Ncamera__evaluation__context__input__parameters_M_Ncamera__evaluation__context__output__parameters_R(const struct Ftuple_Lcamera__evaluation__context__input__parameters_Mcamera__evaluation__context__output__parameters_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_evaluation_context">();
	}
	static class UVerseCamera_camera_evaluation_context* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_evaluation_context>();
	}
};

// VerseClass VerseCamera.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseCamera_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseCamera.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseCamera_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseCamera_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_behavior_component
// 0x00B8 (0x0218 - 0x0160)
class UVerseCamera_camera_behavior_component final : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x789AA656__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RGetCameraDirector; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x62983714__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RSetCameraDirector_L_Ncamera__director_R; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x759FC40A__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RGetDefaultEvaluationContext; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5919563C__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RSetDefaultEvaluationContext_L_Ncamera__evaluation__context_R; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UVerseCamera_camera_director*           __verse_0xD629CD21_CameraDirector;                 // 0x01A0(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_evaluation_context* __verse_0x53CE3A2C_DefaultEvaluationContext;       // 0x01A8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_1B0[0x28];                                     // 0x01B0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerseCamera_camera_director*           __verse_0x135D3B78__CameraDirector;                // 0x01D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_evaluation_context* __verse_0x4BB12D62__DefaultEvaluationContext;      // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_1E8[0x30];                                     // 0x01E8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UVerseCamera_camera_director* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RGetCameraDirector(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UVerseCamera_camera_evaluation_context* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RGetDefaultEvaluationContext(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RSetCameraDirector_L_Ncamera__director_R(class UVerseCamera_camera_director* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__behavior__component_N_RSetDefaultEvaluationContext_L_Ncamera__evaluation__context_R(class UVerseCamera_camera_evaluation_context* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_behavior_component">();
	}
	static class UVerseCamera_camera_behavior_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_behavior_component>();
	}
};

// VerseClass VerseCamera.VerseCamera
// 0x0000 (0x0028 - 0x0028)
class UVerseCamera final : public UObject
{
public:
	static TOptional<class UVerseCamera_player_camera_view*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_N_RGetPlayerCameraView_L_Nplayer_R(class USimulation_player* __verse_0xB2CDDD72_Argument);
	static TOptional<class UVerseCamera_player_camera_view*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_N_RGetPlayerCameraViewByIndex_L_Nint_R(int64 __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_N_Roperator_U_2eActivateForPlayer_U_L_Ncamera__behavior__component_M_Ntuple_L_R_M_Nplayer_R(const struct Ftuple_Lcamera__behavior__component_Mtuple_L_R_Mplayer_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_N_Roperator_U_2eActivateForPlayerAtIndex_U_L_Ncamera__behavior__component_M_Ntuple_L_R_M_Nint_R(const struct Ftuple_Lcamera__behavior__component_Mtuple_L_R_Mint_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_N_Roperator_U_2eDeactivateForPlayer_U_L_Ncamera__behavior__component_M_Ntuple_L_R_M_Nplayer_R(const struct Ftuple_Lcamera__behavior__component_Mtuple_L_R_Mplayer_R& __verse_0xB2CDDD72_Argument);
	static TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_N_Roperator_U_2eDeactivateForPlayerAtIndex_U_L_Ncamera__behavior__component_M_Ntuple_L_R_M_Nint_R(const struct Ftuple_Lcamera__behavior__component_Mtuple_L_R_Mint_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera">();
	}
	static class UVerseCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_logic
// 0x0020 (0x0048 - 0x0028)
class UVerseCamera_camera_parameter_logic final : public UObject
{
public:
	uint8                                         __verse_0x31A8F10C_Value : 1;                      // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAssets_camera_variable_logic*          __verse_0x72781213_Variable;                       // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_logic">();
	}
	static class UVerseCamera_camera_parameter_logic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_logic>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_evaluation_context_input_parameters
// 0x0010 (0x0038 - 0x0028)
class UVerseCamera_camera_evaluation_context_input_parameters final : public UObject
{
public:
	class Entity_0::UEntity*                      __verse_0x125DBF6F_CameraBehaviorEntity;           // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0xEDA0BF94_DeltaTime;                      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_evaluation_context_input_parameters">();
	}
	static class UVerseCamera_camera_evaluation_context_input_parameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_evaluation_context_input_parameters>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_component
// 0x0000 (0x01C8 - 0x01C8)
class UVerseCamera_camera_component final : public Ubasic_camera_component
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_component">();
	}
	static class UVerseCamera_camera_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_component>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_director
// 0x0030 (0x0058 - 0x0028)
class UVerseCamera_camera_director : public UVerseCameraDirectorBase
{
public:
	FVerseFunctionProperty_                       __verse_0x93D9B5F1__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RDetermineActiveCameraModes; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x22CD0006__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RAddCameraMode_L_Ncamera__mode_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5B0A303B__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RRemoveCameraMode_L_Ncamera__mode_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RAddCameraMode_L_Ncamera__mode_R(class UVerseCamera_camera_mode* __verse_0xB2CDDD72_Argument);
	TArray<class UVerseCamera_camera_mode*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RDetermineActiveCameraModes(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RRemoveCameraMode_L_Ncamera__mode_R(class UVerseCamera_camera_mode* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_director">();
	}
	static class UVerseCamera_camera_director* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_director>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_output_parameters
// 0x00F8 (0x0120 - 0x0028)
#pragma pack(push, 0x1)
class alignas(0x10) UVerseCamera_camera_output_parameters : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0x3EB520A1__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__logic_M_Nlogic_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDBC7E74B__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__float_M_Nfloat_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDA0B7BF4__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__integer_M_Nint_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFB2406D8__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__vector2_M_Nvector2_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x437B365E__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__vector3_M_Nvector3_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1FBE21F9__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__rotation_M_Nrotation_R; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x326793FD__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__transform_M_Ntransform_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x19DE0607__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RReset__Internal; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<struct FSpatialMath_vector3>        __verse_0x512060E4_CameraLocation;                 // 0x00A8(0x0020)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FVerseRotation>              __verse_0x9925111D_CameraRotation;                 // 0x00D0(0x0030)(ZeroConstructor, InstancedReference, NoDestructor, ContainsInstancedReference)
	TOptional<double>                             __verse_0x5948B835_CameraFieldOfViewDegrees;       // 0x0100(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RReset__Internal(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__float_M_Nfloat_R(const struct Ftuple_Lcamera__variable__float_Mfloat_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__integer_M_Nint_R(const struct Ftuple_Lcamera__variable__integer_Mint_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__logic_M_Nlogic_R(const struct Ftuple_Lcamera__variable__logic_Mlogic_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__rotation_M_Nrotation_R(const struct Ftuple_Lcamera__variable__rotation_Mrotation_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__transform_M_Ntransform_R(const struct Ftuple_Lcamera__variable__transform_Mtransform_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__vector2_M_Nvector2_R(const struct Ftuple_Lcamera__variable__vector2_Mvector2_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__output__parameters_N_RSetCameraVariable_L_Ncamera__variable__vector3_M_Nvector3_R(const struct Ftuple_Lcamera__variable__vector3_Mvector3_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_output_parameters">();
	}
	static class UVerseCamera_camera_output_parameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_output_parameters>();
	}
};
#pragma pack(pop)

// VerseClass VerseCamera.VerseCamera_camera_operation_output_parameters
// 0x0000 (0x0120 - 0x0120)
class UVerseCamera_camera_operation_output_parameters final : public UVerseCamera_camera_output_parameters
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_operation_output_parameters">();
	}
	static class UVerseCamera_camera_operation_output_parameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_operation_output_parameters>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_director_default
// 0x0010 (0x0068 - 0x0058)
class UVerseCamera_camera_director_default final : public UVerseCamera_camera_director
{
public:
	TArray<class UVerseCamera_camera_mode*>       __verse_0xDB966653_CameraModes;                    // 0x0058(0x0010)(Net, InstancedReference, ContainsInstancedReference)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RAddCameraMode_L_Ncamera__mode_R(class UVerseCamera_camera_mode* __verse_0xB2CDDD72_Argument);
	TArray<class UVerseCamera_camera_mode*> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RDetermineActiveCameraModes(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__director_N_RRemoveCameraMode_L_Ncamera__mode_R(class UVerseCamera_camera_mode* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_director_default">();
	}
	static class UVerseCamera_camera_director_default* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_director_default>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_rotation
// 0x0058 (0x0080 - 0x0028)
class UVerseCamera_camera_parameter_rotation final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0x31A8F10C_Value;                          // 0x0030(0x0020)(Edit, InstancedReference, SaveGame, NoDestructor)
	class UAssets_camera_variable_rotation*       __verse_0x72781213_Variable;                       // 0x0050(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_58[0x28];                                      // 0x0058(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_rotation">();
	}
	static class UVerseCamera_camera_parameter_rotation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_rotation>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_mode
// 0x00C0 (0x00E8 - 0x0028)
class UVerseCamera_camera_mode final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0xC9D14F04__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetCameraModeTag; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x85223035__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetCameraRigAsset; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8EF602B8__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RSetCameraRigAsset_L_Ncamera__rig__asset_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x15853131__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetPriority; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1F36D0B1__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RSetPriority_L_Nfloat_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB628F037__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetCameraEvaluationContext; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1CACCA08__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RSetCameraEvaluationContext_L_Ncamera__evaluation__context_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UAssets_camera_rig_asset*               __verse_0x12FB9690_CameraRigAsset;                 // 0x0098(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0x1F226B39_Priority;                       // 0x00A0(0x0008)(Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseCamera_camera_evaluation_context* __verse_0x7361A4CA_CameraEvaluationContext;        // 0x00A8(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAssets_camera_rig_asset*               __verse_0xD78F60C9__CameraRigAsset;                // 0x00B8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_evaluation_context* __verse_0x239A7C08__CameraEvaluationContext;       // 0x00C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVerseGameplayTag                      __verse_0x006A4A6C__CameraModeTag;                 // 0x00C8(0x0008)(Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x8EB061B4__Priority;                      // 0x00D0(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_operation*, true> __verse_0x3DB81447_RootCameraOperation;    // 0x00D8(0x0008)(Edit, Net, InstancedReference, SaveGame, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UVerseCamera_camera_evaluation_context* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetCameraEvaluationContext(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UVerseCamera_verse_camera_mode_tag*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetCameraModeTag(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UAssets_camera_rig_asset* _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetCameraRigAsset(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RGetPriority(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RSetCameraEvaluationContext_L_Ncamera__evaluation__context_R(class UVerseCamera_camera_evaluation_context* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RSetCameraRigAsset_L_Ncamera__rig__asset_R(class UAssets_camera_rig_asset* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__mode_N_RSetPriority_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_mode">();
	}
	static class UVerseCamera_camera_mode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_mode>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_operation
// 0x0038 (0x0070 - 0x0038)
class UVerseCamera_camera_operation final : public UVerseCameraNode
{
public:
	FVerseFunctionProperty_                       __verse_0x2B4F51AE__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation_N_RInitialize_L_Ncamera__operation__initialization__parameters_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1D79BC58__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation_N_RUpdate_L_Ncamera__operation__input__parameters_M_Ncamera__operation__output__parameters_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_initialization_parameters* __verse_0x6F32B15D_InitParameters_Internal; // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_input_parameters* __verse_0x1470B699_InputParameters_Internal; // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_output_parameters* __verse_0x037EA061_OutputParameters_Internal; // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation_N_RInitialize_L_Ncamera__operation__initialization__parameters_R(class UVerseCamera_camera_operation_initialization_parameters* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation_N_RUpdate_L_Ncamera__operation__input__parameters_M_Ncamera__operation__output__parameters_R(const struct Ftuple_Lcamera__operation__input__parameters_Mcamera__operation__output__parameters_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_operation">();
	}
	static class UVerseCamera_camera_operation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_operation>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_operation_initialization_parameters
// 0x0008 (0x0030 - 0x0028)
class UVerseCamera_camera_operation_initialization_parameters final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_operation_initialization_parameters">();
	}
	static class UVerseCamera_camera_operation_initialization_parameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_operation_initialization_parameters>();
	}
};

// VerseClass VerseCamera.VerseCamera_player_camera_view
// 0x0040 (0x00E0 - 0x00A0)
class UVerseCamera_player_camera_view final : public UVersePlayerCameraViewComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xBDC4C4B5__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fplayer__camera__view_N_RSetActiveCameraBehavior_L_Ncamera__behavior__component_R; // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE8E78995__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fplayer__camera__view_N_RClearActiveCameraBehavior; // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD6E2241C__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fplayer__camera__view_N_RGetActiveCameraBehavior; // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fplayer__camera__view_N_RClearActiveCameraBehavior(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class UVerseCamera_camera_behavior_component*, true> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fplayer__camera__view_N_RGetActiveCameraBehavior(const struct VerseCamera_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fplayer__camera__view_N_RSetActiveCameraBehavior_L_Ncamera__behavior__component_R(class UVerseCamera_camera_behavior_component* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_player_camera_view">();
	}
	static class UVerseCamera_player_camera_view* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_player_camera_view>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_operation_input_parameters
// 0x00C8 (0x00F0 - 0x0028)
class UVerseCamera_camera_operation_input_parameters final : public UObject
{
public:
	FVerseFunctionProperty_                       __verse_0xB11F4B57__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__logic_R; // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC5E9D997__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__float_R; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x90184141__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__integer_R; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x504B65F1__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__vector2_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3F07C06A__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__vector3_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF0EEA43F__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__rotation_R; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x240518C6__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__transform_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	TOptional<class UVerseCamera_camera_evaluation_context*, true> __verse_0x17F5B925_EvaluationContext; // 0x0098(0x0008)(InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x512060E4_CameraLocation;                 // 0x00A0(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0x9925111D_CameraRotation;                 // 0x00C0(0x0020)(InstancedReference, NoDestructor)
	double                                        __verse_0xEDA0BF94_DeltaTime;                      // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<double> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__float_R(class UVerseCamera_camera_parameter_float* __verse_0xB2CDDD72_Argument);
	TOptional<int64> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__integer_R(class UVerseCamera_camera_parameter_integer* __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__logic_R(class UVerseCamera_camera_parameter_logic* __verse_0xB2CDDD72_Argument);
	TOptional<struct FVerseRotation> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__rotation_R(class UVerseCamera_camera_parameter_rotation* __verse_0xB2CDDD72_Argument);
	TOptional<struct FSpatialMath_transform> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__transform_R(class UVerseCamera_camera_parameter_transform* __verse_0xB2CDDD72_Argument);
	TOptional<struct FSpatialMath_vector2> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__vector2_R(class UVerseCamera_camera_parameter_vector2* __verse_0xB2CDDD72_Argument);
	TOptional<struct FSpatialMath_vector3> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__operation__input__parameters_N_RGetCameraParameterValue_L_Ncamera__parameter__vector3_R(class UVerseCamera_camera_parameter_vector3* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_operation_input_parameters">();
	}
	static class UVerseCamera_camera_operation_input_parameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_operation_input_parameters>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_evaluation_context_output_parameters
// 0x0010 (0x0130 - 0x0120)
class UVerseCamera_camera_evaluation_context_output_parameters final : public UVerseCamera_camera_output_parameters
{
public:
	TOptional<double>                             __verse_0xD58F9071_TargetDistance;                 // 0x0118(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_evaluation_context_output_parameters">();
	}
	static class UVerseCamera_camera_evaluation_context_output_parameters* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_evaluation_context_output_parameters>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_float
// 0x0020 (0x0048 - 0x0028)
class UVerseCamera_camera_parameter_float final : public UObject
{
public:
	double                                        __verse_0x31A8F10C_Value;                          // 0x0028(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAssets_camera_variable_float*          __verse_0x72781213_Variable;                       // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_float">();
	}
	static class UVerseCamera_camera_parameter_float* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_float>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_integer
// 0x0020 (0x0048 - 0x0028)
class UVerseCamera_camera_parameter_integer final : public UObject
{
public:
	int64                                         __verse_0x31A8F10C_Value;                          // 0x0028(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAssets_camera_variable_integer*        __verse_0x72781213_Variable;                       // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_integer">();
	}
	static class UVerseCamera_camera_parameter_integer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_integer>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_transform
// 0x00E8 (0x0110 - 0x0028)
class UVerseCamera_camera_parameter_transform final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 __verse_0x31A8F10C_Value;                          // 0x0030(0x0060)(Edit, InstancedReference, SaveGame, NoDestructor)
	class UAssets_camera_variable_transform*      __verse_0x72781213_Variable;                       // 0x0090(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_98[0x78];                                      // 0x0098(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_transform">();
	}
	static class UVerseCamera_camera_parameter_transform* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_transform>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_vector2
// 0x0030 (0x0058 - 0x0028)
class UVerseCamera_camera_parameter_vector2 final : public UObject
{
public:
	struct FSpatialMath_vector2                   __verse_0x31A8F10C_Value;                          // 0x0028(0x0010)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	class UAssets_camera_variable_vector2*        __verse_0x72781213_Variable;                       // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_vector2">();
	}
	static class UVerseCamera_camera_parameter_vector2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_vector2>();
	}
};

// VerseClass VerseCamera.VerseCamera_camera_parameter_vector3
// 0x0040 (0x0068 - 0x0028)
class UVerseCamera_camera_parameter_vector3 final : public UObject
{
public:
	struct FSpatialMath_vector3                   __verse_0x31A8F10C_Value;                          // 0x0028(0x0018)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor)
	class UAssets_camera_variable_vector3*        __verse_0x72781213_Variable;                       // 0x0040(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, SaveGame, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_camera_parameter_vector3">();
	}
	static class UVerseCamera_camera_parameter_vector3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_camera_parameter_vector3>();
	}
};

// VerseClass VerseCamera.VerseCamera_entity_camera_evaluation_context
// 0x0010 (0x0068 - 0x0058)
class UVerseCamera_entity_camera_evaluation_context final : public UVerseCamera_camera_evaluation_context
{
public:
	TOptional<class Entity_0::UEntity*, true>     __verse_0x75DE5C41_FixedWorldCameraEntity;         // 0x0058(0x0008)(Net, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TOptional<class Entity_0::UEntity*, true>     __verse_0xEF46DE41_TargetEntity;                   // 0x0060(0x0008)(Net, InstancedReference, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<EVerseTrue> _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fVerseCamera_2fcamera__evaluation__context_N_RUpdate_L_Ncamera__evaluation__context__input__parameters_M_Ncamera__evaluation__context__output__parameters_R(const struct Ftuple_Lcamera__evaluation__context__input__parameters_Mcamera__evaluation__context__output__parameters_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseCamera_entity_camera_evaluation_context">();
	}
	static class UVerseCamera_entity_camera_evaluation_context* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseCamera_entity_camera_evaluation_context>();
	}
};

// VerseClass VerseCamera.VerseCamera_verse_camera_mode_tag
// 0x0000 (0x0028 - 0x0028)
class UVerseCamera_verse_camera_mode_tag final : public UTags_tag
{
