#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortnite_0

#include "Basic.hpp"

#include "VerseAssets_0_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Entity_0_classes.hpp"
#include "UnrealEngineExperimental_0_structs.hpp"
#include "UnrealEngineExperimental_0_classes.hpp"
#include "VerseFortnite_0_structs.hpp"
#include "VerseFortnite_classes.hpp"
#include "VerseNative_structs.hpp"
#include "VerseAbilities_0_classes.hpp"
#include "Component_0_classes.hpp"
#include "VerseNative_0_classes.hpp"
#include "EpicGamesTemporary_0_structs.hpp"
#include "VerseGameplayTags_structs.hpp"
#include "VerseGameplayTags_0_classes.hpp"


namespace SDK
{

// VerseClass VerseFortnite.Animation_PlayAnimation
// 0x0000 (0x0028 - 0x0028)
class UAnimation_PlayAnimation final : public UObject
{
public:
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAnimation_2fPlayAnimation_N_Roperator_U_2eGetPlayAnimationController_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Animation_PlayAnimation">();
	}
	static class UAnimation_PlayAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimation_PlayAnimation>();
	}
};

// VerseClass VerseFortnite.AI_ai_target_component
// 0x0040 (0x01A0 - 0x0160)
class UAI_ai_target_component final : public UComponent
{
public:
	uint8                                         __verse_0x770A8C24_SightSense : 1;                 // 0x0160(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_160_1 : 7;                                  // 0x0160(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x335FFCF9_TouchSense : 1;                 // 0x0161(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_161_1 : 7;                                  // 0x0161(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xE86DDF16_HearingSense : 1;               // 0x0162(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_162_1 : 7;                                  // 0x0162(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0xD9E113A9_DamageSense : 1;                // 0x0163(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_164[0x3C];                                     // 0x0164(0x003C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_ai_target_component">();
	}
	static class UAI_ai_target_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_ai_target_component>();
	}
};

// VerseClass VerseFortnite.AI_sight_perception_settings
// 0x0028 (0x0050 - 0x0028)
class UAI_sight_perception_settings final : public UObject
{
public:
	double                                        __verse_0xEFFE6BA9_SightRadius;                    // 0x0028(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x32B7E89E_LoseSightRadius;                // 0x0030(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x4D74AFDD_PeripheralVisionAngle;          // 0x0038(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x403FF374_MaxStimulusDuration;            // 0x0040(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x5BD017C5_SenseEnabled : 1;               // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_48_1 : 7;                                   // 0x0048(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x6EFCE051_EnemiesDetected : 1;            // 0x0049(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_49_1 : 7;                                   // 0x0049(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x18648A9F_FriendliesDetected : 1;         // 0x004A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_4A_1 : 7;                                   // 0x004A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x35B7560B_NeutralsDetected : 1;           // 0x004B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_sight_perception_settings">();
	}
	static class UAI_sight_perception_settings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_sight_perception_settings>();
	}
};

// VerseClass VerseFortnite.AI_ai_component
// 0x0020 (0x0180 - 0x0160)
class UAI_ai_component : public UComponent
{
public:
	uint8                                         Pad_160[0x20];                                     // 0x0160(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_ai_component">();
	}
	static class UAI_ai_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_ai_component>();
	}
};

// VerseClass VerseFortnite.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VerseFortnite_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VerseFortnite.$SolarisSignatureFunctionOuter", true>();
	}
	static class VerseFortnite_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VerseFortnite_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VerseFortnite.AI_focus_interface
// 0x0000 (0x0028 - 0x0028)
class UAI_focus_interface final : public UObject
{
public:
	class UConcurrency_task* MaintainFocus_L_Nagent_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class USimulation_agent* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MaintainFocus_L_Nvector3_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_focus_interface">();
	}
	static class UAI_focus_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_focus_interface>();
	}
};

// VerseClass VerseFortnite.AI
// 0x0000 (0x0028 - 0x0028)
class UAI final : public UObject
{
public:
	static class UAI_navigation_target* _L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nagent_R(class USimulation_agent* __verse_0xB2CDDD72_Argument);
	static class UAI_navigation_target* _L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Ntarget__info_R(const struct FAI_target_info& __verse_0xB2CDDD72_Argument);
	static class UAI_navigation_target* _L_2fFortnite_2ecom_2fAI_N_RMakeNavigationTarget_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFocusInterface_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetFortLeashable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FSpatialMath_vector3 _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetLastKnownPosition_U_L_Ntarget__info_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Ltarget__info_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UObject*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNavigatable_U_L_Nfort__character_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lfort__character_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UAI_npc_behavior*, true> _L_2fFortnite_2ecom_2fAI_N_Roperator_U_2eGetNPCBehavior_U_L_Nagent_M_Ntuple_L_R_M_Ntuple_L_R_R(const struct VerseFortnite_0::Ftuple_Lagent_Mtuple_L_R_Mtuple_L_R_R& __verse_0xB2CDDD72_Argument);
	static struct FAI_fort_obstacle_info AI_fort_obstacle_info_Factory();
	static struct FAI_fort_obstacle_info AI_fort_obstacle_info_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);
	static struct FAI_target_info AI_target_info_Factory();
	static struct FAI_target_info AI_target_info_OverrideFactory(const TMap<FVerseStringProperty_, uint8>& __verse_0xFB48ED96__InitOverrideMap);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI">();
	}
	static class UAI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI>();
	}
};

// VerseClass VerseFortnite.AI_fort_leashable
// 0x0000 (0x0028 - 0x0028)
class UAI_fort_leashable final : public UObject
{
public:
	void _L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R(const struct VerseFortnite_0::Ftuple_Lagent_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R(const struct VerseFortnite_0::Ftuple_Lvector3_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_fort_leashable">();
	}
	static class UAI_fort_leashable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_fort_leashable>();
	}
};

// VerseClass VerseFortnite.AI_touch_perception_settings
// 0x0010 (0x0038 - 0x0028)
class UAI_touch_perception_settings final : public UObject
{
public:
	double                                        __verse_0x403FF374_MaxStimulusDuration;            // 0x0028(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x5BD017C5_SenseEnabled : 1;               // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_30_1 : 7;                                   // 0x0030(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x6EFCE051_EnemiesDetected : 1;            // 0x0031(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_31_1 : 7;                                   // 0x0031(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x18648A9F_FriendliesDetected : 1;         // 0x0032(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_32_1 : 7;                                   // 0x0032(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x35B7560B_NeutralsDetected : 1;           // 0x0033(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_touch_perception_settings">();
	}
	static class UAI_touch_perception_settings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_touch_perception_settings>();
	}
};

// VerseClass VerseFortnite.AI_ai_actions_component
// 0x0008 (0x0188 - 0x0180)
class UAI_ai_actions_component : public UAI_ai_component
{
public:
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_ai_actions_component">();
	}
	static class UAI_ai_actions_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_ai_actions_component>();
	}
};

// VerseClass VerseFortnite.Characters_fort_character_component
// 0x02D8 (0x0438 - 0x0160)
class UCharacters_fort_character_component final : public UComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xCB6F79D3__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1B4AAA99__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2F94B078__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE791C181__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x454A4B2C__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC92ABB7D__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent; // 0x01B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD90058E7__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent; // 0x01C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0F127353__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive; // 0x01D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD3C45C5B__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut; // 0x01E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1E524A70__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching; // 0x01F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xEF5FA653__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround; // 0x0200(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x35BF825D__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir; // 0x0210(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x07C93F4C__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater; // 0x0220(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x93AC94CF__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling; // 0x0230(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x18D996AC__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding; // 0x0240(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x15F5E912__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying; // 0x0250(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0337C666__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R; // 0x0260(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x33C4CAA3__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis; // 0x0270(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCBE35292__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow; // 0x0280(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC5397112__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide; // 0x0290(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2A43A893__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R; // 0x02A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9084EF8E__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable; // 0x02B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9F0B7868__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RTeleportTo_L_Nvector3_M_Nrotation_R; // 0x02C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xEAA1FE99__L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetEntity; // 0x02D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x48326568__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield; // 0x02E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8B41548F__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R; // 0x02F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x26941A48__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield; // 0x0300(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4BA33B47__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R; // 0x0310(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF6DD1D2E__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent; // 0x0320(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDCD5C88E__L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent; // 0x0330(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x919B3D8B__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R; // 0x0340(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xBCC8CFC8__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R; // 0x0350(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7782AD90__L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent; // 0x0360(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x641F6E2B__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth; // 0x0370(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF2F0AAD0__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R; // 0x0380(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3244305D__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth; // 0x0390(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x339B570D__L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R; // 0x03A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3579A169__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R; // 0x03B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF6BFDA59__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R; // 0x03C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF8CC989C__L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent; // 0x03D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x6B57E438__L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform; // 0x03E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	class UObject*                                __verse_0xF80AEC27_FortCharacter;                  // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x4DE1175C_DamagedHealthEventInternal;     // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x3EFD7EED_DamagedShieldEventInternal;     // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0xF4EDADDB_HealedHealthEventInternal;      // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x87F1C46A_HealedShieldEventInternal;      // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x0008931F_CrouchedEventInternal;          // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0xCE63A4CB_JumpedEventInternal;            // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x242DF4E0_SprintedEventInternal;          // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        __verse_0x5587B813_EliminatedEventInternal;        // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RCrouchedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_REliminatedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class USimulation_agent*, true> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetAgent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<class Entity_0::UEntity*, true> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetEntity(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewLocation(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FVerseRotation _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RGetViewRotation(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RHide(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsActive(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsCrouching(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsDownButNotOut(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFalling(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsFlying(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsGliding(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInAir(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsInWater(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsOnGround(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RIsVulnerable(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RJumpedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RPutInStasis_L_Nstasis__args_R(const struct FCharacters_stasis_args& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RReleaseFromStasis(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSetVulnerability_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RShow(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RSprintedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	TOptional<EVerseTrue> _L_2fFortnite_2ecom_2fCharacters_2ffort__character_N_RTeleportTo_L_Nvector3_M_Nrotation_R(const struct VerseFortnite_0::Ftuple_Lvector3_Mrotation_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Ndamage__args_R(const struct FGame_damage_args& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamage_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fdamageable_N_RDamagedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHeal_L_Nhealing__args_R(const struct FGame_healing_args& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fhealable_N_RHealedEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetHealth(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RGetMaxHealth(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fhealthful_N_RSetMaxHealth_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RDamagedShieldEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetMaxShield(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	double _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RGetShield(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UObject* _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RHealedShieldEvent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetMaxShield_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fGame_2fshieldable_N_RSetShield_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_RIsAllowedOnClient(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Characters_fort_character_component">();
	}
	static class UCharacters_fort_character_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacters_fort_character_component>();
	}
};

// VerseClass VerseFortnite.AI_damage_perception_settings
// 0x0010 (0x0038 - 0x0028)
class UAI_damage_perception_settings final : public UObject
{
public:
	double                                        __verse_0x403FF374_MaxStimulusDuration;            // 0x0028(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x5BD017C5_SenseEnabled : 1;               // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_damage_perception_settings">();
	}
	static class UAI_damage_perception_settings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_damage_perception_settings>();
	}
};

// VerseClass VerseFortnite.AI_fort_leashable_component
// 0x0030 (0x01B0 - 0x0180)
class UAI_fort_leashable_component final : public UAI_ai_component
{
public:
	FVerseFunctionProperty_                       __verse_0xC2A62123__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x57363ACF__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x06D72000__L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RClearLeash(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashAgent_L_Nagent_M_Nfloat_M_Nfloat_R(const struct VerseFortnite_0::Ftuple_Lagent_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2ffort__leashable_N_RSetLeashPosition_L_Nvector3_M_Nfloat_M_Nfloat_R(const struct VerseFortnite_0::Ftuple_Lvector3_Mfloat_Mfloat_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_fort_leashable_component">();
	}
	static class UAI_fort_leashable_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_fort_leashable_component>();
	}
};

// VerseClass VerseFortnite.task_AI_npc_actions_component$MaintainFocus_L_Nagent_R
// 0x0010 (0x0168 - 0x0158)
class Utask_AI_npc_actions_component_MaintainFocus_L_Nagent_R final : public UConcurrency_task
{
public:
	class UAI_npc_actions_component*              _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USimulation_agent*                      __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_AI_npc_actions_component$MaintainFocus_L_Nagent_R">();
	}
	static class Utask_AI_npc_actions_component_MaintainFocus_L_Nagent_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_AI_npc_actions_component_MaintainFocus_L_Nagent_R>();
	}
};

// VerseClass VerseFortnite.AI_hearing_perception_settings
// 0x0018 (0x0040 - 0x0028)
class UAI_hearing_perception_settings final : public UObject
{
public:
	double                                        __verse_0xF825785F_HearingRange;                   // 0x0028(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __verse_0x403FF374_MaxStimulusDuration;            // 0x0030(0x0008)(Edit, ZeroConstructor, InstancedReference, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __verse_0x5BD017C5_SenseEnabled : 1;               // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_38_1 : 7;                                   // 0x0038(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x6EFCE051_EnemiesDetected : 1;            // 0x0039(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_39_1 : 7;                                   // 0x0039(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x18648A9F_FriendliesDetected : 1;         // 0x003A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_3A_1 : 7;                                   // 0x003A(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         __verse_0x35B7560B_NeutralsDetected : 1;           // 0x003B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, InstancedReference, SaveGame, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_hearing_perception_settings">();
	}
	static class UAI_hearing_perception_settings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_hearing_perception_settings>();
	}
};

// VerseClass VerseFortnite.task_AI_fort_guard_actions_component$Attack_L_Ntarget__info_R
// 0x0040 (0x0198 - 0x0158)
class Utask_AI_fort_guard_actions_component_Attack_L_Ntarget__info_R final : public UConcurrency_task
{
public:
	class UAI_fort_guard_actions_component*       _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAI_target_info                        __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0030)(Parm, NoDestructor)
	EAI_action_result                             _RetVal;                                           // 0x0190(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_AI_fort_guard_actions_component$Attack_L_Ntarget__info_R">();
	}
	static class Utask_AI_fort_guard_actions_component_Attack_L_Ntarget__info_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_AI_fort_guard_actions_component_Attack_L_Ntarget__info_R>();
	}
};

// VerseClass VerseFortnite.AI_movement_type
// 0x0008 (0x0030 - 0x0028)
class UAI_movement_type final : public UObject
{
public:
	EAI_movement_style                            __verse_0x8A4A778B_MovementStyle;                  // 0x0028(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_movement_type">();
	}
	static class UAI_movement_type* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_movement_type>();
	}
};

// VerseClass VerseFortnite.AI_movement_types
// 0x0010 (0x0038 - 0x0028)
class UAI_movement_types final : public UObject
{
public:
	class UAI_movement_type*                      __verse_0xA433B5E2_Walking;                        // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAI_movement_type*                      __verse_0x35702D43_Running;                        // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_movement_types">();
	}
	static class UAI_movement_types* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_movement_types>();
	}
};

// VerseClass VerseFortnite.AI_navigatable
// 0x0000 (0x0028 - 0x0028)
class UAI_navigatable final : public UObject
{
public:
	TOptional<struct FSpatialMath_vector3> _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, TOptional<double> __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_navigatable">();
	}
	static class UAI_navigatable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_navigatable>();
	}
};

// VerseClass VerseFortnite.task_AI_navigatable$Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R
// 0x0018 (0x0170 - 0x0158)
class Utask_AI_navigatable_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R final : public UConcurrency_task
{
public:
	class UAI_navigatable*                        _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TOptional<double>                             __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_AI_navigatable$Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R">();
	}
	static class Utask_AI_navigatable_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_AI_navigatable_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R>();
	}
};

// VerseClass VerseFortnite.AI_navigation_target
// 0x0020 (0x0048 - 0x0028)
class UAI_navigation_target final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_navigation_target">();
	}
	static class UAI_navigation_target* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_navigation_target>();
	}
};

// VerseClass VerseFortnite.AI_npc_actions_component
// 0x0070 (0x01F8 - 0x0188)
class UAI_npc_actions_component : public UAI_ai_actions_component
{
public:
	FVerseFunctionProperty_                       __verse_0x122D082A__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination; // 0x0188(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9C97F643_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R; // 0x0198(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD5205DFA__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation; // 0x01A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0413F356_Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R; // 0x01B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFAF2C1BB__L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R; // 0x01C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1EAD0FC6_MaintainFocus_L_Nvector3_R;     // 0x01D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0A187AEF_MaintainFocus_L_Nagent_R;       // 0x01E8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<struct FSpatialMath_vector3> _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RGetCurrentDestination(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RSetMovementSpeedMultiplier_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fnavigatable_N_RStopNavigation(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MaintainFocus_L_Nagent_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class USimulation_agent* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MaintainFocus_L_Nvector3_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Wait_L_N_QDuration_Nfloat_20_3d_20_2e_2e_2e_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, TOptional<double> __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_npc_actions_component">();
	}
	static class UAI_npc_actions_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_npc_actions_component>();
	}
};

// VerseClass VerseFortnite.task_AI_navigatable$NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R
// 0x0038 (0x0190 - 0x0158)
class Utask_AI_navigatable_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R final : public UConcurrency_task
{
public:
	class UAI_navigatable*                        _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_Lnavigation__target_M_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R __verse_0xB2CDDD72_Argument; // 0x0160(0x0028)(Parm, NoDestructor, HasGetValueTypeHash)
	EAI_navigation_result                         _RetVal;                                           // 0x0188(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_AI_navigatable$NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R">();
	}
	static class Utask_AI_navigatable_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_AI_navigatable_NavigateTo_L_Nnavigation__target_M_N_QMovementType_Nmovement__type_20_3d_20_2e_2e_2e_M_N_QReachRadius_Nfloat_20_3d_20_2e_2e_2e_M_N_QAllowPartialPath_Nlogic_20_3d_20_2e_2e_2e_R>();
	}
};

// VerseClass VerseFortnite.AI_fort_guard_actions_component
// 0x00A0 (0x0298 - 0x01F8)
class UAI_fort_guard_actions_component : public UAI_npc_actions_component
{
public:
	FVerseFunctionProperty_                       __verse_0xA9D01BCC_RoamAround;                     // 0x01F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x514829C1_MoveInRangeToAttack;            // 0x0208(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE4D0BB73_Crouch;                         // 0x0218(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xAB67A512__L_2fFortnite_2ecom_2fAI_2ffort__guard__actions__component_N_RStandUp; // 0x0228(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCB7DDA42_TacticalSprint;                 // 0x0238(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9765CB04_PlayRandomEmote;                // 0x0248(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5966DD2C_PlayEmote_L_Nemote_R;           // 0x0258(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x75C586C9_Revive_L_Nagent_R;              // 0x0268(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x41F6C027_Attack_L_Ntarget__info_R;       // 0x0278(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xD3F7570B_Attack_L_Nfort__obstacle__info_R; // 0x0288(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	EAI_action_result _L_2fFortnite_2ecom_2fAI_2ffort__guard__actions__component_N_RStandUp(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Attack_L_Nfort__obstacle__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FAI_fort_obstacle_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Attack_L_Ntarget__info_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct FAI_target_info& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Crouch(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* MoveInRangeToAttack(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* PlayEmote_L_Nemote_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class UAssets_emote* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* PlayRandomEmote(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* Revive_L_Nagent_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, class USimulation_agent* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* RoamAround(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* TacticalSprint(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_fort_guard_actions_component">();
	}
	static class UAI_fort_guard_actions_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_fort_guard_actions_component>();
	}
};

// VerseClass VerseFortnite.AI_npc_behavior
// 0x0080 (0x00A8 - 0x0028)
class UAI_npc_behavior : public UNPCBehaviorScript
{
public:
	FVerseFunctionProperty_                       __verse_0x1F792AAA_OnBegin;                        // 0x0028(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x19F0B2EF__L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_ROnEnd; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2956B03E__L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_RGetAgent; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8404B10A__L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_RGetEntity; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x17B62A18__L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_RSetEntity_L_Nentity_R; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	class Entity_0::UEntity*                      __verse_0xECA943DB_Entity;                         // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_80[0x28];                                      // 0x0080(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	TOptional<class USimulation_agent*, true> _L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_RGetAgent(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class Entity_0::UEntity* _L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_RGetEntity(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_ROnEnd(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fFortnite_2ecom_2fAI_2fnpc__behavior_N_RSetEntity_L_Nentity_R(class Entity_0::UEntity* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* OnBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_npc_behavior">();
	}
	static class UAI_npc_behavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_npc_behavior>();
	}
};

// VerseClass VerseFortnite.Game_positional
// 0x0000 (0x0028 - 0x0028)
class UGame_positional final : public UObject
{
public:
	struct FSpatialMath_transform _L_2fFortnite_2ecom_2fGame_2fpositional_N_RGetTransform(const struct VerseFortnite_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Game_positional">();
	}
	static class UGame_positional* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGame_positional>();
	}
};

// VerseClass VerseFortnite.AI_npc_behavior_component
// 0x0008 (0x0188 - 0x0180)
class UAI_npc_behavior_component final : public UAI_ai_component
{
public:
	class UAI_npc_behavior*                       __verse_0xF10D4D19_NPCBehavior;                    // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AI_npc_behavior_component">();
	}
	static class UAI_npc_behavior_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAI_npc_behavior_component>();
	}
};

// VerseClass VerseFortnite.task_AI_fort_guard_actions_component$Crouch
// 0x0010 (0x0168 - 0x0158)
class Utask_AI_fort_guard_actions_component_Crouch final : public UConcurrency_task
{
public:
	class UAI_fort_guard_actions_component*       _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VerseFortnite_0::Ftuple_L_R            __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAI_fallible_action_result                    _RetVal;                                           // 0x0161(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_AI_fort_guard_actions_component$Crouch">();
	}
	static class Utask_AI_fort_guard_actions_component_Crouch* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_AI_fort_guard_actions_component_Crouch>();
	}
};

// VerseClass VerseFortnite.AI_npc_perception_component
// 0x0160 (0x02E0 - 0x0180)
class UAI_npc_perception_component : public UAI_ai_component
{
public:
	FVerseFunctionProperty_                       __verse_0x28550759__L_2fFortnite_2ecom_2fAI_2fnpc__perception__component_N_RGetDetectedTargets; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x35188265__L_2fFortnite_2ecom_2fAI_2fnpc__perception__component_N_RGetDetectedTarget_L_Nagent_R; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x9EA5F95D__L_2fFortnite_2ecom_2fAI_2fnpc__perception__component_N_RTargetAddedEvent; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x59015AC4__L_2fFortnite_2ecom_2fAI_2fnpc__perception__component_N_RTargetInfoUpdatedEvent; // 0x01B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x14A19E61__L_2fFortnite_2ecom_2fAI_2fnpc__perception__component_N_RTargetRemovedEvent; // 0x01C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0D5EF4D3__L_2fFortnite_2ecom_2fAI_2fnpc__perception__component_N_RTargetSeenEvent; // 0x01D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB05FB882__L_2fFortnite_2ecom_2fAI_2fnpc__perception__component_N_RTargetHeardEvent; // 0x01E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x73583C43__L_2fFortnite_2ecom_2fAI_2fnpc__perception__component_N_RTargetTouchedEvent; // 0x01F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF54EB0C8__L_2fFortnite_2ecom_2fAI_2fnpc__perception__component_N_RGetSightSettings; // 0x0200(0x0010)(InstancedReference, HasGetValueTypeHash)
