#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseFortniteUI_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "VerseFortnite_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "VerseFortniteUI_0_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UIFramework_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "LocalizableMessage_structs.hpp"


namespace SDK
{

// Class VerseFortniteUI.VerseFortniteUIAllowedConversionLibrary
// 0x0000 (0x0028 - 0x0028)
class UVerseFortniteUIAllowedConversionLibrary : public UBlueprintFunctionLibrary
{
public:
	static double AddDoubles(double A, bool bNegateA, double B, bool bNegateB);
	static double AddIntDouble(int64 A, bool bNegateA, double B, bool bNegateB);
	static int64 AddIntegers(int64 A, bool bNegateA, int64 B, bool bNegateB);
	static ESlateVisibility Conv_BoolToSlateVisibility(bool bIsVisible, ESlateVisibility TrueVisibility, ESlateVisibility FalseVisibility);
	static bool Conv_DoubleToBoolInterval(double Value, double InclusiveLowerBound, double InclusiveUpperBound);
	static bool Conv_DoubleToBoolSimple(double Value);
	static class FText Conv_DoubleToText(double Value, ERoundingMode RoundingMode, bool bAlwaysSign, bool bUseGrouping, int32 MinimumIntegralDigits, int32 MaximumIntegralDigits, int32 MinimumFractionalDigits, int32 MaximumFractionalDigits);
	static bool Conv_IntegerToBoolInterval(int64 Value, int64 InclusiveLowerBound, int64 InclusiveUpperBound);
	static bool Conv_IntegerToBoolSimple(int64 Value);
	static class FText Conv_IntToText(int64 Value, bool bAlwaysSign, bool bUseGrouping, int64 MinimumIntegralDigits, int64 MaximumIntegralDigits);
	static struct FSlateColor Conv_LinearColorToSlateColor(const struct FLinearColor& Value);
	static struct FLinearColor Conv_SlateColorToLinearColor(const struct FSlateColor& Value);
	static bool InvertBool(bool bValue);
	static struct FSlateBrush MakeImageBrushFromMaterial(class UMaterialInterface* Material, const struct FVector2D& ImageSize, const struct FLinearColor& TintColor);
	static struct FSlateBrush MakeImageBrushFromTexture(class UTexture2D* Image, const struct FVector2D& ImageSize, const struct FLinearColor& LinearColor, ESlateBrushTileType TileType);
	static struct FWidgetTransform MakeTransform(const struct FVector2D& Translation, const struct FVector2D& Scale, const struct FVector2D& Shear, double Angle);
	static double MultiplyDoubles(double A, bool bInvertA, double B, bool bInvertB);
	static double MultiplyIntDouble(int64 A, bool bInvertA, double B, bool bInvertB);
	static int64 MultiplyIntegers(int64 A, int64 B, bool bInvertB);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIAllowedConversionLibrary">();
	}
	static class UVerseFortniteUIAllowedConversionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIAllowedConversionLibrary>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIConversionLibrary
// 0x0000 (0x0028 - 0x0028)
class UVerseFortniteUIConversionLibrary final : public UVerseFortniteUIAllowedConversionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIConversionLibrary">();
	}
	static class UVerseFortniteUIConversionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIConversionLibrary>();
	}
};

// Class VerseFortniteUI.VerseFortnitePlayspaceHUDController
// 0x0098 (0x00C0 - 0x0028)
class UVerseFortnitePlayspaceHUDController : public UVerseFortnitePlayspaceExtensionBase
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDElementVisibilityRepData           VisibilityData;                                    // 0x0038(0x0088)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortnitePlayspaceHUDController">();
	}
	static class UVerseFortnitePlayspaceHUDController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortnitePlayspaceHUDController>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIOverlaySlot
// 0x0018 (0x0070 - 0x0058)
class UVerseFortniteUIOverlaySlot final : public UOverlaySlot
{
public:
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIOverlaySlot">();
	}
	static class UVerseFortniteUIOverlaySlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIOverlaySlot>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIOverlay
// 0x0018 (0x01A0 - 0x0188)
class UVerseFortniteUIOverlay final : public UOverlay
{
public:
	uint8                                         Pad_188[0x18];                                     // 0x0188(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIOverlay">();
	}
	static class UVerseFortniteUIOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIOverlay>();
	}
};

// Class VerseFortniteUI.VerseFortniteUINamedSlot
// 0x0010 (0x0198 - 0x0188)
class UVerseFortniteUINamedSlot final : public UNamedSlot
{
public:
	uint8                                         Pad_188[0x10];                                     // 0x0188(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUINamedSlot">();
	}
	static class UVerseFortniteUINamedSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUINamedSlot>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIActivableWidgetBase
// 0x0030 (0x0428 - 0x03F8)
class UVerseFortniteUIActivableWidgetBase final : public UCommonActivatableWidget
{
public:
	class UVerseFortniteUINamedSlot*              MainSlot;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_400[0x8];                                      // 0x0400(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    MainMenuInputRowHandle;                            // 0x0408(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayTagContainer>          HudToDeactivateOnInitialization;                   // 0x0418(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIActivableWidgetBase">();
	}
	static class UVerseFortniteUIActivableWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIActivableWidgetBase>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIPresenter
// 0x0088 (0x00C0 - 0x0038)
class UVerseFortniteUIPresenter final : public UUIFrameworkGameViewportPresenter
{
public:
	TArray<struct FVerseFortniteUIPresenterElement> Pending;                                         // 0x0038(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FVerseFortniteUIPresenterElement> Created;                                         // 0x0048(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UVerseFortniteUIOverlay*                PlayerGameViewport;                                // 0x0058(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerseFortniteUIOverlay*                ContentGameViewport;                               // 0x0060(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerseFortniteUIActivableWidgetBase*    PopupContainer;                                    // 0x0068(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   WidgetForDynamicUI;                                // 0x0078(0x0020)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UCommonInputActionDomain> ActionDomainForDynamicUI;                         // 0x0098(0x0020)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIPresenter">();
	}
	static class UVerseFortniteUIPresenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIPresenter>();
	}
};

// Class VerseFortniteUI.VerseFortniteWidgetViewmodel
// 0x0000 (0x0028 - 0x0028)
class UVerseFortniteWidgetViewmodel final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteWidgetViewmodel">();
	}
	static class UVerseFortniteWidgetViewmodel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteWidgetViewmodel>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIFrameworkButton_Base
// 0x0058 (0x0120 - 0x00C8)
class UVerseFortniteUIFrameworkButton_Base : public UUIFrameworkWidget
{
public:
	class FText                                   Text;                                              // 0x00C8(0x0010)(NativeAccessSpecifierPrivate)
	struct FLocalizableMessage                    Message;                                           // 0x00D8(0x0030)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_Message();
	void ServerClick(class APlayerController* PlayerController);

	class FText GetText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIFrameworkButton_Base">();
	}
	static class UVerseFortniteUIFrameworkButton_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIFrameworkButton_Base>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIFrameworkButton_Loud
// 0x0000 (0x0120 - 0x0120)
class UVerseFortniteUIFrameworkButton_Loud final : public UVerseFortniteUIFrameworkButton_Base
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIFrameworkButton_Loud">();
	}
	static class UVerseFortniteUIFrameworkButton_Loud* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIFrameworkButton_Loud>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIFrameworkButton_Regular
// 0x0000 (0x0120 - 0x0120)
class UVerseFortniteUIFrameworkButton_Regular final : public UVerseFortniteUIFrameworkButton_Base
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIFrameworkButton_Regular">();
	}
	static class UVerseFortniteUIFrameworkButton_Regular* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIFrameworkButton_Regular>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIFrameworkButton_Quiet
// 0x0000 (0x0120 - 0x0120)
class UVerseFortniteUIFrameworkButton_Quiet final : public UVerseFortniteUIFrameworkButton_Base
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIFrameworkButton_Quiet">();
	}
	static class UVerseFortniteUIFrameworkButton_Quiet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIFrameworkButton_Quiet>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIFrameworkText_Base
// 0x0018 (0x0138 - 0x0120)
class UVerseFortniteUIFrameworkText_Base : public UUIFrameworkTextBase
{
public:
	uint8                                         Pad_120[0x18];                                     // 0x0120(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExecuteServerTextCommitted(const class FText& InText, ETextCommit InCommitMethod);
	void ServerTextCommitted(class APlayerController* PlayerController, const class FText& NewText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIFrameworkText_Base">();
	}
	static class UVerseFortniteUIFrameworkText_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIFrameworkText_Base>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIFrameworkTextBlock
// 0x0000 (0x0138 - 0x0138)
class UVerseFortniteUIFrameworkTextBlock final : public UUIFrameworkTextBlock
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIFrameworkTextBlock">();
	}
	static class UVerseFortniteUIFrameworkTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIFrameworkTextBlock>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIFrameworkEditableText
// 0x0000 (0x0138 - 0x0138)
class UVerseFortniteUIFrameworkEditableText final : public UVerseFortniteUIFrameworkText_Base
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIFrameworkEditableText">();
	}
	static class UVerseFortniteUIFrameworkEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIFrameworkEditableText>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIFrameworkEditableTextBox
// 0x0000 (0x0138 - 0x0138)
class UVerseFortniteUIFrameworkEditableTextBox final : public UVerseFortniteUIFrameworkText_Base
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIFrameworkEditableTextBox">();
	}
	static class UVerseFortniteUIFrameworkEditableTextBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIFrameworkEditableTextBox>();
	}
};

// Class VerseFortniteUI.VerseFortniteUIFrameworkSlider
// 0x0040 (0x0108 - 0x00C8)
class UVerseFortniteUIFrameworkSlider final : public UUIFrameworkWidget
{
public:
	struct FVerseFortniteUIFrameworkSliderValue   Value;                                             // 0x00C8(0x000C)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         MinValue;                                          // 0x00D4(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxValue;                                          // 0x00D8(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         StepSize;                                          // 0x00DC(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x28];                                      // 0x00E0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExecuteServerValueChanged(float InNewValue, int32 InClientID, int32 InServerID);
	void HandleValueChanged(float NewValue);
	void OnRep_MaxValue();
	void OnRep_MinValue();
	void OnRep_StepSize();
	void OnRep_Value();
	void ServerValueChanged(class APlayerController* PlayerController, float InNewValue, int32 InClientID, int32 InServerID);
	void SetMaxValue(float InMaxValue);
	void SetMinValue(float InMinValue);
	void SetStepSize(float InMinValue);
	bool SetValue(float InValue);

	float GetMaxValue() const;
	float GetMinValue() const;
	float GetStepSize() const;
	float GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseFortniteUIFrameworkSlider">();
	}
	static class UVerseFortniteUIFrameworkSlider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerseFortniteUIFrameworkSlider>();
	}
};

}

