#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseCamera_0

#include "Basic.hpp"

#include "EpicGamesTemporary_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK
{

// VerseStruct VerseCamera.tuple_L_R
// 0x0001 (0x0001 - 0x0000)
struct VerseCamera_0::Ftuple_L_R final
{
public:
	uint8                                         _StructPaddingDummy;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseCamera.tuple_Lcamera__behavior__component_Mtuple_L_R_Mint_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lcamera__behavior__component_Mtuple_L_R_Mint_R final
{
public:
	class UVerseCamera_camera_behavior_component* __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseCamera_0::Ftuple_L_R              __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseCamera.tuple_Lcamera__behavior__component_Mtuple_L_R_Mplayer_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lcamera__behavior__component_Mtuple_L_R_Mplayer_R final
{
public:
	class UVerseCamera_camera_behavior_component* __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct VerseCamera_0::Ftuple_L_R              __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0001)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation_player*                     __verse_0x932BF92E_Elem2;                          // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseCamera.tuple_Lcamera__evaluation__context__input__parameters_Mcamera__evaluation__context__output__parameters_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lcamera__evaluation__context__input__parameters_Mcamera__evaluation__context__output__parameters_R final
{
public:
	class UVerseCamera_camera_evaluation_context_input_parameters* __verse_0x18E3F084_Elem0;         // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_evaluation_context_output_parameters* __verse_0x7D844C3C_Elem1;        // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseCamera.tuple_Lcamera__operation__input__parameters_Mcamera__operation__output__parameters_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lcamera__operation__input__parameters_Mcamera__operation__output__parameters_R final
{
public:
	class UVerseCamera_camera_operation_input_parameters* __verse_0x18E3F084_Elem0;                  // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerseCamera_camera_operation_output_parameters* __verse_0x7D844C3C_Elem1;                 // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// VerseStruct VerseCamera.tuple_Lcamera__variable__float_Mfloat_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lcamera__variable__float_Mfloat_R final
{
public:
	class UAssets_camera_variable_float*          __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseCamera.tuple_Lcamera__variable__integer_Mint_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lcamera__variable__integer_Mint_R final
{
public:
	class UAssets_camera_variable_integer*        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// VerseStruct VerseCamera.tuple_Lcamera__variable__logic_Mlogic_R
// 0x0010 (0x0010 - 0x0000)
struct Ftuple_Lcamera__variable__logic_Mlogic_R final
{
public:
	class UAssets_camera_variable_logic*          __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         __verse_0x7D844C3C_Elem1 : 1;                      // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
};

// VerseStruct VerseCamera.tuple_Lcamera__variable__rotation_Mrotation_R
// 0x0030 (0x0030 - 0x0000)
struct Ftuple_Lcamera__variable__rotation_Mrotation_R final
{
public:
	class UAssets_camera_variable_rotation*       __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVerseRotation                         __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0020)(InstancedReference, NoDestructor)
};

// VerseStruct VerseCamera.tuple_Lcamera__variable__transform_Mtransform_R
// 0x0070 (0x0070 - 0x0000)
struct Ftuple_Lcamera__variable__transform_Mtransform_R final
{
public:
	class UAssets_camera_variable_transform*      __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpatialMath_transform                 __verse_0x7D844C3C_Elem1;                          // 0x0010(0x0060)(InstancedReference, NoDestructor)
};

// VerseStruct VerseCamera.tuple_Lcamera__variable__vector2_Mvector2_R
// 0x0018 (0x0018 - 0x0000)
struct Ftuple_Lcamera__variable__vector2_Mvector2_R final
{
public:
	class UAssets_camera_variable_vector2*        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector2                   __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0010)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

// VerseStruct VerseCamera.tuple_Lcamera__variable__vector3_Mvector3_R
// 0x0020 (0x0020 - 0x0000)
struct Ftuple_Lcamera__variable__vector3_Mvector3_R final
{
public:
	class UAssets_camera_variable_vector3*        __verse_0x18E3F084_Elem0;                          // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSpatialMath_vector3                   __verse_0x7D844C3C_Elem1;                          // 0x0008(0x0018)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor)
};

}

