#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseNative

#include "Basic.hpp"


namespace SDK
{

// Enum VerseNative.EVerseFalse
// NumValues: 0x0002
enum class EVerseFalse : uint8
{
	Value                                    = 0,
	EVerseFalse_MAX                          = 1,
};

// Enum VerseNative.EVerseTrue
// NumValues: 0x0002
enum class EVerseTrue : uint8
{
	Value                                    = 0,
	EVerseTrue_MAX                           = 1,
};

// ScriptStruct VerseNative.SolarisProfilingData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSolarisProfilingData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct VerseNative.VerseIntRange
// 0x0010 (0x0010 - 0x0000)
struct FVerseIntRange final
{
public:
	int64                                         Left;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Right;                                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseNative.VerseRational
// 0x0010 (0x0010 - 0x0000)
struct FVerseRational final
{
public:
	int64                                         Numerator;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Denominator;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct VerseNative.akeType
// 0x0001 (0x0001 - 0x0000)
struct FakeType final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

