#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerseQuery

#include "Basic.hpp"

#include "VerseQuery_structs.hpp"
#include "VerseGameplayTags_structs.hpp"
#include "VerseNative_structs.hpp"
#include "EpicGamesTemporary_0_structs.hpp"


namespace SDK::Params
{

// Function VerseQuery.entity_query_iterator._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue
// 0x0010 (0x0010 - 0x0000)
struct entity_query_iterator__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Entity_0::UEntity*, true>     RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseQuery.null_entity_query_iterator._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue
// 0x0010 (0x0010 - 0x0000)
struct null_entity_query_iterator__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Entity_0::UEntity*, true>     RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindComponents_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindComponents_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mcomponent_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UComponent*>                     RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntities_U_L_Nentity_M_Ntuple_L_R_M_NEntityType_20where_20EntityType_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntities_U_L_Nentity_M_Ntuple_L_R_M_NEntityType_20where_20EntityType_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mentity_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mconvex__hull3_R __verse_0xB2CDDD72_Argument;                   // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesOriginInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesOriginInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mconvex__hull3_R __verse_0xB2CDDD72_Argument;                   // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesOverlapping_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesOverlapping_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mconvex__hull3_R __verse_0xB2CDDD72_Argument;                   // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesWithComponent_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesWithComponent_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mcomponent_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesWithTag_U_L_Nentity_M_Ntuple_L_R_M_Ntag_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindEntitiesWithTag_U_L_Nentity_M_Ntuple_L_R_M_Ntag_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mtag_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentComponents_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentComponents_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mcomponent_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UComponent*>                     RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntities_U_L_Nentity_M_Ntuple_L_R_M_NEntityType_20where_20EntityType_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntities_U_L_Nentity_M_Ntuple_L_R_M_NEntityType_20where_20EntityType_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mentity_R    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mconvex__hull3_R __verse_0xB2CDDD72_Argument;                   // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesOriginInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesOriginInside_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mconvex__hull3_R __verse_0xB2CDDD72_Argument;                   // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesOverlapping_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesOverlapping_U_L_Nentity_M_Ntuple_L_R_M_Nconvex__hull3_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mconvex__hull3_R __verse_0xB2CDDD72_Argument;                   // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesWithComponent_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesWithComponent_U_L_Nentity_M_Ntuple_L_R_M_NComponentType_20where_20ComponentType_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mcomponent_R __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesWithTag_U_L_Nentity_M_Ntuple_L_R_M_Ntag_R
// 0x0028 (0x0028 - 0x0000)
struct _Root__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_N_Roperator_U_2eFindParentEntitiesWithTag_U_L_Nentity_M_Ntuple_L_R_M_Ntag_R final
{
public:
	struct Ftuple_Lentity_Mtuple_L_R_Mtag_R       __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class Entity_0::UEntity*>              RetVal;                                            // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};

// Function VerseQuery._Root.overlap_result$Factory
// 0x0018 (0x0018 - 0x0000)
struct _Root_overlap_result_Factory final
{
public:
	struct Foverlap_result                        RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};

// Function VerseQuery._Root.overlap_result$OverrideFactory
// 0x0068 (0x0068 - 0x0000)
struct _Root_overlap_result_OverrideFactory final
{
public:
	struct Foverlap_result                        RetVal;                                            // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	TMap<FVerseStringProperty_, uint8>            __verse_0xFB48ED96__InitOverrideMap;               // 0x0018(0x0050)(ConstParm, Parm, ContainsInstancedReference)
};

// Function VerseQuery.collision_component.$InitCDO
// 0x0070 (0x0070 - 0x0000)
struct collision_component__InitCDO final
{
public:
	class UVerseEngine_subscribable_event*        _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_4 : 1;                                 // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_20_1 : 7;                                   // 0x0020(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_5 : 1;                                 // 0x0021(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class Uno_collision_override*                 _ExprResult_6;                                     // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_7;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_8;                                     // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_9;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerseEngine_subscribable_event*        _ExprResult_10;                                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_11;                               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _ExprResult_12 : 1;                                // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         BitPad_58_1 : 7;                                   // 0x0058(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         _ExprResult_13 : 1;                                // 0x0059(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class Uno_collision_override*                 _ExprResult_14;                                    // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_15;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseQuery.collision_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RGetCollisionOverride
// 0x0010 (0x0010 - 0x0000)
struct collision_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RGetCollisionOverride final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class Ucollision_override*                    RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseQuery.collision_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RSetCollisionOverride_L_Ncollision__override_R
// 0x0008 (0x0008 - 0x0000)
struct collision_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcollision__component_N_RSetCollisionOverride_L_Ncollision__override_R final
{
public:
	class Ucollision_override*                    __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseQuery.collision_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable
// 0x0001 (0x0001 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_RDisable final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseQuery.collision_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable
// 0x0001 (0x0001 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_REnable final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseQuery.collision_component._L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled
// 0x0003 (0x0003 - 0x0000)
struct collision_component__L_2fVerse_2eorg_2fVerse_2fenableable_N_RIsEnabled final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0001(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseQuery.shape3._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fshape3_N_RDebugDraw
// 0x0001 (0x0001 - 0x0000)
struct shape3__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fshape3_N_RDebugDraw final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseQuery.convex_hull3._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fconvex__hull3_N_RContains_L_Nvector3_R
// 0x0020 (0x0020 - 0x0000)
struct convex_hull3__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fconvex__hull3_N_RContains_L_Nvector3_R final
{
public:
	struct FSpatialMath_vector3                   __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TOptional<EVerseTrue>                         RetVal;                                            // 0x0018(0x0002)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseQuery.axis_aligned_box3.$InitCDO
// 0x0260 (0x0260 - 0x0000)
struct axis_aligned_box3__InitCDO final
{
public:
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_1;                                // 0x0018(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0068(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_5;                                     // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_6;                                // 0x00B0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0120(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_10;                                    // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_11;                               // 0x0148(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_12;                                    // 0x0198(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_13;                                    // 0x01A8(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_14;                                    // 0x01B8(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_15;                                    // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_16;                               // 0x01E0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_17;                                    // 0x0230(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_18;                                    // 0x0240(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_19;                                    // 0x0250(0x0010)(HasGetValueTypeHash)
};

// Function VerseQuery.axis_aligned_box3._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fshape3_N_RDebugDraw
// 0x0001 (0x0001 - 0x0000)
struct axis_aligned_box3__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fshape3_N_RDebugDraw final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseQuery.component_query_iterator_interface._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue
// 0x0010 (0x0010 - 0x0000)
struct component_query_iterator_interface__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UComponent*, true>            RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseQuery.entity_query_iterator_interface._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue
// 0x0010 (0x0010 - 0x0000)
struct entity_query_iterator_interface__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Entity_0::UEntity*, true>     RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseQuery.null_component_query_iterator._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue
// 0x0010 (0x0010 - 0x0000)
struct null_component_query_iterator__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UComponent*, true>            RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseQuery.slow_component_array_copy_query_iterator._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue
// 0x0010 (0x0010 - 0x0000)
struct slow_component_array_copy_query_iterator__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent__query__iterator__interface_N_RNextValue final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class UComponent*, true>            RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseQuery.slow_entity_array_copy_query_iterator._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue
// 0x0010 (0x0010 - 0x0000)
struct slow_entity_array_copy_query_iterator__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fentity__query__iterator__interface_N_RNextValue final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<class Entity_0::UEntity*, true>     RetVal;                                            // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function VerseQuery.tag_component.$InitCDO
// 0x0040 (0x0040 - 0x0000)
struct tag_component__InitCDO final
{
public:
	class UTags_tag_container*                    _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseGameplayTagContainer             _ExprResult_2;                                     // 0x0010(0x0010)()
	class UTags_tag_container*                    _ExprResult_3;                                     // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_4;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVerseGameplayTagContainer             _ExprResult_5;                                     // 0x0030(0x0010)()
};

// Function VerseQuery.tag_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene
// 0x0001 (0x0001 - 0x0000)
struct tag_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnAddedToScene final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseQuery.tag_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene
// 0x0001 (0x0001 - 0x0000)
struct tag_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fcomponent_N_ROnRemovingFromScene final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseQuery.tag_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RAddTag_L_Ntag_R
// 0x0008 (0x0008 - 0x0000)
struct tag_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RAddTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseQuery.tag_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RGetTags
// 0x0010 (0x0010 - 0x0000)
struct tag_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RGetTags final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                RetVal;                                            // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
};

// Function VerseQuery.tag_component._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RRemoveTag_L_Ntag_R
// 0x0010 (0x0010 - 0x0000)
struct tag_component__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2ftag__component_N_RRemoveTag_L_Ntag_R final
{
public:
	class UTags_tag*                              __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         RetVal : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};

// Function VerseQuery.sphere3.$InitCDO
// 0x0130 (0x0130 - 0x0000)
struct sphere3__InitCDO final
{
public:
	struct FSpatialMath_vector3                   _ExprResult_0;                                     // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_1;                                // 0x0018(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_2;                                     // 0x0068(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_3;                                     // 0x0078(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_4;                                     // 0x0088(0x0010)(HasGetValueTypeHash)
	struct FSpatialMath_vector3                   _ExprResult_5;                                     // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<FVerseStringProperty_, uint8>            _ExprResultStack_6;                                // 0x00B0(0x0050)(ContainsInstancedReference)
	FVerseStringProperty_                         _ExprResult_7;                                     // 0x0100(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_8;                                     // 0x0110(0x0010)(HasGetValueTypeHash)
	FVerseStringProperty_                         _ExprResult_9;                                     // 0x0120(0x0010)(HasGetValueTypeHash)
};

// Function VerseQuery.sphere3._L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fshape3_N_RDebugDraw
// 0x0001 (0x0001 - 0x0000)
struct sphere3__L_2fUnrealEngine_2ecom_2fTemporary_2fSceneGraph_2fshape3_N_RDebugDraw final
{
public:
	struct VerseQuery::Ftuple_L_R                 __verse_0xB2CDDD72_Argument;                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function VerseQuery.volume_collision_override.$InitCDO
// 0x0020 (0x0020 - 0x0000)
struct volume_collision_override__InitCDO final
{
public:
	class Usphere3*                               _ExprResult_0;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_1;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Usphere3*                               _ExprResult_2;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint64                                        _InstancingGraph_3;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

