#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VGameplayRst_0

#include "Basic.hpp"

#include "EpicGamesTemporary_0_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EntityActor_classes.hpp"
#include "VGameplayRst_classes.hpp"
#include "VGameplayRst_0_structs.hpp"
#include "VerseNative_0_classes.hpp"
#include "VerseNative_structs.hpp"
#include "EntityCore_classes.hpp"


namespace SDK
{

// VerseClass VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitEndOverlap
// 0x0018 (0x0170 - 0x0158)
class Utask_VGameplayRst_Physics_vk_collision_component_WaitEndOverlap final : public UConcurrency_task
{
public:
	class UVGameplayRst_Physics_vk_collision_component* _Self;                                       // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Physics_vk_overlap_result* _RetVal;                                          // 0x0168(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VGameplayRst_Physics_vk_collision_component$WaitEndOverlap">();
	}
	static class Utask_VGameplayRst_Physics_vk_collision_component_WaitEndOverlap* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VGameplayRst_Physics_vk_collision_component_WaitEndOverlap>();
	}
};

// VerseClass VGameplayRst.task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionComplete
// 0x0010 (0x0168 - 0x0158)
class Utask_VGameplayRst_Components_dynamic_activation_component_WaitForTransitionComplete final : public UConcurrency_task
{
public:
	class UVGameplayRst_Components_dynamic_activation_component* _Self;                              // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionComplete">();
	}
	static class Utask_VGameplayRst_Components_dynamic_activation_component_WaitForTransitionComplete* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VGameplayRst_Components_dynamic_activation_component_WaitForTransitionComplete>();
	}
};

// VerseClass VGameplayRst.$SolarisSignatureFunctionOuter
// 0x0000 (0x0028 - 0x0028)
class VGameplayRst_0::U_SolarisSignatureFunctionOuter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VerseClass VGameplayRst.$SolarisSignatureFunctionOuter", true>();
	}
	static class VGameplayRst_0::U_SolarisSignatureFunctionOuter* GetDefaultObj()
	{
		return GetDefaultObjImpl<VGameplayRst_0::U_SolarisSignatureFunctionOuter>();
	}
};

// VerseClass VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitBeginOverlap
// 0x0018 (0x0170 - 0x0158)
class Utask_VGameplayRst_Physics_vk_collision_component_WaitBeginOverlap final : public UConcurrency_task
{
public:
	class UVGameplayRst_Physics_vk_collision_component* _Self;                                       // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVGameplayRst_Physics_vk_overlap_result* _RetVal;                                          // 0x0168(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VGameplayRst_Physics_vk_collision_component$WaitBeginOverlap">();
	}
	static class Utask_VGameplayRst_Physics_vk_collision_component_WaitBeginOverlap* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VGameplayRst_Physics_vk_collision_component_WaitBeginOverlap>();
	}
};

// VerseClass VGameplayRst.task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionBegin
// 0x0010 (0x0168 - 0x0158)
class Utask_VGameplayRst_Components_dynamic_activation_component_WaitForTransitionBegin final : public UConcurrency_task
{
public:
	class UVGameplayRst_Components_dynamic_activation_component* _Self;                              // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VGameplayRst_Components_dynamic_activation_component$WaitForTransitionBegin">();
	}
	static class Utask_VGameplayRst_Components_dynamic_activation_component_WaitForTransitionBegin* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VGameplayRst_Components_dynamic_activation_component_WaitForTransitionBegin>();
	}
};

// VerseClass VGameplayRst.task_VGameplayRst_Physics_vk_collision_component$WaitHit
// 0x0050 (0x01A8 - 0x0158)
class Utask_VGameplayRst_Physics_vk_collision_component_WaitHit final : public UConcurrency_task
{
public:
	class UVGameplayRst_Physics_vk_collision_component* _Self;                                       // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVGameplayRst_Physics_hit_result_legacy _RetVal;                                          // 0x0168(0x0040)(Parm, OutParm, ReturnParm, NoDestructor)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VGameplayRst_Physics_vk_collision_component$WaitHit">();
	}
	static class Utask_VGameplayRst_Physics_vk_collision_component_WaitHit* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VGameplayRst_Physics_vk_collision_component_WaitHit>();
	}
};

// VerseClass VGameplayRst.task_VGameplayRst_Messaging_debug_command_component$__WaitForCommand_L_N_Kchar_R
// 0x0028 (0x0180 - 0x0158)
class Utask_VGameplayRst_Messaging_debug_command_component___WaitForCommand_L_N_Kchar_R final : public UConcurrency_task
{
public:
	class UVGameplayRst_Messaging_debug_command_component* _Self;                                    // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FVerseStringProperty_                         __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0010)(Parm, HasGetValueTypeHash)
	FVerseStringProperty_                         _RetVal;                                           // 0x0170(0x0010)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VGameplayRst_Messaging_debug_command_component$__WaitForCommand_L_N_Kchar_R">();
	}
	static class Utask_VGameplayRst_Messaging_debug_command_component___WaitForCommand_L_N_Kchar_R* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VGameplayRst_Messaging_debug_command_component___WaitForCommand_L_N_Kchar_R>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_GameObjects
// 0x0000 (0x0028 - 0x0028)
class UVGameplayRst_GameObjects final : public UObject
{
public:
	static TOptional<class UVGameplayRst_GameObjects_immutable_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateImmutableModel_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_immutable_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateImmutableModel_L_Nvk__entity_M_N_Ksubtype_Lvk__component_R_R(const struct Ftuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_immutable_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateImmutableModel_L_Nvk__entity_R(class UVerseEngine_Entity_vk_entity* __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_M_Nmaterial_R(const struct Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_Mmaterial_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Ntransform_M_N_Kchar_M_Nmesh_R(const struct Ftuple_L_Ksubtype_Lvk__component_R_Mtransform_M_Kchar_Mmesh_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_N_Ksubtype_Lvk__component_R_M_Nvector3_M_Nrotation_M_Nvector3_M_N_Kchar_M_Nmesh_M_Nmaterial_R(const struct Ftuple_L_Ksubtype_Lvk__component_R_Mvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Ntransform_M_N_Kchar_M_Nmesh_M_Nmaterial_R(const struct Ftuple_Ltransform_M_Kchar_Mmesh_Mmaterial_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Ntransform_M_N_Kchar_M_Nmesh_R(const struct Ftuple_Ltransform_M_Kchar_Mmesh_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Nvector3_M_N_Kchar_M_Nmesh_M_Nmaterial_R(const struct Ftuple_Lvector3_M_Kchar_Mmesh_Mmaterial_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Nvector3_M_Nrotation_M_N_Kchar_M_Nmesh_M_Nmaterial_R(const struct Ftuple_Lvector3_Mrotation_M_Kchar_Mmesh_Mmaterial_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Nvector3_M_Nrotation_M_Nvector3_M_N_Kchar_M_Nmesh_M_Nmaterial_R(const struct Ftuple_Lvector3_Mrotation_Mvector3_M_Kchar_Mmesh_Mmaterial_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Nvk__entity_M_N_Ksubtype_Lvk__component_R_R(const struct Ftuple_Lvk__entity_M_Ksubtype_Lvk__component_R_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_model*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateModel_L_Nvk__entity_R(class UVerseEngine_Entity_vk_entity* __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_world_anchor*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateWorldAnchor_L_Ntag_R(class UTags_tag* __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_world_anchor*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateWorldAnchor_L_Nvector3_M_N_Kchar_R(const struct VGameplayRst_0::Ftuple_Lvector3_M_Kchar_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_world_anchor*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateWorldAnchor_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVGameplayRst_GameObjects_world_anchor*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_N_RCreateWorldAnchor_L_Nvk__entity_R(class UVerseEngine_Entity_vk_entity* __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_GameObjects">();
	}
	static class UVGameplayRst_GameObjects* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_GameObjects>();
	}
};

// VerseClass VGameplayRst.task_VGameplayRst_Physics_physics_trace$WaitPhysicsTrace
// 0x0020 (0x0178 - 0x0158)
class Utask_VGameplayRst_Physics_physics_trace_WaitPhysicsTrace final : public UConcurrency_task
{
public:
	class UVGameplayRst_Physics_physics_trace*    _Self;                                             // 0x0158(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct VGameplayRst_0::Ftuple_L_R             __verse_0xB2CDDD72_Argument;                       // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVGameplayRst_Physics_hit_result_legacy> _RetVal;                                  // 0x0168(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)

public:
	int64 Update();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"task_VGameplayRst_Physics_physics_trace$WaitPhysicsTrace">();
	}
	static class Utask_VGameplayRst_Physics_physics_trace_WaitPhysicsTrace* GetDefaultObj()
	{
		return GetDefaultObjImpl<Utask_VGameplayRst_Physics_physics_trace_WaitPhysicsTrace>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_Transform_positionable
// 0x0000 (0x0028 - 0x0028)
class UVGameplayRst_Transform_positionable final : public UObject
{
public:
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_Transform_positionable">();
	}
	static class UVGameplayRst_Transform_positionable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_Transform_positionable>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_Audio_audio_component
// 0x0030 (0x00C8 - 0x0098)
class UVGameplayRst_Audio_audio_component final : public UAudioComponentBase
{
public:
	FVerseFunctionProperty_                       __verse_0xEF592EC2__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x75A5E42C__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_RBeginSound; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE11C57C9__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_REndSound; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_RBeginSound(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_REndSound(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fAudio_2faudio__component_N_RSetSound_L_Nsound_R(class UAssets_sound* __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_Audio_audio_component">();
	}
	static class UVGameplayRst_Audio_audio_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_Audio_audio_component>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_Messaging_debug_command_component
// 0x0078 (0x00D0 - 0x0058)
class UVGameplayRst_Messaging_debug_command_component final : public UEntityComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xEAC1FE47___WaitForCommand_L_N_Kchar_R;   // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_68[0x68];                                      // 0x0068(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	class UConcurrency_task* __WaitForCommand_L_N_Kchar_R(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, FVerseStringProperty_ __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_Messaging_debug_command_component">();
	}
	static class UVGameplayRst_Messaging_debug_command_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_Messaging_debug_command_component>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_Components_dynamic_activation_component
// 0x0078 (0x0128 - 0x00B0)
class UVGameplayRst_Components_dynamic_activation_component final : public UEntityDynamicActivationComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x4937B575__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RBeginTransition_L_Nfloat_M_Nactivation__state_R; // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA8ECA743__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RReset; // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB19A5B84__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RLinkComponent_L_Nvk__component_R; // 0x00D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDF07AC83__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RUnlinkComponent_L_Nvk__component_R; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA7099383_WaitForTransitionBegin;         // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x25AD5386_WaitForTransitionComplete;      // 0x0100(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_110[0x18];                                     // 0x0110(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RBeginTransition_L_Nfloat_M_Nactivation__state_R(const struct Ftuple_Lfloat_Mactivation__state_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RLinkComponent_L_Nvk__component_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RReset(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fdynamic__activation__component_N_RUnlinkComponent_L_Nvk__component_R(class UEntityComponent* __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForTransitionBegin(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UConcurrency_task* WaitForTransitionComplete(class UConcurrency_task* __verse_0xC1E81372_CallingTask, int64 __verse_0xA3A00DDB_CallerResumeState, int64 __verse_0x2AC0E4D8_CallerCancelState, const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_Components_dynamic_activation_component">();
	}
	static class UVGameplayRst_Components_dynamic_activation_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_Components_dynamic_activation_component>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_Components_script_component
// 0x0140 (0x01F0 - 0x00B0)
class UVGameplayRst_Components_script_component final : public UEntityScriptComponent
{
public:
	FVerseFunctionProperty_                       __verse_0xD2F3F257__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RAddToCreateComponentList_L_N_Ksubtype_Lvk__component_R_R; // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x35D264F3__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RAddToRequiredComponentList_L_N_Ksubtype_Lvk__component_R_R; // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE7468F17__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RSetTickEnabled_L_Nlogic_R; // 0x00D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF5BA8380__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnTick_L_Nfloat_R; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4D76F3C9__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnCreate; // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC228BDAF__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnPostCreate; // 0x0100(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDDE93D9A__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin; // 0x0110(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA8B3A9DD__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnEnd; // 0x0120(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x954F85AD__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RSetEnabled_L_Nlogic_R; // 0x0130(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xDA461B6A__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RIsEnabled; // 0x0140(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x454E1CA2__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RIsOwner_L_Nvk__entity_R; // 0x0150(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x91324C7B__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnEnabledChanged_L_Nlogic_R; // 0x0160(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFD55EDAC__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetComponentOfType_L_NcomponentType_20where_20componentType_R; // 0x0170(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2341E8B3__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetAllComponentsOfType_L_NcomponentType_20where_20componentType_R; // 0x0180(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x838E0A92__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetName; // 0x0190(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB3665BF6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetFullname; // 0x01A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         __verse_0xFAA77A2E_AllowMultiple : 1;              // 0x01B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (InstancedReference, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1B1[0x3F];                                     // 0x01B1(0x003F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RAddToCreateComponentList_L_N_Ksubtype_Lvk__component_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RAddToRequiredComponentList_L_N_Ksubtype_Lvk__component_R_R(const TArray<class UClass*>& __verse_0xB2CDDD72_Argument);
	TArray<class UEntityComponent*> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetAllComponentsOfType_L_NcomponentType_20where_20componentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	TOptional<class UEntityComponent*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetComponentOfType_L_NcomponentType_20where_20componentType_R(class UClass* __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetFullname(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	FVerseStringProperty_ _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RGetName(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RIsEnabled(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RIsOwner_L_Nvk__entity_R(class UVerseEngine_Entity_vk_entity* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnBegin(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnCreate(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnEnabledChanged_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnEnd(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnPostCreate(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_ROnTick_L_Nfloat_R(double __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RSetEnabled_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fComponents_2fscript__component_N_RSetTickEnabled_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_Components_script_component">();
	}
	static class UVGameplayRst_Components_script_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_Components_script_component>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_Datastore_datastore_component
// 0x0000 (0x0210 - 0x0210)
class UVGameplayRst_Datastore_datastore_component final : public UDatastoreComponentBase
{
public:
	void _Block();
	void _InitCDO();
	void _InitInstance();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_Datastore_datastore_component">();
	}
	static class UVGameplayRst_Datastore_datastore_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_Datastore_datastore_component>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_Datastore_DatastoreComponent
// 0x0000 (0x0028 - 0x0028)
class UVGameplayRst_Datastore_DatastoreComponent final : public UObject
{
public:
	static void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RClearAllDatastoreValues_L_Nplayer__component_R(class USimulation_player_component* __verse_0xB2CDDD72_Argument);
	static void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RSetDatastoreValue_L_Nplayer__component_M_N_Kchar_M_N_Kchar_R(const struct Ftuple_Lplayer__component_M_Kchar_M_Kchar_R& __verse_0xB2CDDD72_Argument);
	static void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fDatastore_2fDatastoreComponent_N_RSetDatastoreValueInt_L_Nplayer__component_M_N_Kchar_M_Nint_R(const struct Ftuple_Lplayer__component_M_Kchar_Mint_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_Datastore_DatastoreComponent">();
	}
	static class UVGameplayRst_Datastore_DatastoreComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_Datastore_DatastoreComponent>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_EntityUtil
// 0x0000 (0x0028 - 0x0028)
class UVGameplayRst_EntityUtil final : public UObject
{
public:
	static class UEntityComponent* _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RCreateAndAddComponent_L_Nint_M_NComponentType_20where_20ComponentType_R(const struct Ftuple_Lint_Mvk__component_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UEntityComponent*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RGetComponentOfTypeFromComponent_L_Nvk__component_M_NType_20where_20Type_R(const struct VGameplayRst_0::Ftuple_Lvk__component_Many_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UEntityComponent*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RGetComponentOfTypeFromComponentForEntity_L_Nvk__component_M_Nint_M_NType_20where_20Type_R(const struct Ftuple_Lvk__component_Mint_Many_R& __verse_0xB2CDDD72_Argument);
	static int64 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEmptyEntity_L_Ntransform_M_N_Kchar_R(const struct Ftuple_Ltransform_M_Kchar_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVerseEngine_Entity_vk_entity*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Ntransform_M_N_Kchar_R(const struct Ftuple_Ltransform_M_Kchar_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVerseEngine_Entity_vk_entity*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Nvector3_M_N_Kchar_R(const struct VGameplayRst_0::Ftuple_Lvector3_M_Kchar_R& __verse_0xB2CDDD72_Argument);
	static TOptional<class UVerseEngine_Entity_vk_entity*, true> _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntity_L_Nvector3_M_Nvector3_M_Nvector3_M_N_Kchar_R(const struct Ftuple_Lvector3_Mvector3_Mvector3_M_Kchar_R& __verse_0xB2CDDD72_Argument);
	static int64 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fEntityUtil_N_RSpawnEntityFromAsset_L_N_Kchar_M_Ntransform_M_N_Kchar_R(const struct Ftuple_L_Kchar_Mtransform_M_Kchar_R& __verse_0xB2CDDD72_Argument);

	void _InitCDO();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_EntityUtil">();
	}
	static class UVGameplayRst_EntityUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_EntityUtil>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_GameObjects_immutable_model
// 0x00B0 (0x00D8 - 0x0028)
class UVGameplayRst_GameObjects_immutable_model final : public UObject
{
public:
	class UVerseEngine_Entity_vk_entity*          __verse_0xC79F2B5D_InternalObject;                 // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x42159B8D_CollisionComp;            // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0xA6788863_MeshComp;                  // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x325D2C22_PositionComp;               // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0xF3C6D2D3_RotationComp;               // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0x1A7B631A_ScaleComp;                     // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x97F9CCE7__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fimmutable__model_N_RGetTransform; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x4FA4A983__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fimmutable__model_N_RIsVisible; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x428E927A__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7EE108BD__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCCE08903__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8C1086E6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRotation; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x80D34CB6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x257E0AE6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	struct FSpatialMath_transform _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fimmutable__model_N_RGetTransform(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fimmutable__model_N_RIsVisible(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FVerseRotation _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRotation(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_GameObjects_immutable_model">();
	}
	static class UVGameplayRst_GameObjects_immutable_model* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_GameObjects_immutable_model>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_GameObjects_model
// 0x0160 (0x0188 - 0x0028)
class UVGameplayRst_GameObjects_model final : public UObject
{
public:
	class UVerseEngine_Entity_vk_entity*          __verse_0xC79F2B5D_InternalObject;                 // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Physics_vk_collision_component* __verse_0x42159B8D_CollisionComp;            // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Geometry_fixed_mesh_component* __verse_0xA6788863_MeshComp;                  // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x325D2C22_PositionComp;               // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_rotation_component* __verse_0xF3C6D2D3_RotationComp;               // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_scale_component* __verse_0x1A7B631A_ScaleComp;                     // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCDC7855D__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RDestroy; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x0A80CBE6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RDisableCollision; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xE722450D__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_REnableCollision; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x2908AAFC__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RGetTransform; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x57C12B8D__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RHide; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC65D0B3E__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RIsVisible; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC06F4D27__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RSetTransform_L_Ntransform_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x591B080D__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RShow; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB07DDA0C__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x28ABF5BD__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RApplyAdditionalRotation_L_Nrotation_R; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7803819A__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetForwardVectorFromXY_L_Nvector3_M_Nvector3_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x5EFC99D0__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetRotation_L_Nrotation_R; // 0x0108(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x42C9456C__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R; // 0x0118(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x428E927A__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition; // 0x0128(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7EE108BD__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector; // 0x0138(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCCE08903__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector; // 0x0148(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8C1086E6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRotation; // 0x0158(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x80D34CB6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector; // 0x0168(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x257E0AE6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale; // 0x0178(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RDestroy(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RDisableCollision(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_REnableCollision(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_transform _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RGetTransform(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RHide(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	uint8 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RIsVisible(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RSetTransform_L_Ntransform_R(const struct FSpatialMath_transform& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fmodel_N_RShow(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RApplyAdditionalRotation_L_Nrotation_R(const struct FVerseRotation& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetForwardVectorFromXY_L_Nvector3_M_Nvector3_R(const struct VGameplayRst_0::Ftuple_Lvector3_Mvector3_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetRotation_L_Nrotation_R(const struct FVerseRotation& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__scalable_N_RSetScale_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FVerseRotation _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRotation(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fscalable_N_RGetScale(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_GameObjects_model">();
	}
	static class UVGameplayRst_GameObjects_model* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_GameObjects_model>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_GameObjects_model_interface
// 0x0000 (0x0028 - 0x0028)
class UVGameplayRst_GameObjects_model_interface final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_GameObjects_model_interface">();
	}
	static class UVGameplayRst_GameObjects_model_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_GameObjects_model_interface>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_GameObjects_mutable_model_interface
// 0x0000 (0x0028 - 0x0028)
class UVGameplayRst_GameObjects_mutable_model_interface final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_GameObjects_mutable_model_interface">();
	}
	static class UVGameplayRst_GameObjects_mutable_model_interface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_GameObjects_mutable_model_interface>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_Transform_rotation_component
// 0x00A8 (0x0130 - 0x0088)
class alignas(0x10) UVGameplayRst_Transform_rotation_component final : public UEntityActorRotationComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x5EFC99D0__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetRotation_L_Nrotation_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x28ABF5BD__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RApplyAdditionalRotation_L_Nrotation_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7803819A__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetForwardVectorFromXY_L_Nvector3_M_Nvector3_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x8C1086E6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRotation; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x7EE108BD__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x80D34CB6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xCCE08903__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_F8[0x38];                                      // 0x00F8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RApplyAdditionalRotation_L_Nrotation_R(const struct FVerseRotation& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetForwardVectorFromXY_L_Nvector3_M_Nvector3_R(const struct VGameplayRst_0::Ftuple_Lvector3_Mvector3_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__rotatable_N_RSetRotation_L_Nrotation_R(const struct FVerseRotation& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RForwardVector(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRightVector(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FVerseRotation _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RRotation(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2frotatable_N_RUpVector(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_Transform_rotation_component">();
	}
	static class UVGameplayRst_Transform_rotation_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_Transform_rotation_component>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_GameObjects_world_anchor
// 0x0050 (0x0078 - 0x0028)
class UVGameplayRst_GameObjects_world_anchor final : public UObject
{
public:
	class UVerseEngine_Entity_vk_entity*          __verse_0xC79F2B5D_InternalObject;                 // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVGameplayRst_Transform_position_component* __verse_0x325D2C22_PositionComp;               // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFEB528BB__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fworld__anchor_N_RDestroy; // 0x0038(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x687786B2__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fworld__anchor_N_RGetComponent; // 0x0048(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB07DDA0C__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R; // 0x0058(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x428E927A__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition; // 0x0068(0x0010)(InstancedReference, HasGetValueTypeHash)

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fworld__anchor_N_RDestroy(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	class UEntityComponent* _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGameObjects_2fworld__anchor_N_RGetComponent(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fmutable__positionable_N_RSetPosition_L_Nvector3_R(const struct FSpatialMath_vector3& __verse_0xB2CDDD72_Argument);
	struct FSpatialMath_vector3 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fTransform_2fpositionable_N_RGetPosition(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_GameObjects_world_anchor">();
	}
	static class UVGameplayRst_GameObjects_world_anchor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_GameObjects_world_anchor>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_Geometry_fixed_mesh_component
// 0x0088 (0x0128 - 0x00A0)
class UVGameplayRst_Geometry_fixed_mesh_component final : public UEntityActorStaticMeshRenderComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x40FCA0FC__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetMesh_L_Nmesh_R; // 0x00A0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xF968EB58__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetDefaultMesh_L_Ndefault__mesh__type_R; // 0x00B0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA10AB724__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetEnableCollision_L_Ncollision__type_R; // 0x00C0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xB663E558__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetAsRootComponent_L_Nlogic_M_Nlogic_R; // 0x00D0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x886B5BB6__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetMaterial_L_Nmaterial_R; // 0x00E0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x57E77982__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetMaterialAtIndex_L_Nmaterial_M_Nint_R; // 0x00F0(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x38B3A8C2__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetVisibility_L_Nlogic_R; // 0x0100(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x197826E0__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RIsVisible; // 0x0110(0x0010)(InstancedReference, HasGetValueTypeHash)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void _Block();
	void _InitCDO();
	void _InitInstance();
	uint8 _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RIsVisible(const struct VGameplayRst_0::Ftuple_L_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetAsRootComponent_L_Nlogic_M_Nlogic_R(const struct Ftuple_Llogic_Mlogic_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetDefaultMesh_L_Ndefault__mesh__type_R(EVGameplayRst_Geometry_default_mesh_type __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetEnableCollision_L_Ncollision__type_R(EVGameplayRst_Geometry_collision_type __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetMaterial_L_Nmaterial_R(class UObject* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetMaterialAtIndex_L_Nmaterial_M_Nint_R(const struct Ftuple_Lmaterial_Mint_R& __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetMesh_L_Nmesh_R(class UAssets_mesh* __verse_0xB2CDDD72_Argument);
	void _L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2ffixed__mesh__component_N_RSetVisibility_L_Nlogic_R(uint8 __verse_0xB2CDDD72_Argument);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VGameplayRst_Geometry_fixed_mesh_component">();
	}
	static class UVGameplayRst_Geometry_fixed_mesh_component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVGameplayRst_Geometry_fixed_mesh_component>();
	}
};

// VerseClass VGameplayRst.VGameplayRst_Geometry_skeletal_mesh_component
// 0x00D0 (0x0148 - 0x0078)
class UVGameplayRst_Geometry_skeletal_mesh_component final : public UEntityActorSkeletalMeshRenderComponent
{
public:
	FVerseFunctionProperty_                       __verse_0x0154FAD3__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetSkeletalMesh_L_Nskeletal__mesh_R; // 0x0078(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x624B6074__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationMode_L_Ndefault__animation__mode__type_R; // 0x0088(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x67C80806__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationInstance_L_Nanimation__instance_R; // 0x0098(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x3A850C11__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimationBlueprint_L_Nanimation__blueprint_R; // 0x00A8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x509E414C__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetAnimation_L_Nanimation_R; // 0x00B8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xA861381D__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RBeginAnimation_L_Nlogic_R; // 0x00C8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xFF409226__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_REndAnimation; // 0x00D8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0x1F4491E0__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RIsPlayingAnimation; // 0x00E8(0x0010)(InstancedReference, HasGetValueTypeHash)
	FVerseFunctionProperty_                       __verse_0xC4F7273A__L_2fUnrealEngine_2ecom_2fVGameplayRst_2fGeometry_2fskeletal__mesh__component_N_RSetMaterial_L_Nmaterial_R; // 0x00F8(0x0010)(InstancedReference, HasGetValueTypeHash)
