#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VkRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class VkRuntime.ValkyrieGameFeatureSetDefinition
// 0x0060 (0x0090 - 0x0030)
class UValkyrieGameFeatureSetDefinition final : public UPrimaryDataAsset
{
public:
	class FString                                 GameFeatureSet;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   DisplayName;                                       // 0x0040(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FString                                 ContentGuidelinesUrl;                              // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   CreationAccessPrompt;                              // 0x0060(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FString                                 CreationAccessUrl;                                 // 0x0070(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         CreationEntitlements;                              // 0x0080(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieGameFeatureSetDefinition">();
	}
	static class UValkyrieGameFeatureSetDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieGameFeatureSetDefinition>();
	}
};

// Class VkRuntime.ValkyrieGameFeatureSetMetadataSubsystem
// 0x00D8 (0x0108 - 0x0030)
class UValkyrieGameFeatureSetMetadataSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0xD8];                                      // 0x0030(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ValkyrieGameFeatureSetMetadataSubsystem">();
	}
	static class UValkyrieGameFeatureSetMetadataSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UValkyrieGameFeatureSetMetadataSubsystem>();
	}
};

}

