#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterAdvanced

#include "Basic.hpp"


namespace SDK
{

// Enum WaterAdvanced.EShallowWaterCollisionContextType
// NumValues: 0x0004
enum class EShallowWaterCollisionContextType : uint8
{
	Pawn                                     = 0,
	Vehicle                                  = 1,
	Custom                                   = 2,
	EShallowWaterCollisionContextType_MAX    = 3,
};

// ScriptStruct WaterAdvanced.ShallowWaterSimParameters
// 0x0008 (0x0008 - 0x0000)
struct FShallowWaterSimParameters final
{
public:
	float                                         WorldGridSize;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResolutionMaxAxis;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct WaterAdvanced.ShallowWaterPhysicsAssetOverride
// 0x0020 (0x0020 - 0x0000)
struct FShallowWaterPhysicsAssetOverride final
{
public:
	TSoftObjectPtr<class UPhysicsAsset>           PhysicsAsset;                                      // 0x0000(0x0020)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct WaterAdvanced.ShallowWaterCollisionContext
// 0x0018 (0x0018 - 0x0000)
struct FShallowWaterCollisionContext final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Component;                                         // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct WaterAdvanced.ShallowWaterCollisionTracker_Actor
// 0x0010 (0x0010 - 0x0000)
struct FShallowWaterCollisionTracker_Actor final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  CollisionActor;                                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct WaterAdvanced.ShallowWaterCollisionTracker_Direct
// 0x0010 (0x0010 - 0x0000)
struct FShallowWaterCollisionTracker_Direct final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AWaterBody>              WaterBody;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

