#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_Tab_Enhanced

#include "Basic.hpp"

#include "WBP_UIKit_Button_Selectable_classes.hpp"
#include "E_UI_StatusIndicator_Type_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_UI_StatusIndicator_Configuration_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_Tab_Enhanced.WBP_UIKit_Button_Tab_Enhanced_C
// 0x0050 (0x1890 - 0x1840)
class UWBP_UIKit_Button_Tab_Enhanced_C final : public UWBP_UIKit_Button_Selectable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_Tab_Enhanced_C;    // 0x1838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftClassPtr<class UClass>                   StatusIndicatorClass_0;                            // 0x1840(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          EnableCustomLayout;                                // 0x1860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1861[0x3];                                     // 0x1861(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                BangPadding;                                       // 0x1864(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EVerticalAlignment                            BangVerticalAlignment;                             // 0x1874(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          BangHorizontalAlignment;                           // 0x1875(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1876[0x2];                                     // 0x1876(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              BangNudge;                                         // 0x1878(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Configuration            Configuration_0;                                   // 0x1888(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_StatusIndicator_Type                     Type_0;                                            // 0x1889(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortBangType                                 BangType;                                          // 0x188A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188B[0x1];                                     // 0x188B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TutorialName;                                      // 0x188C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_UIKit_Button_Tab_Enhanced(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_Tab_Enhanced_C">();
	}
	static class UWBP_UIKit_Button_Tab_Enhanced_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_Tab_Enhanced_C>();
	}
};

}

