#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CosmeticGate_PurchaseInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CosmeticGate_PurchaseInfo.WBP_CosmeticGate_PurchaseInfo_C
// 0x0030 (0x02E8 - 0x02B8)
class UWBP_CosmeticGate_PurchaseInfo_C final : public UUserWidget
{
public:
	class UWBP_CosmeticGate_IslandPreview_C*      IslandPreiview_E;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticGate_IslandPreview_C*      IslandPreiview_E10;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CosmeticGate_IslandPreview_C*      IslandPreiview_T;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Body1;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Body2;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PurchaseConfirmation;                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetIslandAgeRestrictionIcons();
	void SetIslandApprovalStatus(TArray<TScriptInterface<class ICosmeticItemGatingInterface>>& Cosmetic_Item_Interfaces);
	void SetOfferInfo(class UFortStoreFrontOfferInfo* OfferInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CosmeticGate_PurchaseInfo_C">();
	}
	static class UWBP_CosmeticGate_PurchaseInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CosmeticGate_PurchaseInfo_C>();
	}
};

}

