#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Divider_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Divider_Base.WBP_UIKit_Divider_Base_C
// 0x0038 (0x02F0 - 0x02B8)
class UWBP_UIKit_Divider_Base_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DividerBar;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Div_Color_and_Opacity;                             // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Div_Width;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Div_Padding;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UIKit_Divider_Base(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetDividerOrientation(bool IsVertical);
	void SetDividerPadding(const struct FMargin& Padding_0);
	void SetDividerSpacing(double Spacing, bool IsVertical);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Divider_Base_C">();
	}
	static class UWBP_UIKit_Divider_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Divider_Base_C>();
	}
};

}

