#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Backplate_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_UI_BackplateCornerRadius_structs.hpp"
#include "S_UI_BackplateCornerRadiusValues_structs.hpp"
#include "E_UI_BackplateBrightness_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Backplate_Base.WBP_UIKit_Backplate_Base_C
// 0x0078 (0x0330 - 0x02B8)
class UWBP_UIKit_Backplate_Base_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Backplate;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_UI_BackplateBrightness                      Brightness;                                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_UI_BackplateCornerRadius                    CornerRadius;                                      // 0x02C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      BackplateMaterial;                                 // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_BackplateCornerRadiusValues      Corners;                                           // 0x02D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_BackplateCornerRadiusValues      MobileCorners;                                     // 0x0300(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BackplateMID;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UIKit_Backplate_Base(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RefreshBackplateMID();
	void SetBackplateMaterial(class UMaterialInstance* Material_Instance);
	void SetBrightness(E_UI_BackplateBrightness Brightness_0);
	void SetCornerRadius(E_UI_BackplateCornerRadius Corner_Radius);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Backplate_Base_C">();
	}
	static class UWBP_UIKit_Backplate_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Backplate_Base_C>();
	}
};

}

