#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Block_Base

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UIKit_Block_Base.WBP_UIKit_Block_Base_C.GetIsLocked
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Block_Base_C_GetIsLocked final
{
public:
	bool                                          IsLocked_0;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_Base.WBP_UIKit_Block_Base_C.GetIsSelectable
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Block_Base_C_GetIsSelectable final
{
public:
	bool                                          IsSelectable_0;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_Base.WBP_UIKit_Block_Base_C.GetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Block_Base_C_GetIsSelected final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_Base.WBP_UIKit_Block_Base_C.SetBlockVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_UIKit_Block_Base_C_SetBlockVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_Base.WBP_UIKit_Block_Base_C.SetIsLocked
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Block_Base_C_SetIsLocked final
{
public:
	bool                                          Is_Locked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_Base.WBP_UIKit_Block_Base_C.SetIsSelectable
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Block_Base_C_SetIsSelectable final
{
public:
	bool                                          Is_Selectable;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_UIKit_Block_Base.WBP_UIKit_Block_Base_C.SetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_UIKit_Block_Base_C_SetIsSelected final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

