#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UIKit_Button_Tab

#include "Basic.hpp"

#include "WBP_UIKit_Button_Selectable_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UIKit_Button_Tab.WBP_UIKit_Button_Tab_C
// 0x0030 (0x1870 - 0x1840)
class UWBP_UIKit_Button_Tab_C final : public UWBP_UIKit_Button_Selectable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_UIKit_Button_Tab_C;             // 0x1838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstance*                      TextMaterial;                                      // 0x1840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      TextOutlineMaterial;                               // 0x1848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MobileTextMaterial;                                // 0x1850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      MobileTextOutlineMaterial;                         // 0x1858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMobile;                                          // 0x1860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WBP_UIKit_Button_Tab(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UIKit_Button_Tab_C">();
	}
	static class UWBP_UIKit_Button_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UIKit_Button_Tab_C>();
	}
};

}

