#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModsUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class WeaponModsUI.AthenaEquippedItemInfoWeaponMods
// 0x0000 (0x02B8 - 0x02B8)
class UAthenaEquippedItemInfoWeaponMods final : public UUserWidget
{
public:
	void HandleWeaponFullyEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ResetItemInfo();
	void SetItemSlotInfo(const struct FFortWeaponModSlot& ModSlot);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaEquippedItemInfoWeaponMods">();
	}
	static class UAthenaEquippedItemInfoWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEquippedItemInfoWeaponMods>();
	}
};

// Class WeaponModsUI.AthenaInventoryGroupWeaponMods
// 0x0000 (0x0350 - 0x0350)
class UAthenaInventoryGroupWeaponMods final : public UAthenaInventoryGroupBase
{
public:
	void HandleButtonClicked(class UObject* Object);

	bool CanWeaponEquipMod(const class AFortWeapon* Weapon, const class UFortWeaponModItemDefinition* Mod) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryGroupWeaponMods">();
	}
	static class UAthenaInventoryGroupWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryGroupWeaponMods>();
	}
};

// Class WeaponModsUI.AthenaInventoryItemInfoWeaponMods
// 0x0000 (0x02B8 - 0x02B8)
class UAthenaInventoryItemInfoWeaponMods : public UUserWidget
{
public:
	void HandleInventoryItemSelected(class UFortItem* SelectedItem);
	void HandleInventoryPanelOpened();
	void HandleWeaponModSlotsChanged(class AFortWeapon* Weapon);
	void ResetItemInfo();
	void SetIsModifiableWeapon(const bool bIsModifiable);
	void SetItemSlotInfo(const struct FFortWeaponModSlot& ModSlot);
	void UpdateItemMods();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryItemInfoWeaponMods">();
	}
	static class UAthenaInventoryItemInfoWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryItemInfoWeaponMods>();
	}
};

// Class WeaponModsUI.AthenaInventoryItemInfoWeaponModsConfigurator
// 0x0000 (0x02B8 - 0x02B8)
class UAthenaInventoryItemInfoWeaponModsConfigurator final : public UAthenaInventoryItemInfoWeaponMods
{
public:
	void RemoveMod(class UFortWeaponModItemDefinition* ModItemDef);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryItemInfoWeaponModsConfigurator">();
	}
	static class UAthenaInventoryItemInfoWeaponModsConfigurator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryItemInfoWeaponModsConfigurator>();
	}
};

// Class WeaponModsUI.AthenaLastKillerWeaponModsInfo
// 0x0008 (0x0328 - 0x0320)
class UAthenaLastKillerWeaponModsInfo final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetKillerWeaponMods(const TArray<struct FFortWeaponModSlot>& ModSlots, const bool bShouldShowMods);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaLastKillerWeaponModsInfo">();
	}
	static class UAthenaLastKillerWeaponModsInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLastKillerWeaponModsInfo>();
	}
};

// Class WeaponModsUI.AthenaMarkerDetailsExtensionWeaponMods
// 0x0000 (0x02B8 - 0x02B8)
class UAthenaMarkerDetailsExtensionWeaponMods final : public UAthenaMarkerDetailsExtension
{
public:
	void ResetModInfo();
	void SetModInfo(const struct FFortWeaponModSlot& ModSlot);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaMarkerDetailsExtensionWeaponMods">();
	}
	static class UAthenaMarkerDetailsExtensionWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMarkerDetailsExtensionWeaponMods>();
	}
};

// Class WeaponModsUI.AthenaPickupIndicatorWeaponMods
// 0x0000 (0x02B8 - 0x02B8)
class UAthenaPickupIndicatorWeaponMods final : public UFortInteractContextInfoWidget
{
public:
	void HandlePickupHovered(class AFortPickup* Pickup);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ResetItemInfo();
	void SetEquippedWeaponItemInfo(const class UItemDefinitionBase* ItemDef);
	void SetEquippedWeaponItemSlotInfo(const struct FFortWeaponModSlot& ModSlot);
	void SetItemModifiedWeaponName(const class FText& ModifiedWeaponName);
	void SetItemSlotInfo(const struct FFortWeaponModSlot& ModSlot);

	bool IsInspectViewCollapsedBySettings() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaPickupIndicatorWeaponMods">();
	}
	static class UAthenaPickupIndicatorWeaponMods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaPickupIndicatorWeaponMods>();
	}
};

// Class WeaponModsUI.AthenaQuickBarSlotWeaponModsIndicator
// 0x0218 (0x0500 - 0x02E8)
class UAthenaQuickBarSlotWeaponModsIndicator final : public UAthenaQuickBarSlotExtensionWidgetBase
{
public:
	class UImage*                                 Image_ModOptic;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ModMag;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ModUnderbarrel;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ModBarrel;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ScopeIcon;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                            EmptyModSlotBrush;                                 // 0x0310(0x00C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            FilledModSlotBrush;                                // 0x03D0(0x00C0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UImage*>      ModSlotWidgets;                                    // 0x0490(0x0050)(BlueprintVisible, ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FGameplayTag                           WeaponModSlotOpticTag;                             // 0x04E0(0x0004)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E4[0x1C];                                     // 0x04E4(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleQuickBarSlotFocusChanged(EFortQuickBars QuickBarType, int32 QuickBarSlot);
	void HandleWeaponFullyEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void HandleWeaponModSlotsChanged(class AFortWeapon* Weapon);
	void ResetIconOpacities();
	void ResetItemInfo();
	void SetItemSlotInfo(const struct FFortWeaponModSlot& ModSlot);
	void SetItemSlotSelected(bool bIsSelected);
	void SetItemSlotsInfo(const TArray<struct FFortWeaponModSlot>& ModSlots);
	void UpdateModVisuals(const TArray<struct FFortWeaponModSlot>& ModSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaQuickBarSlotWeaponModsIndicator">();
	}
	static class UAthenaQuickBarSlotWeaponModsIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickBarSlotWeaponModsIndicator>();
	}
};

// Class WeaponModsUI.FortGameSettingRegistryExtension_WeaponModsUI
// 0x0000 (0x0028 - 0x0028)
class UFortGameSettingRegistryExtension_WeaponModsUI final : public UFortGameSettingRegistryExtension
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortGameSettingRegistryExtension_WeaponModsUI">();
	}
	static class UFortGameSettingRegistryExtension_WeaponModsUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameSettingRegistryExtension_WeaponModsUI>();
	}
};

// Class WeaponModsUI.FortPickupInteractOverrideComponent_ModdableWeapons
// 0x0010 (0x00D0 - 0x00C0)
class UFortPickupInteractOverrideComponent_ModdableWeapons final : public UFortPickupInteractOverrideComponent
{
public:
	TMulticastInlineDelegate<void(class AActor* PickUpActor)> OnAttemptSecondInteractDelegate;       // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortPickupInteractOverrideComponent_ModdableWeapons">();
	}
	static class UFortPickupInteractOverrideComponent_ModdableWeapons* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickupInteractOverrideComponent_ModdableWeapons>();
	}
};

}

