#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModsCodeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "WeaponModsCodeRuntime_structs.hpp"


namespace SDK::Params
{

// Function WeaponModsCodeRuntime.FortModStation_WeaponUICapture.RefreshCaptureWhenPSOPrecachingDone
// 0x0008 (0x0008 - 0x0000)
struct FortModStation_WeaponUICapture_RefreshCaptureWhenPSOPrecachingDone final
{
public:
	class UMeshComponent*                         PreviewMeshComponent;                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModManagementComponent.HandleWeaponUnequip
// 0x0008 (0x0008 - 0x0000)
struct FortWeaponModManagementComponent_HandleWeaponUnequip final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModManagementComponent.ServerRequestAddModToWeaponFromInventory
// 0x0020 (0x0020 - 0x0000)
struct FortWeaponModManagementComponent_ServerRequestAddModToWeaponFromInventory final
{
public:
	struct FGuid                                  WeaponModItemGUID;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  WeaponItemGuid;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModManagementComponent.ServerRequestRemoveModFromWeaponToInventory
// 0x0018 (0x0018 - 0x0000)
struct FortWeaponModManagementComponent_ServerRequestRemoveModFromWeaponToInventory final
{
public:
	class UFortWeaponModItemDefinition*           WeaponModDef;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  WeaponItemGuid;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModStationBase.GetModCostOverride
// 0x0008 (0x0008 - 0x0000)
struct FortWeaponModStationBase_GetModCostOverride final
{
public:
	float                                         OutModCostOverride;                                // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function WeaponModsCodeRuntime.FortWeaponModStationBase.GetTransactionCurrency
// 0x0008 (0x0008 - 0x0000)
struct FortWeaponModStationBase_GetTransactionCurrency final
{
public:
	class UFortResourceItemDefinition*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModStationComponent.ClientStartInteractWithWorkbenchActor
// 0x0008 (0x0008 - 0x0000)
struct FortWeaponModStationComponent_ClientStartInteractWithWorkbenchActor final
{
public:
	class AFortWeaponModStationBase*              NewInteractingWeaponModStation;                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModStationComponent.LocalPurchaseRemoveMod
// 0x0010 (0x0010 - 0x0000)
struct FortWeaponModStationComponent_LocalPurchaseRemoveMod final
{
public:
	class UFortWeaponModItemDefinition*           WeaponMod;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            Weapon;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModStationComponent.LocalPurchaseWeaponModForWeapon
// 0x0010 (0x0010 - 0x0000)
struct FortWeaponModStationComponent_LocalPurchaseWeaponModForWeapon final
{
public:
	class UFortWeaponModItemDefinition*           WeaponMod;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            Weapon;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModStationComponent.ServerPurchaseRemoveMod
// 0x0010 (0x0010 - 0x0000)
struct FortWeaponModStationComponent_ServerPurchaseRemoveMod final
{
public:
	class UFortWeaponModItemDefinition*           WeaponMod;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            Weapon;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModStationComponent.ServerPurchaseWeaponModForWeapon
// 0x0010 (0x0010 - 0x0000)
struct FortWeaponModStationComponent_ServerPurchaseWeaponModForWeapon final
{
public:
	class UFortWeaponModItemDefinition*           WeaponMod;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            Weapon;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModStationComponent.ServerStopInteractWithWorkbenchActor
// 0x0008 (0x0008 - 0x0000)
struct FortWeaponModStationComponent_ServerStopInteractWithWorkbenchActor final
{
public:
	class AFortWeaponModStationBase*              NewInteractingWeaponModStation;                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModStationComponent.StartInteractWithWorkbenchActor
// 0x0008 (0x0008 - 0x0000)
struct FortWeaponModStationComponent_StartInteractWithWorkbenchActor final
{
public:
	class AFortWeaponModStationBase*              NewInteractingWeaponModStation;                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function WeaponModsCodeRuntime.FortWeaponModStationComponent.CanPlayerAffordModForWeapon
// 0x0020 (0x0020 - 0x0000)
struct FortWeaponModStationComponent_CanPlayerAffordModForWeapon final
{
public:
	const class UFortWeaponModItemDefinition*     WeaponMod;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortWeapon*                      Weapon;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AController*                      Controller;                                        // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function WeaponModsCodeRuntime.FortWeaponModStationComponent.CanPlayerAffordRemoveModFromWeapon
// 0x0020 (0x0020 - 0x0000)
struct FortWeaponModStationComponent_CanPlayerAffordRemoveModFromWeapon final
{
public:
	const class UFortWeaponModItemDefinition*     WeaponMod;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortWeapon*                      Weapon;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AController*                      Controller;                                        // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function WeaponModsCodeRuntime.FortWeaponModStationComponent.DoesCurrentWorkbenchHaveModsForWeapon
// 0x0010 (0x0010 - 0x0000)
struct FortWeaponModStationComponent_DoesCurrentWorkbenchHaveModsForWeapon final
{
public:
	class AFortWeapon*                            Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function WeaponModsCodeRuntime.FortPickupInteractOverrideComponent_WeaponMods.ServerApplyWeaponModFromPickup
// 0x0018 (0x0018 - 0x0000)
struct FortPickupInteractOverrideComponent_WeaponMods_ServerApplyWeaponModFromPickup final
{
public:
	class AFortPickup*                            Pickup;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortWeaponModItemDefinition*     WeaponModDef;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            Weapon;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

