#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponModsCodeRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct WeaponModsCodeRuntime.FortModStationDataRow
// 0x0010 (0x0018 - 0x0008)
struct FFortModStationDataRow final : public FTableRowBase
{
public:
	class UFortWeaponModItemDefinition*           WeaponMod;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GoldCost;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct WeaponModsCodeRuntime.FortLocalModPurchaseEventParams
// 0x0010 (0x0010 - 0x0000)
struct FFortLocalModPurchaseEventParams final
{
public:
	class AFortWeapon*                            WeaponActor;                                       // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWeaponModItemDefinition*           WeaponMod;                                         // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct WeaponModsCodeRuntime.FortModSlotPurchaseList
// 0x0010 (0x0010 - 0x0000)
struct FFortModSlotPurchaseList final
{
public:
	TArray<struct FFortModStationDataRow>         Mods;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

}

